"id"	"answertype"	"question"	"sparql"
"117"	"resource"	"Give me all cars that are produced in Germany."	" PREFIX dbo: <http://dbpedia.org/ontology/> PREFIX dbp: <http://dbpedia.org/property/> PREFIX res: <http://dbpedia.org/resource/> PREFIX rdf: <http://www.w3.org/1999/02/22-rdf-syntax-ns#> SELECT DISTINCT ?uri WHERE { ?uri rdf:type dbo:Automobile . { ?uri dbo:assembly res:Germany . } UNION { ?uri dbp:asembly res:Germany . } UNION { { ?uri dbo:manufacturer ?x . } UNION { ?uri dbp:manufacturer ?x . } { ?x dbo:locationCountry res:Germany . } UNION { ?x dbo:location res:Germany . } } } "
"143"	"resource"	"Give me all breeds of the German Shepherd dog."	" PREFIX dbp: <http://dbpedia.org/property/> PREFIX res: <http://dbpedia.org/resource/> SELECT DISTINCT ?uri WHERE { ?uri dbp:bred res:German_Shepherd . } "
"160"	"resource"	"Give me a list of all lakes in Denmark."	" PREFIX dbo: <http://dbpedia.org/ontology/> PREFIX res: <http://dbpedia.org/resource/> PREFIX yago: <http://dbpedia.org/clas/yago/> PREFIX rdf: <http://www.w3.org/1999/02/22-rdf-syntax-ns#> SELECT DISTINCT ?uri WHERE { { ?uri rdf:type dbo:Lake . ?uri dbo:country res:Denmark . } UNION { ?uri rdf:type yago:LakesOfDenmark . } } "
"17"	"resource"	"Give me all cities in New Jersey with more than 100000 inhabitants."	" PREFIX dbo: <http://dbpedia.org/ontology/> PREFIX res: <http://dbpedia.org/resource/> PREFIX rdf: <http://www.w3.org/1999/02/22-rdf-syntax-ns#> SELECT DISTINCT ?uri WHERE { ?uri rdf:type dbo:City . ?uri dbo:isPartOf res:New_Jersey . ?uri dbo:populationTotal ?inhabitants . FILTER (?inhabitants > 10) . } "
"180"	"resource"	"Give me all books by William Goldman with more than 300 pages."	"PREFIX dbo: <http://dbpedia.org/ontology/>PREFIX res: <http://dbpedia.org/resource/>PREFIX rdf: <http://www.w3.org/1999/02/22-rdf-syntax-ns#>SELECT DISTINCT ?uri WHERE { ?uri rdf:type dbo:Book . ?uri dbo:author res:William_Goldman . ?uri dbo:numberOfPages ?x . FILTER (?x > 30)}"
"192"	"resource"	"Show me all songs from Bruce Springsteen released between 1980 and 1990."	"PREFIX dbo: <http://dbpedia.org/ontology/>PREFIX res: <http://dbpedia.org/resource/>PREFIX rdf: <http://www.w3.org/1999/02/22-rdf-syntax-ns#>PREFIX xsd: <http://w.w3.org/201/XMLSchema#>SELECT DISTINCT ?uri WHERE { ?uri rdf:type dbo:Song . ?uri dbo:artist res:Bruce_Springsteen . ?uri dbo:releaseDate ?date . FILTER (?date >= '1980-01-01'^xsd:date & ?date <= '190-12-31'^xsd:date)}"
"28"	"resource"	"Give me all communist countries."	"PREFIX dbo: <http://dbpedia.org/ontology/>PREFIX res: <http://dbpedia.org/resource/>PREFIX rdf: <http://www.w3.org/1999/02/22-rdf-syntax-ns#>SELECT DISTINCT ?uriWHERE { ?uri rdf:type dbo:Country . { ?uri dbo:governmentType res:Communism . } UNION { ?uri dbo:governmentType res:Communist_state . }"
"41"	"resource"	"Give me all soccer clubs in Spain."	"PREFIX dbo: <http://dbpedia.org/ontology/>PREFIX dbp: <http://dbpedia.org/property/>PREFIX res: <http://dbpedia.org/resource/>PREFIX rdf: <http://www.w3.org/1999/02/22-rdf-syntax-ns#>SELECT DISTINCT ?uriWHERE { ?uri rdf:type dbo:SoccerClub . { ?uri dbo:ground res:Spain . } UNION { ?uri dbp:ground ?ground . FILTER (regex(?ground,'Spain') }"
"49"	"resource"	"Give me all companies in the advertising industry."	"PREFIX dbp: <http://dbpedia.org/property/>PREFIX dbo: <http://dbpedia.org/ontology/>PREFIX res: <http://dbpedia.org/resource/>PREFIX rdf: <http://www.w3.org/1999/02/22-rdf-syntax-ns#>SELECT COUNT(DISTINCT ?uri)WHERE { ?uri rdf:type dbo:Company . { ?uri dbo:industry res:Advertising } UNION { ?uri dbo:industry ?industry . FILTER regex(?industry,'advertising','i') . }"
"51"	"resource"	"Give me all libraries established earlier than 1400."	"PREFIX dbo: <http://dbpedia.org/ontology/>PREFIX dbp: <http://dbpedia.org/property/>PREFIX rdf: <http://www.w3.org/1999/02/22-rdf-syntax-ns#>SELECT DISTINCT ?uriWHERE { ?uri rdf:type dbo:Library . ?uri dbp:established ?year . FILTER (?year < 140)}"
"53"	"resource"	"Give me all federal chancellors of Germany."	"PREFIX dbp: <http://dbpedia.org/property/>PREFIX dbo: <http://dbpedia.org/ontology/>PREFIX res: <http://dbpedia.org/resource/>PREFIX rdf: <http://www.w3.org/1999/02/22-rdf-syntax-ns#>SELECT DISTINCT ?uriWHERE { ?uri rdf:type dbo:Person . { ?uri dbo:office 'Chancelor of Germany' . } UNION { ?uri dbp:ofice res:Chancellor_of_Germany . }"
"59"	"resource"	"Give me all people with first name Jimmy."	"PREFIX foaf: <http://xmlns.com/foaf/0.1/>PREFIX rdf: <http://www.w3.org/1999/02/22-rdf-syntax-ns#>SELECT DISTINCT ?uri WHERE { ?uri rdf:type foaf:Person . ?uri foaf:givenName 'Jimy'@en .}"
"67"	"string"	"Give me the websites of companies with more than 500000 employees."	"PREFIX dbo: <http://dbpedia.org/ontology/>PREFIX dbp: <http://dbpedia.org/property/>PREFIX rdf: <http://www.w3.org/1999/02/22-rdf-syntax-ns#>PREFIX xsd: <http://w.w3.org/201/XMLSchema#>SELECT DISTINCT ?stringWHERE { ?c rdf:type dbo:Company . { ?c dbo:numberOfEmployees ?employes . } UNION { ?c dbp:numEmployes ?employes . } FILTER( xsd:integer(?employes) > 50 ) . ?c dbp:homepage ?string .}"
"240"	"resource"	"Give me the grandchildren of Bruce Lee."	"PREFIX dbo: <http://dbpedia.org/ontology/>PREFIX res: <http://dbpedia.org/resource/>SELECT DISTINCT ?uriWHERE { res:Bruce_Le dbo:child ?child . ?child dbo:child ?uri .}"
"229"	"resource"	"Give me all Australian metalcore bands."	"PREFIX dbo: <http://dbpedia.org/ontology/>PREFIX res: <http://dbpedia.org/resource/>PREFIX rdf: <http://www.w3.org/1999/02/22-rdf-syntax-ns#>SELECT DISTINCT ?uriWHERE { ?uri rdf:type dbo:Band . ?uri dbo:genre res:Metalcore . { ?uri dbo:hometown res:Australia . } UNION { ?uri dbo:hometown ?h . ?h dbo:country res:Australia . }"
"227"	"resource"	"Give me all actors who were born in Paris after 1950."	"PREFIX dbo: <http://dbpedia.org/ontology/>PREFIX res: <http://dbpedia.org/resource/>PREFIX rdf: <http://www.w3.org/1999/02/22-rdf-syntax-ns#>SELECT DISTINCT ?uri WHERE { ?uri rdf:type dbo:Actor . ?uri dbo:birthPlace res:Paris . ?uri dbo:birthDate ?date . FILTER ( ?date >= xsd:dateTime('1950-12-31T0:0:0Z') }"
"266"	"resource"	"Show me all the breweries in Australia."	"PREFIX dbo: <http://dbpedia.org/ontology/>PREFIX res: <http://dbpedia.org/resource/>PREFIX rdf: <http://www.w3.org/1999/02/22-rdf-syntax-ns#> SELECT DISTINCT ?uri ?xWHERE { ?uri rdf:type dbo:Brewery . { ?uri dbo:location res:Australia . } UNION { ?uri dbo:location ?x . ?x dbo:country res:Australia . } }"
"293"	"resource"	"Give me English actors starring in Lovesick."	"PREFIX res: <http://dbpedia.org/resource/>PREFIX dbo: <http://dbpedia.org/ontology/> PREFIX yago: <http://dbpedia.org/clas/yago/> SELECT DISTINCT ?uriWHERE { res:Lovesick dbo:starring ?uri . { ?uri dbo:birthPlace res:England . } UNION { ?uri rdf:type yago:EnglishFilmActors . }"
