id,status,question,sparqlQueGG,sparql
64,right,Give me all soccer clubs in the Premier League.,SELECT DISTINCT ?uri WHERE { ?uri a <http://dbpedia.org/ontology/SoccerClub> ; <http://dbpedia.org/ontology/league> <http://dbpedia.org/resource/Premier_League> },"PREFIX dbo: <http://dbpedia.org/ontology/>
PREFIX dbp: <http://dbpedia.org/property/>
PREFIX dbr: <http://dbpedia.org/resource/>
SELECT ?club
WHERE {
  ?club rdf:type dbo:SoccerClub ;
        dbp:league dbr:Premier_League .
}"
65,SPARQL logic wrong,What is the highest place of the Urals?,SELECT DISTINCT ?uri WHERE { <http://dbpedia.org/resource/Ural_Mountains> <http://dbpedia.org/property/highest> ?uri },"PREFIX dbp: <http://dbpedia.org/property/>
PREFIX dbo: <http://dbpedia.org/ontology/>
PREFIX foaf: <http://xmlns.com/foaf/0.1/>

SELECT ?place
WHERE {
  ?place dbo:location ?location ;
         dbp:range ?range .
  ?location dbo:parent ?parent ;
            rdfs:label ?label .
  ?parent rdfs:label ""Urals""@en .
}
ORDER BY DESC(?range)
LIMIT 1"
66,different SPARQL,Who is the governor of Wyoming?,SELECT DISTINCT ?uri WHERE { <http://dbpedia.org/resource/Wyoming> <http://dbpedia.org/property/governor> ?uri },"PREFIX dbo: <http://dbpedia.org/ontology/>
PREFIX dbp: <http://dbpedia.org/property/>

SELECT ?governorLabel
WHERE {
  ?governor dbp:governor ?state.
  ?governor dbo:state ?state.
  ?state dbo:stateName ""Wyoming""@en.
  SERVICE <http://dbpedia.org/sparql> {
    ?governor rdfs:label ?governorLabel.
    FILTER (lang(?governorLabel) = 'en')
  }
}
LIMIT 1"
67,different SPARQL,Where did the architect of the Eiffel Tower study?,N,"PREFIX dbo: <http://dbpedia.org/ontology/>
PREFIX dbp: <http://dbpedia.org/property/>
PREFIX foaf: <http://xmlns.com/foaf/0.1/>

SELECT ?studyLocation
WHERE {
  dbo:Eiffel_Tower dbp:architect ?architect.
  ?architect dbp:education ?education.
  ?education foaf:name ?studyLocation.
}"
68,different SPARQL,Give me all world heritage sites designated within the past two years.,SELECT DISTINCT ?uri WHERE { ?uri <http://www.w3.org/1999/02/22-rdf-syntax-ns#type> <http://dbpedia.org/ontology/WorldHeritageSite> . { ?uri <http://dbpedia.org/property/year> '2013'^^xsd:integer . } UNION { ?uri <http://dbpedia.org/property/year> '2014'^^xsd:integer . } },"PREFIX dbo: <http://dbpedia.org/ontology/>
PREFIX dct: <http://purl.org/dc/terms/>
PREFIX dbc: <http://dbpedia.org/resource/Category:>
PREFIX rdf: <http://www.w3.org/1999/02/22-rdf-syntax-ns#>

SELECT DISTINCT ?site ?siteLabel ?date
WHERE {
  ?site rdf:type dbo:WorldHeritageSite .
  ?site dct:subject dbc:World_Heritage_Sites_by_year_of_establishment .
  ?site dct:subject dbc:New_World_Heritage_Sites .
  ?site rdfs:label ?siteLabel .
  ?site dct:subject ?category .
  ?category rdfs:label ""World_Heritage_Sites_by_year_of_establishment"" .
  ?site dct:issued ?date .
  FILTER (
    year(?date) >= year(now())-2
  )

  FILTER (langMatches(lang(?siteLabel), ""en""))
}
ORDER BY DESC(?date)
LIMIT 100"
69,different SPARQL,Give me all actors who were born in Paris after 1950.,SELECT DISTINCT ?uri WHERE { ?uri <http://www.w3.org/1999/02/22-rdf-syntax-ns#type> <http://dbpedia.org/ontology/Actor> . ?uri <http://dbpedia.org/ontology/birthPlace> <http://dbpedia.org/resource/Paris> . ?uri <http://dbpedia.org/ontology/birthDate> ?date . FILTER ( ?date >= xsd:dateTime('1950-12-31T00:00:00Z')) },"SELECT ?actor WHERE {
  ?actor rdf:type dbo:Actor .
  ?actor dbp:birthPlace dbr:Paris .
  ?actor dbp:birthDate ?birthDate .
  FILTER(YEAR(?birthDate) > 1950)
}"
70,different SPARQL,Which movies star both Liz Taylor and Richard Burton?,SELECT DISTINCT ?uri WHERE { ?uri <http://dbpedia.org/ontology/starring> <http://dbpedia.org/resource/Elizabeth_Taylor> ; <http://dbpedia.org/ontology/starring> <http://dbpedia.org/resource/Richard_Burton> },"PREFIX dbo: <http://dbpedia.org/ontology/>
PREFIX dbr: <http://dbpedia.org/resource/>

SELECT ?movie
WHERE {
  ?movie dbo:starring dbr:Liz_Taylor, dbr:Richard_Burton.
  ?movie rdf:type dbo:Film.
}
LIMIT 10"
71,SPARQL structure wrong,Give me all Australian nonprofit organizations.,SELECT DISTINCT ?uri WHERE { ?uri <http://dbpedia.org/ontology/type> <http://dbpedia.org/resource/Nonprofit_organization> { ?uri <http://dbpedia.org/ontology/locationCountry> <http://dbpedia.org/resource/Australia> } UNION { ?uri <http://dbpedia.org/ontology/location> ?x . ?x <http://dbpedia.org/ontology/country> <http://dbpedia.org/resource/Australia> } },"PREFIX dbo: <http://dbpedia.org/ontology/>
PREFIX dbr: <http://dbpedia.org/resource/>

SELECT ?organization
WHERE {
  ?organization rdf:type dbo:Organisation ;
                dbo:location dbr:Australia ;
                dbo:nonProfit status: A
}
LIMIT 100"
72,different SPARQL,Which pope succeeded John Paul II?,SELECT DISTINCT ?uri WHERE { <http://dbpedia.org/resource/Pope_John_Paul_II> <http://dbpedia.org/property/successor> ?uri },"PREFIX dbo: <http://dbpedia.org/ontology/>
PREFIX dbp: <http://dbpedia.org/property/>
PREFIX foaf: <http://xmlns.com/foaf/0.1/>
PREFIX rdfs: <http://www.w3.org/2000/01/rdf-schema#>

SELECT ?successor
WHERE {
  dbo:John_Paul_II dbo:successor ?successor.
  ?successor rdf:type dbo:Pope.
  ?successor foaf:name ?successorName.
}
LIMIT 1"
73,right,Give me all ESA astronauts.,SELECT DISTINCT ?uri WHERE { ?uri a <http://dbpedia.org/ontology/Astronaut> ; <http://dbpedia.org/property/type> <http://dbpedia.org/resource/European_Space_Agency> },"PREFIX dbo: <http://dbpedia.org/ontology/>
PREFIX dbr: <http://dbpedia.org/resource/>
PREFIX foaf: <http://xmlns.com/foaf/0.1/>

SELECT ?astronaut
WHERE {
  ?astronaut dbo:occupation dbr:Astronaut ;
              dbo:organization dbr:European_Space_Agency ;
              foaf:name ?name .
}"
74,different SPARQL,Who was president of Pakistan in 1978?,SELECT DISTINCT ?uri WHERE { ?uri <http://dbpedia.org/property/title> <http://dbpedia.org/resource/President_of_Pakistan> ; <http://dbpedia.org/property/years> 1978 },"PREFIX dbo: <http://dbpedia.org/ontology/>
PREFIX dbp: <http://dbpedia.org/property/>

SELECT ?president
WHERE {
  ?president dbo:office dbp:President .
  ?president dbo:officeHolderOf/dbp:from ""1978-01-01""^^xsd:date .
  ?president dbo:officeHolderOf/dbp:to ""1978-12-31""^^xsd:date .
  ?president dbo:officeLocation dbr:Pakistan .
}
"
75,SPARQL logic wrong,Who is the owner of Rolls-Royce?,SELECT DISTINCT ?uri WHERE { <http://dbpedia.org/resource/Rolls-Royce_Motors> <http://dbpedia.org/ontology/owner> ?uri },"PREFIX dbo: <http://dbpedia.org/ontology/>
PREFIX dbp: <http://dbpedia.org/property/>
SELECT ?owner
WHERE {
  ?rollsRoyce dbo:wikiPageID ?rollsRoyceID .
  ?rollsRoyce dbo:owner ?owner .
  FILTER (?rollsRoyceID = 13651)
}
LIMIT 10"
76,right,How many museums does Paris have?,SELECT DISTINCT ?uri WHERE { ?uri a <http://dbpedia.org/ontology/Museum> ; <http://dbpedia.org/ontology/location> <http://dbpedia.org/resource/Paris> },"PREFIX dbo: <http://dbpedia.org/ontology/>
PREFIX dbr: <http://dbpedia.org/resource/>

SELECT (COUNT(DISTINCT ?museum) as ?count)
WHERE {
  ?museum a dbo:Museum ;
          dbo:location dbr:Paris .
}
"
77,different SPARQL,Where was JFK assassinated?,SELECT DISTINCT ?uri WHERE { <http://dbpedia.org/resource/John_F._Kennedy> <http://dbpedia.org/ontology/deathPlace> ?uri },"PREFIX dbo: <http://dbpedia.org/ontology/>
SELECT DISTINCT ?place WHERE {
  ?assassination dbo:deathCause <http://dbpedia.org/resource/Assassination_of_John_F._Kennedy>.
  ?assassination dbo:place ?place.
}"
78,SPARQL structure wrong,Give me all federal chancellors of Germany.,"SELECT DISTINCT ?uri WHERE { ?uri a <http://dbpedia.org/ontology/Person> { ?uri <http://dbpedia.org/ontology/office> ""Chancellor of Germany"" } UNION { ?uri <http://dbpedia.org/property/office> <http://dbpedia.org/resource/Chancellor_of_Germany> } }","PREFIX dbo: <http://dbpedia.org/ontology/>
PREFIX foaf: <http://xmlns.com/foaf/0.1/>

SELECT ?chancellor
WHERE {
  ?chancellor a dbo:OfficeHolder ;
    dbo:office dbo:Chancellor ;
    dbo:leader dbr:Germany .

  FILTER regex(?chancellor, ""Federal_Counsellor_of_Germany"", ""i"")
}
"
79,different SPARQL,Show me everyone who was born on Halloween.,SELECT DISTINCT ?uri WHERE { ?uri a <http://dbpedia.org/ontology/Person> { ?uri <http://dbpedia.org/ontology/birthDate> ?date } UNION { ?uri <http://dbpedia.org/property/birthDate> ?date } <http://dbpedia.org/resource/Halloween> <http://dbpedia.org/property/date> ?date },"PREFIX dbo: <http://dbpedia.org/ontology/>
PREFIX foaf: <http://xmlns.com/foaf/0.1/>

SELECT ?person ?name ?birthdate
WHERE {
  ?person dbo:birthDate ?birthdate.
  ?person foaf:name ?name.
  FILTER regex(str(?birthdate), ""10-31$"").
}"
80,different SPARQL,Which beer originated in Ireland?,SELECT DISTINCT ?uri WHERE { ?uri <http://dbpedia.org/property/type> <http://dbpedia.org/resource/Beer> ; <http://dbpedia.org/ontology/origin> <http://dbpedia.org/resource/Beer_in_Ireland> },"PREFIX dbo: <http://dbpedia.org/ontology/>
PREFIX dbr: <http://dbpedia.org/resource/>
PREFIX dbp: <http://dbpedia.org/property/>
PREFIX rdf: <http://www.w3.org/1999/02/22-rdf-syntax-ns#>

SELECT ?beer
WHERE {
  ?beer rdf:type dbo:Beer ;
        dbp:origin dbr:Ireland .
}
"
81,invalid property,To which countries does the Himalayan mountain system extend?,SELECT DISTINCT ?uri WHERE { <http://dbpedia.org/resource/Himalayas> <http://dbpedia.org/ontology/country> ?uri },"PREFIX dbo: <http://dbpedia.org/ontology/>
PREFIX dbo: <http://dbpedia.org/resource/>

SELECT ?country
WHERE {
  ?country dbo:mountainSystem dbo:Himalayas .
  ?country rdf:type dbo:Country .
}"
82,right,Which actors were born in Germany?,SELECT DISTINCT ?uri WHERE { ?uri a <http://dbpedia.org/ontology/Actor> { ?uri <http://dbpedia.org/ontology/birthPlace> <http://dbpedia.org/resource/Germany> } UNION { ?uri <http://dbpedia.org/ontology/birthPlace> ?place . ?place <http://dbpedia.org/ontology/country> <http://dbpedia.org/resource/Germany> } },"PREFIX dbo: <http://dbpedia.org/ontology/>
PREFIX dbp: <http://dbpedia.org/property/>
PREFIX foaf: <http://xmlns.com/foaf/0.1/>

SELECT ?actor
WHERE {
  ?actor dbo:birthPlace ?birthPlace .
  ?birthPlace dbo:country <http://dbpedia.org/resource/Germany> .
  ?actor rdf:type dbo:Actor .
}
ORDER BY ?actor
LIMIT 100"
83,different SPARQL,How much carbs does peanut butter have?,SELECT DISTINCT ?carbs WHERE { <http://dbpedia.org/resource/Peanut_butter> <http://dbpedia.org/property/carbs> ?carbs },"PREFIX dbo: <http://dbpedia.org/ontology/>
SELECT DISTINCT ?carbs
WHERE {
  ?peanutButter dbo:carbohydrate ?carbs .
  FILTER contains(lcase(str(?peanutButter)), ""peanut_butter"")
}
LIMIT 1"
84,different SPARQL,Who produced the most films?,SELECT DISTINCT ?uri WHERE { ?film <http://www.w3.org/1999/02/22-rdf-syntax-ns#type> <http://dbpedia.org/ontology/Film> . ?film <http://dbpedia.org/ontology/producer> ?uri . } ORDER BY DESC(COUNT(?film)) OFFSET 0 LIMIT 1,"PREFIX dbo: <http://dbpedia.org/ontology/>
PREFIX foaf: <http://xmlns.com/foaf/0.1/>

SELECT ?producer (COUNT(?film) AS ?filmCount)
WHERE {
  ?film dbo:producer ?producer .
}
GROUP BY ?producer
ORDER BY DESC(?filmCount)
LIMIT 1"
85,right,How many employees does Google have?,SELECT DISTINCT ?num WHERE { <http://dbpedia.org/resource/Google> <http://dbpedia.org/ontology/numberOfEmployees> ?num },"SELECT ?employees WHERE {
  <http://dbpedia.org/resource/Google> <http://dbpedia.org/ontology/numberOfEmployees> ?employees.
}"
86,right,Give me all actors who were born in Berlin.,SELECT DISTINCT ?uri WHERE { ?uri a <http://dbpedia.org/ontology/Actor> ; <http://dbpedia.org/ontology/birthPlace> <http://dbpedia.org/resource/Berlin> },"PREFIX dbo: <http://dbpedia.org/ontology/>
PREFIX dbr: <http://dbpedia.org/resource/>

SELECT DISTINCT ?actor
WHERE {
  ?actor dbo:birthPlace dbr:Berlin .
  ?actor a dbo:Actor .
}
"
87,different SPARQL,Who created Goofy?,SELECT DISTINCT ?uri WHERE { <http://dbpedia.org/resource/Goofy> <http://dbpedia.org/ontology/creator> ?uri },"SELECT ?creator WHERE {
    ?goofy dbo:creator ?creator .
    ?goofy foaf:name ""Goofy""@en .
}"
88,SPARQL structure wrong,Which music albums contain the song Last Christmas?,"SELECT DISTINCT ?uri WHERE { ?single <http://dbpedia.org/ontology/album> ?uri ; <http://www.w3.org/2000/01/rdf-schema#label> ""Last Christmas""@en }","SELECT ?albumName
WHERE {
  ?album rdf:type dbo:Album ;
         dbo:musicalArtist ?artist ;
         dbo:recordedIn ?studio ;
         dbo:trackList/rdf:rest*/rdf:first/dbo:musicalWork ?song .
  ?song foaf:name ""Last Christmas"" .
  FILTER (LANG(?albumName) = ""en"")
}
ORDER BY ?albumName"
89,different SPARQL,When was Alberta admitted as province?,SELECT DISTINCT ?date WHERE { <http://dbpedia.org/resource/Alberta> <http://dbpedia.org/property/admittancedate> ?date },"SELECT ?date
WHERE {
  dbr:Alberta dbo:formationDate ?date .
}"
90,SPARQL logic wrong,How many missions does the Soyuz programme have?,SELECT (COUNT(DISTINCT ?uri) AS ?c) WHERE { ?uri <http://dbpedia.org/property/programme> <http://dbpedia.org/resource/Soyuz_programme> },"PREFIX dbpedia-owl: <http://dbpedia.org/ontology/>
SELECT (COUNT(?mission) AS ?missionCount)
WHERE {
  ?spacecraft dbpedia-owl:spaceAgency <http://dbpedia.org/resource/Roscosmos> .
  ?spacecraft dbpedia-owl:programme ?programme .
  ?programme rdfs:label ""Soyuz programme""@en .
  ?mission dbpedia-owl:vehicle ?spacecraft .
}"
91,different SPARQL,Give me all the TV shows with Neil Patrick Harris.,SELECT DISTINCT ?uri WHERE { ?uri a <http://dbpedia.org/ontology/TelevisionShow> ; <http://dbpedia.org/ontology/starring> <http://dbpedia.org/resource/Neil_Patrick_Harris> },"PREFIX dbo: <http://dbpedia.org/ontology/>
PREFIX dbp: <http://dbpedia.org/property/>
PREFIX dbr: <http://dbpedia.org/resource/>

SELECT ?show
WHERE {
  ?person dbo:starring dbr:Neil_Patrick_Harris .
  ?show dbo:starring ?person .
  ?show rdf:type dbo:TelevisionShow .
}
GROUP BY ?show
ORDER BY ?show"
92,different SPARQL,When were the Hells Angels founded?,SELECT DISTINCT ?date WHERE { <http://dbpedia.org/resource/Hells_Angels> <http://dbpedia.org/property/founded> ?date },"PREFIX dbo: <http://dbpedia.org/ontology/>
SELECT ?foundingDate
WHERE {
  <http://dbpedia.org/resource/Hells_Angels> dbo:foundingDate ?foundingDate.
}"
93,right,What is the net income of Apple?,SELECT DISTINCT ?ni WHERE { <http://dbpedia.org/resource/Apple> <http://dbpedia.org/ontology/netIncome> ?ni },"SELECT ?netIncome WHERE {
  dbpedia:Apple_Inc dbpedia-owl:netIncome ?netIncome
}"
94,invalid resource,Give me all Swedish holidays.,SELECT DISTINCT ?uri WHERE { ?uri a <http://dbpedia.org/ontology/Holiday> ; <http://dbpedia.org/ontology/country> <http://dbpedia.org/resource/Sweden> },"PREFIX dbo: <http://dbpedia.org/ontology/>
PREFIX dbp: <http://dbpedia.org/property/>

SELECT ?holidayLabel
WHERE {
  ?holiday a dbo:Holiday ;
           dbo:country dbp:Sweden ;
           rdfs:label ?holidayLabel .
  FILTER (LANG(?holidayLabel) = 'en')
}"
95,different SPARQL,In which city was the former Dutch queen Juliana buried?,SELECT DISTINCT ?uri WHERE { <http://dbpedia.org/resource/Juliana_of_the_Netherlands> <http://dbpedia.org/property/burialPlace> ?uri . ?uri a <http://dbpedia.org/ontology/Settlement> },"PREFIX dbpedia-owl: <http://dbpedia.org/ontology/>
PREFIX dbpprop: <http://dbpedia.org/property/>

SELECT ?city
WHERE {
  <http://dbpedia.org/resource/Juliana_of_the_Netherlands> dbpedia-owl:burialPlace ?place.
  ?place dbpprop:location ?city.
}"
96,SPARQL structure wrong,List all the musicals with music by Leonard Bernstein.,SELECT DISTINCT ?uri WHERE { ?uri a <http://dbpedia.org/ontology/Musical> ; <http://dbpedia.org/ontology/musicBy> <http://dbpedia.org/resource/Leonard_Bernstein> },"PREFIX dbo:<http://dbpedia.org/ontology/>
PREFIX dbp:<http://dbpedia.org/property/>
PREFIX dct:<http://purl.org/dc/terms/>

SELECT DISTINCT ?musical
WHERE {
  ?musical dbo:composer [a dbo:Person; dbo:birthName ""Leonard Bernstein""] .
  ?musical a dbo:Musical .
}
ORDER BY ?musical"
97,SPARQL logic wrong,Give me all companies in the advertising industry.,"SELECT (COUNT(DISTINCT ?uri) AS ?c) WHERE { ?uri a <http://dbpedia.org/ontology/Company> { ?uri <http://dbpedia.org/ontology/industry> <http://dbpedia.org/resource/Advertising> } UNION { ?uri <http://dbpedia.org/ontology/industry> ?industry FILTER regex(?industry, ""advertising"", ""i"") } }","PREFIX dbo: <http://dbpedia.org/ontology/>
PREFIX dbc: <http://dbpedia.org/resource/Category:>
PREFIX dct: <http://purl.org/dc/terms/>
SELECT ?company
WHERE {
  ?company dct:subject dbc:Advertising_companies .
}
LIMIT 100"
98,SPARQL logic wrong,What is the largest metropolitan area in Washington state?,SELECT DISTINCT ?uri WHERE { <http://dbpedia.org/resource/Washington_(state)> <http://dbpedia.org/property/largestmetro> ?uri },"SELECT ?area ?areaLabel
WHERE {
  ?area a dbo:City ;
        dbo:isPartOf dbr:Washington_(state) ;
        dbo:populationTotal ?population .
  FILTER NOT EXISTS { ?area dbo:isPartOf ?parentArea }
}
ORDER BY DESC(?population)
LIMIT 1
BINDINGS ?areaLabel { ""Metropolitan area of"" }
"
99,different SPARQL,Who killed John Lennon?,SELECT DISTINCT ?uri WHERE { ?uri a <http://dbpedia.org/ontology/Person> ; <http://dbpedia.org/property/conviction> <http://dbpedia.org/resource/Death_of_John_Lennon> },"SELECT ?killer
WHERE {
  dbpedia:John_Lennon dbpedia-owl:deathCause ?cause.
  ?cause rdfs:label ?killer.
  FILTER(CONTAINS(LCASE(?killer), ""kill""))
}"
100,different SPARQL,Which writers studied in Istanbul?,SELECT DISTINCT ?uri WHERE { ?uri a <http://dbpedia.org/ontology/Writer> { ?uri <http://dbpedia.org/ontology/almaMater> ?x } UNION { ?uri <http://dbpedia.org/ontology/education> ?x } { ?x <http://dbpedia.org/ontology/city> <http://dbpedia.org/resource/Istanbul> } UNION { ?x <http://dbpedia.org/property/city> <http://dbpedia.org/resource/Istanbul> } },"PREFIX dbo: <http://dbpedia.org/ontology/>
PREFIX dbr: <http://dbpedia.org/resource/>
PREFIX dbp: <http://dbpedia.org/property/>

SELECT ?writer
WHERE {
  ?writer dbo:almaMater dbr:Istanbul_University .
  FILTER EXISTS { ?writer dbo:occupation dbr:Writer }
}
LIMIT 100"
