"ID","status","sentence","sparqlQueGG","sparqlQald","TP","FP","FN","Precision","Recall","Fscore","Status"
"2","WORK","Wer entwickelt Skype? ","PREFIX dbo: <http://dbpedia.org/ontology/> PREFIX res: <http://dbpedia.org/resource/> PREFIX rdfs: <http://www.w3.org/2000/01/rdf-schema#> SELECT DISTINCT ?uri WHERE { res:Skype dbo:developer ?uri. }","SELECT ?Answer WHERE { ?Answer <http://dbpedia.org/ontology/product> <http://dbpedia.org/resource/Skype> .}","2.0","0.0","0.0","1.0","1.0","1.0","WORK"
"7","N","Woher hat getan Abraham Lincoln die? ","PREFIX dbo: <http://dbpedia.org/ontology/> PREFIX res: <http://dbpedia.org/resource/> PREFIX rdfs: <http://www.w3.org/2000/01/rdf-schema#> SELECT DISTINCT ?uri WHERE { res:Abraham_Lincoln dbo:deathPlace ?uri. }","N","0.0","0.0","2.0","0.0","0.0","0.0","N"
"11","N","Gib mir alle daenischen Filme","PREFIX dbo: <http://dbpedia.org/ontology/> PREFIX res: <http://dbpedia.org/resource/> PREFIX rdf: <http://www.w3.org/1999/02/22-rdf-syntax-ns#> SELECT DISTINCT ?uri WHERE { ?uri rdf:type dbo:Film ; dbo:country res:Denmark }","N","0.0","0.0","122.0","0.0","0.0","0.0","N"
"13","WORK","Gib mir die Enkel von Bruce Lee","PREFIX dbo: <http://dbpedia.org/ontology/> PREFIX res: <http://dbpedia.org/resource/> SELECT DISTINCT ?uri WHERE { res:Bruce_Lee dbo:child ?child . ?child <http://dbpedia.org/property/children> ?uri }","SELECT ?Answer WHERE { <http://dbpedia.org/resource/Isabel_Bruce> <http://dbpedia.org/ontology/parent> ?Answer .}","0.0","2.0","1.0","0.0","0.0","0.0","WORK"
"20","N","Gib mir alle Apollo-14-Astronauten","PREFIX dbo: <http://dbpedia.org/ontology/> PREFIX res: <http://dbpedia.org/resource/> SELECT DISTINCT ?uri WHERE { ?uri dbo:mission res:Apollo_14 }","N","0.0","0.0","3.0","0.0","0.0","0.0","N"
"21","N","Wer schrieb das Buch Das Saeulen von das Erde? ","PREFIX dbo: <http://dbpedia.org/ontology/> PREFIX res: <http://dbpedia.org/resource/> PREFIX rdfs: <http://www.w3.org/2000/01/rdf-schema#> SELECT DISTINCT ?uri WHERE { res:The_Pillars_of_the_Earth dbo:author ?uri }","N","0.0","0.0","1.0","0.0","0.0","0.0","N"
"29","N","Zeig mir alle Museen in London","SELECT DISTINCT ?uri WHERE { ?uri a <http://dbpedia.org/ontology/Museum> ; <http://dbpedia.org/ontology/location> <http://dbpedia.org/resource/London> }","N","0.0","0.0","81.0","0.0","0.0","0.0","N"
"34","N","Zeig mir alle Basketballspieler, die groeßer als 2 Meter sind","SELECT DISTINCT ?uri WHERE { ?uri a <http://dbpedia.org/ontology/BasketballPlayer> ; <http://dbpedia.org/ontology/height> ?n FILTER ( ?n > 2.0 ) }","N","0.0","0.0","4269.0","0.0","0.0","0.0","N"
"40","N","Zeig mir alle Schwimmer, die in Moskau geboren wurden","SELECT DISTINCT ?uri WHERE { ?uri a <http://dbpedia.org/ontology/Swimmer> ; <http://dbpedia.org/ontology/birthPlace> <http://dbpedia.org/resource/Moscow> }","N","0.0","0.0","55.0","0.0","0.0","0.0","N"
"51","N","Gib mir alle daenischen Filme","SELECT DISTINCT ?uri WHERE { ?uri a <http://dbpedia.org/ontology/Film> ; <http://dbpedia.org/ontology/country> <http://dbpedia.org/resource/Denmark> }","N","0.0","0.0","122.0","0.0","0.0","0.0","N"
"61","N","Gib mir alle Apollo-14-Astronauten","SELECT DISTINCT ?uri WHERE { ?uri <http://dbpedia.org/ontology/mission> <http://dbpedia.org/resource/Apollo_14> }","N","0.0","0.0","3.0","0.0","0.0","0.0","N"
"86","N","Gib mir alle in Berlin geborenenen Schauspieler","SELECT DISTINCT ?uri WHERE { ?uri a <http://dbpedia.org/ontology/Actor> ; <http://dbpedia.org/ontology/birthPlace> <http://dbpedia.org/resource/Berlin> }","N","0.0","0.0","1.0","0.0","0.0","0.0","N"
"91","N","Gib mir alle Fernsehserien mit Neil Patrick Harris","SELECT DISTINCT ?uri WHERE { ?uri a <http://dbpedia.org/ontology/TelevisionShow> ; <http://dbpedia.org/ontology/starring> <http://dbpedia.org/resource/Neil_Patrick_Harris> }","N","0.0","0.0","12.0","0.0","0.0","0.0","N"
"94","N","Gib mir alle schwedischen Feiertage","SELECT DISTINCT ?uri WHERE { ?uri a <http://dbpedia.org/ontology/Holiday> ; <http://dbpedia.org/ontology/country> <http://dbpedia.org/resource/Sweden> }","N","0.0","0.0","4.0","0.0","0.0","0.0","N"
"109","N","Gib mir alle Buecher, die Danielle Steel geschrieben hat","SELECT DISTINCT ?uri WHERE { ?uri a <http://dbpedia.org/ontology/Book> ; <http://dbpedia.org/ontology/author> <http://dbpedia.org/resource/Danielle_Steel> }","N","0.0","0.0","47.0","0.0","0.0","0.0","N"
"118","N","Gib mir alle Politiker, die Methodisten sind","SELECT DISTINCT ?uri WHERE { ?uri a <http://dbpedia.org/ontology/Politician> ; <http://dbpedia.org/ontology/religion> <http://dbpedia.org/resource/Methodism> }","N","0.0","0.0","86.0","0.0","0.0","0.0","N"
"159","N","Wofuer steht ICRO?","SELECT DISTINCT ?uri WHERE { ?uri <http://dbpedia.org/ontology/abbreviation> ""ICRO"" }","N","0.0","0.0","1.0","0.0","0.0","0.0","N"
"161","N","Gib mir alle Filme des Produzenten Hal Roach","SELECT DISTINCT ?uri WHERE { ?uri a <http://dbpedia.org/ontology/Film> ; <http://dbpedia.org/ontology/producer> <http://dbpedia.org/resource/Hal_Roach> }","N","0.0","0.0","528.0","0.0","0.0","0.0","N"
"171","N","Gib mir alle Filme mit Tom Cruise","SELECT DISTINCT ?uri WHERE { ?uri a <http://dbpedia.org/ontology/Film> ; <http://dbpedia.org/ontology/starring> <http://dbpedia.org/resource/Tom_Cruise> }","N","0.0","0.0","26.0","0.0","0.0","0.0","N"
"189","N","Was ist das groeßten Stadt im Amerika? ","PREFIX dbo: <http://dbpedia.org/ontology/> PREFIX dbr: <http://dbpedia.org/resource/> SELECT ?lcity WHERE { dbr:United_States dbo:largestCity ?lcity }","N","0.0","0.0","1.0","0.0","0.0","0.0","N"
"197","N","Woher ist das Geburtsort von Goethe? ","PREFIX dbo: <http://dbpedia.org/ontology/> PREFIX dbr: <http://dbpedia.org/resource/> SELECT ?Goethe WHERE { dbr:Johann_Wolfgang_von_Goethe dbo:birthPlace ?Goethe }","N","0.0","0.0","2.0","0.0","0.0","0.0","N"
"201","N","Was ist das hoechste Berg im Sachsen Deutschland? ","PREFIX dbo: <http://dbpedia.org/ontology/> PREFIX dbr: <http://dbpedia.org/resource/> SELECT ?m WHERE { ?m dbo:mountainRange dbr:Ore_Mountains ; dbo:elevation ?height } ORDER BY DESC(?height) LIMIT 1","N","0.0","0.0","1.0","0.0","0.0","0.0","N"
