"ID","status","sentence","sparqlQueGG","sparqlQald","TP","FP","FN","Precision","Recall","Fscore","Status"
"1","N","Liste alle Brettspiele von GMT ","PREFIX dbo: <http://dbpedia.org/ontology/> PREFIX res: <http://dbpedia.org/resource/> PREFIX rdfs: <http://www.w3.org/2000/01/rdf-schema#> SELECT ?uri WHERE { ?uri dbo:publisher res:GMT_Games }","N","0.0","0.0","0.0","0.0","0.0","0.0","N"
"2","N","Wer entwickelt Skype? ","PREFIX dbo: <http://dbpedia.org/ontology/> PREFIX res: <http://dbpedia.org/resource/> PREFIX rdfs: <http://www.w3.org/2000/01/rdf-schema#> SELECT DISTINCT ?uri WHERE { res:Skype dbo:developer ?uri. }","N","0.0","0.0","0.0","0.0","0.0","0.0","N"
"3","N","Welche Menschen wurden geboren im Heraklion?","PREFIX yago: <http://dbpedia.org/class/yago/> PREFIX rdfs: <http://www.w3.org/2000/01/rdf-schema#> PREFIX rdf: <http://www.w3.org/1999/02/22-rdf-syntax-ns#> PREFIX onto: <http://dbpedia.org/ontology/> SELECT DISTINCT ?uri WHERE { ?uri rdf:type onto:Person ; onto:birthPlace <http://dbpedia.org/resource/Heraklion>. }","N","0.0","0.0","0.0","0.0","0.0","0.0","N"
"4","N","Im welche US Zustand ist Bereich 51 gelegen? ","PREFIX dbo: <http://dbpedia.org/ontology/> PREFIX res: <http://dbpedia.org/resource/> PREFIX rdfs: <http://www.w3.org/2000/01/rdf-schema#> SELECT DISTINCT ?uri WHERE { res:Area_51 dbo:location ?uri . ?uri dbo:country res:United_States. }","N","0.0","0.0","0.0","0.0","0.0","0.0","N"
"5","WORK","Wer ist der Buergermeister von New York City?","PREFIX dbo: <http://dbpedia.org/ontology/> PREFIX res: <http://dbpedia.org/resource/> SELECT DISTINCT ?uri WHERE { res:New_York_City dbo:leaderName ?uri }","N","0.0","0.0","0.0","0.0","0.0","0.0","WORK"
"6","N","In welchen Laendern gibt es Orte mit mehr als zwei Hoehlen?","PREFIX dbo: <http://dbpedia.org/ontology/> PREFIX rdf: <http://www.w3.org/1999/02/22-rdf-syntax-ns#> SELECT DISTINCT ?uri WHERE { ?cave rdf:type dbo:Cave ; dbo:location ?uri . ?uri rdf:type dbo:Country } GROUP BY ?uri HAVING ( COUNT(?cave) > 2 )","N","0.0","0.0","0.0","0.0","0.0","0.0","N"
"7","N","Woher hat getan Abraham Lincoln die? ","PREFIX dbo: <http://dbpedia.org/ontology/> PREFIX res: <http://dbpedia.org/resource/> PREFIX rdfs: <http://www.w3.org/2000/01/rdf-schema#> SELECT DISTINCT ?uri WHERE { res:Abraham_Lincoln dbo:deathPlace ?uri. }","N","0.0","0.0","0.0","0.0","0.0","0.0","N"
"8","N","Welche Flughaefen fliegt Air China an?","PREFIX dbo: <http://dbpedia.org/ontology/> PREFIX res: <http://dbpedia.org/resource/> SELECT DISTINCT ?uri WHERE { res:Air_China dbo:targetAirport ?uri }","N","0.0","0.0","0.0","0.0","0.0","0.0","N"
"9","N","Gib mir alle Schauspieler von Filmen, in denen William Shatner sowohl Regie gefuehrt als auch selber mitgespielt hat","PREFIX dbo: <http://dbpedia.org/ontology/> PREFIX res: <http://dbpedia.org/resource/> PREFIX dbp: <http://dbpedia.org/property/> SELECT DISTINCT ?uri WHERE { ?x dbo:director res:William_Shatner ; dbo:starring res:William_Shatner { ?x dbo:starring ?uri } UNION { ?x dbp:starring ?uri } }","N","0.0","0.0","0.0","0.0","0.0","0.0","N"
"11","N","Gib mir alle daenischen Filme","PREFIX dbo: <http://dbpedia.org/ontology/> PREFIX res: <http://dbpedia.org/resource/> PREFIX rdf: <http://www.w3.org/1999/02/22-rdf-syntax-ns#> SELECT DISTINCT ?uri WHERE { ?uri rdf:type dbo:Film ; dbo:country res:Denmark }","N","0.0","0.0","0.0","0.0","0.0","0.0","N"
"12","N","Bei welchen Filmen, in denen Brad Pitt mitspielt, hat Guy Ritchie Regie gefuehrt?","PREFIX dbo: <http://dbpedia.org/ontology/> PREFIX res: <http://dbpedia.org/resource/> PREFIX rdf: <http://www.w3.org/1999/02/22-rdf-syntax-ns#> SELECT DISTINCT ?uri WHERE { ?uri rdf:type dbo:Film ; dbo:starring res:Brad_Pitt ; dbo:director res:Guy_Ritchie }","N","0.0","0.0","0.0","0.0","0.0","0.0","N"
"13","N","Gib mir die Enkel von Bruce Lee","PREFIX dbo: <http://dbpedia.org/ontology/> PREFIX res: <http://dbpedia.org/resource/> SELECT DISTINCT ?uri WHERE { res:Bruce_Lee dbo:child ?child . ?child <http://dbpedia.org/property/children> ?uri }","N","0.0","0.0","0.0","0.0","0.0","0.0","N"
"15","N","Wem gehoeren die Universal Studios?","PREFIX dbo: <http://dbpedia.org/ontology/> PREFIX res: <http://dbpedia.org/resource/> SELECT DISTINCT ?uri WHERE { res:Universal_Studios dbo:owner ?uri }","N","0.0","0.0","0.0","0.0","0.0","0.0","N"
"16","N","Welcher Staat in den USA hat die hoechste Bevoelkerungsdichte?","PREFIX yago: <http://dbpedia.org/class/yago/> PREFIX dbp: <http://dbpedia.org/property/> PREFIX rdf: <http://www.w3.org/1999/02/22-rdf-syntax-ns#> SELECT DISTINCT ?uri WHERE { ?uri rdf:type yago:WikicatStatesOfTheUnitedStates ; dbp:densityrank ?rank } ORDER BY ASC(?rank) LIMIT 1","N","0.0","0.0","0.0","0.0","0.0","0.0","N"
"18","N","Welche Unternehmen wurden 1950 gegruendet?","PREFIX dbo: <http://dbpedia.org/ontology/> PREFIX dbp: <http://dbpedia.org/property/> PREFIX rdf: <http://www.w3.org/1999/02/22-rdf-syntax-ns#> SELECT DISTINCT ?uri WHERE { ?uri rdf:type dbo:Organisation { ?uri dbo:formationYear ?date } UNION { ?uri dbo:foundingYear ?date } UNION { ?uri dbp:foundation ?date } UNION { ?uri dbp:formation ?date } FILTER regex(?date, ""^1950"") }","N","0.0","0.0","0.0","0.0","0.0","0.0","N"
"20","N","Gib mir alle Apollo-14-Astronauten","PREFIX dbo: <http://dbpedia.org/ontology/> PREFIX res: <http://dbpedia.org/resource/> SELECT DISTINCT ?uri WHERE { ?uri dbo:mission res:Apollo_14 }","N","0.0","0.0","0.0","0.0","0.0","0.0","N"
"21","N","Wer schrieb das Buch Das Saeulen von das Erde? ","PREFIX dbo: <http://dbpedia.org/ontology/> PREFIX res: <http://dbpedia.org/resource/> PREFIX rdfs: <http://www.w3.org/2000/01/rdf-schema#> SELECT DISTINCT ?uri WHERE { res:The_Pillars_of_the_Earth dbo:author ?uri }","N","0.0","0.0","0.0","0.0","0.0","0.0","N"
"22","N","Welche Zustand von das Vereinigt Zustaende von Amerika hat das hoechste Dichte? ","PREFIX yago: <http://dbpedia.org/class/yago/> PREFIX rdfs: <http://www.w3.org/2000/01/rdf-schema#> PREFIX dbp: <http://dbpedia.org/property/> PREFIX rdf: <http://www.w3.org/1999/02/22-rdf-syntax-ns#> SELECT ?uri WHERE { ?uri dbp:densityrank ?density } ORDER BY ASC(?density) LIMIT 1","N","0.0","0.0","0.0","0.0","0.0","0.0","N"
"23","N","Welche Raumfluege sind von Baikonur gestartet?","PREFIX dbo: <http://dbpedia.org/ontology/> PREFIX res: <http://dbpedia.org/resource/> SELECT DISTINCT ?uri WHERE { ?uri <http://dbpedia.org/property/launchPad> res:Baikonur_Cosmodrome }","N","0.0","0.0","0.0","0.0","0.0","0.0","N"
"24","N","Gib mit eine Liste aller Trompeter, die Bandleader waren","PREFIX dbo: <http://dbpedia.org/ontology/> PREFIX res: <http://dbpedia.org/resource/> SELECT DISTINCT ?uri WHERE { ?uri dbo:occupation res:Bandleader ; dbo:instrument res:Trumpet }","N","0.0","0.0","0.0","0.0","0.0","0.0","N"
"29","N","Zeig mir alle Museen in London","SELECT DISTINCT ?uri WHERE { ?uri a <http://dbpedia.org/ontology/Museum> ; <http://dbpedia.org/ontology/location> <http://dbpedia.org/resource/London> }","N","0.0","0.0","0.0","0.0","0.0","0.0","N"
"30","N","Welche Hoehlen haben mehr als 3 Eingaenge?","SELECT DISTINCT ?uri WHERE { ?uri a <http://dbpedia.org/ontology/Cave> ; <http://dbpedia.org/property/entranceCount> ?entrance FILTER ( ?entrance > 3 ) }","N","0.0","0.0","0.0","0.0","0.0","0.0","N"
"31","N","Wer ist der groeßte Spieler der Atlanta Falcons?","SELECT DISTINCT ?uri WHERE { ?uri <http://dbpedia.org/ontology/team> <http://dbpedia.org/resource/Atlanta_Falcons> ; <http://dbpedia.org/ontology/height> ?h } ORDER BY DESC(?h) OFFSET 0 LIMIT 1","N","0.0","0.0","0.0","0.0","0.0","0.0","N"
"33","N","Gib mir alle Schriftsteller, die den Literaturnobelpreis gewonnen haben","SELECT DISTINCT ?uri WHERE { ?uri a <http://dbpedia.org/ontology/Writer> ; <http://dbpedia.org/ontology/award> <http://dbpedia.org/resource/Nobel_Prize_in_Literature> }","N","0.0","0.0","0.0","0.0","0.0","0.0","N"
"34","N","Zeig mir alle Basketballspieler, die groeßer als 2 Meter sind","SELECT DISTINCT ?uri WHERE { ?uri a <http://dbpedia.org/ontology/BasketballPlayer> ; <http://dbpedia.org/ontology/height> ?n FILTER ( ?n > 2.0 ) }","N","0.0","0.0","0.0","0.0","0.0","0.0","N"
"40","N","Zeig mir alle Schwimmer, die in Moskau geboren wurden","SELECT DISTINCT ?uri WHERE { ?uri a <http://dbpedia.org/ontology/Swimmer> ; <http://dbpedia.org/ontology/birthPlace> <http://dbpedia.org/resource/Moscow> }","N","0.0","0.0","0.0","0.0","0.0","0.0","N"
"43","N","Welche Praesidenten wurden 1945 geboren?","SELECT DISTINCT ?uri WHERE { ?uri a <http://dbpedia.org/ontology/President> ; <http://dbpedia.org/ontology/birthDate> ?date FILTER regex(?date, ""^1945"") }","N","0.0","0.0","0.0","0.0","0.0","0.0","N"
"44","N","Was fuer Musik hat Lou Reed gemacht?","SELECT DISTINCT ?uri WHERE { <http://dbpedia.org/resource/Lou_Reed> <http://dbpedia.org/ontology/genre> ?uri }","N","0.0","0.0","0.0","0.0","0.0","0.0","N"
"46","N","Zeig mir eine Liste der Fußballvereine, die in der Bundesliga spielen","SELECT DISTINCT ?uri WHERE { ?uri a <http://dbpedia.org/ontology/SoccerClub> ; <http://dbpedia.org/ontology/league> <http://dbpedia.org/resource/Bundesliga> }","N","0.0","0.0","0.0","0.0","0.0","0.0","N"
"48","N","Welche Bruecken ueberqueren die Seine?","SELECT DISTINCT ?uri WHERE { ?uri a <http://dbpedia.org/ontology/Bridge> ; <http://dbpedia.org/ontology/crosses> <http://dbpedia.org/resource/Seine> }","N","0.0","0.0","0.0","0.0","0.0","0.0","N"
"49","N","Was ist die offizielle Farbe der Universitaet Oxford?","SELECT DISTINCT ?string WHERE { <http://dbpedia.org/resource/University_of_Oxford> <http://dbpedia.org/ontology/officialSchoolColour> ?string }","N","0.0","0.0","0.0","0.0","0.0","0.0","N"
"51","N","Gib mir alle daenischen Filme","SELECT DISTINCT ?uri WHERE { ?uri a <http://dbpedia.org/ontology/Film> ; <http://dbpedia.org/ontology/country> <http://dbpedia.org/resource/Denmark> }","N","0.0","0.0","0.0","0.0","0.0","0.0","N"
"52","N","Was ist die haeufigste Todesursache?","SELECT DISTINCT ?x WHERE { ?uri <http://dbpedia.org/ontology/deathCause> ?x . } ORDER BY DESC(COUNT(DISTINCT ?uri)) OFFSET 0 LIMIT 1","N","0.0","0.0","0.0","0.0","0.0","0.0","N"
"53","N","Wer sind die vier juengsten MVP Baskettballspieler?","SELECT DISTINCT ?uri WHERE { ?uri a <http://dbpedia.org/ontology/BasketballPlayer> ; <http://dbpedia.org/ontology/birthDate> ?date ; <http://dbpedia.org/property/highlights> ?h FILTER regex(?h, ""MVP"") } ORDER BY DESC(?date) OFFSET 0 LIMIT 4","N","0.0","0.0","0.0","0.0","0.0","0.0","N"
"55","N","Gib mir die Haupstaedte aller Laender, ueber die sich der Himalaya erstreckt","SELECT DISTINCT ?uri WHERE { <http://dbpedia.org/resource/Himalayas> <http://dbpedia.org/ontology/country> ?country . ?country <http://dbpedia.org/ontology/capital> ?uri }","N","0.0","0.0","0.0","0.0","0.0","0.0","N"
"56","N","Bei wievielen Filmen hat Park Chan-wook Regie gefuehrt?","SELECT COUNT(DISTINCT ?uri AS ?uri) WHERE { ?uri <http://dbpedia.org/ontology/director> <http://dbpedia.org/resource/Park_Chan-wook> . }","N","0.0","0.0","0.0","0.0","0.0","0.0","N"
"57","N","Welche Fluesse fließen in deutsche Seen?","SELECT DISTINCT ?uri WHERE { ?uri a <http://dbpedia.org/ontology/River> . ?x <http://dbpedia.org/ontology/inflow> ?uri ; a <http://dbpedia.org/ontology/Lake> ; <http://dbpedia.org/ontology/country> <http://dbpedia.org/resource/Germany> }","N","0.0","0.0","0.0","0.0","0.0","0.0","N"
"59","N","Gib mir alle Inseln, die zu Japan gehoeren","SELECT DISTINCT ?uri WHERE { ?uri a <http://dbpedia.org/ontology/Island> ; <http://dbpedia.org/ontology/country> <http://dbpedia.org/resource/Japan> }","N","0.0","0.0","0.0","0.0","0.0","0.0","N"
"61","N","Gib mir alle Apollo-14-Astronauten","SELECT DISTINCT ?uri WHERE { ?uri <http://dbpedia.org/ontology/mission> <http://dbpedia.org/resource/Apollo_14> }","N","0.0","0.0","0.0","0.0","0.0","0.0","N"
"63","N","In welchem Filmen, bei denen Garry Marshall Regie gefuehrt hat, hat Julia Roberts mitgespielt?","SELECT DISTINCT ?uri WHERE { ?uri a <http://dbpedia.org/ontology/Film> ; <http://dbpedia.org/ontology/starring> <http://dbpedia.org/resource/Julia_Roberts> ; <http://dbpedia.org/ontology/director> <http://dbpedia.org/resource/Garry_Marshall> }","N","0.0","0.0","0.0","0.0","0.0","0.0","N"
"64","N","Gib mir alle Vereine in der Premier League","SELECT DISTINCT ?uri WHERE { ?uri a <http://dbpedia.org/ontology/SoccerClub> ; <http://dbpedia.org/ontology/league> <http://dbpedia.org/resource/Premier_League> }","N","0.0","0.0","0.0","0.0","0.0","0.0","N"
"65","N","Was ist die hoehchste Stelle des Ural?","SELECT DISTINCT ?uri WHERE { <http://dbpedia.org/resource/Ural_Mountains> <http://dbpedia.org/property/highest> ?uri }","N","0.0","0.0","0.0","0.0","0.0","0.0","N"
"73","N","Gib mir alle ESA-Astronauten","SELECT DISTINCT ?uri WHERE { ?uri a <http://dbpedia.org/ontology/Astronaut> ; <http://dbpedia.org/property/type> <http://dbpedia.org/resource/European_Space_Agency> }","N","0.0","0.0","0.0","0.0","0.0","0.0","N"
"74","N","Wer war 1978 Praesident von Pakistan?","SELECT DISTINCT ?uri WHERE { ?uri <http://dbpedia.org/property/title> <http://dbpedia.org/resource/President_of_Pakistan> ; <http://dbpedia.org/property/years> 1978 }","N","0.0","0.0","0.0","0.0","0.0","0.0","N"
"75","N","Wem gehoert Rolls-Royce?","SELECT DISTINCT ?uri WHERE { <http://dbpedia.org/resource/Rolls-Royce_Motors> <http://dbpedia.org/ontology/owner> ?uri }","N","0.0","0.0","0.0","0.0","0.0","0.0","N"
"81","N","Über welche Laender erstreckt sich der Himalaya?","SELECT DISTINCT ?uri WHERE { <http://dbpedia.org/resource/Himalayas> <http://dbpedia.org/ontology/country> ?uri }","N","0.0","0.0","0.0","0.0","0.0","0.0","N"
"86","N","Gib mir alle in Berlin geborenenen Schauspieler","SELECT DISTINCT ?uri WHERE { ?uri a <http://dbpedia.org/ontology/Actor> ; <http://dbpedia.org/ontology/birthPlace> <http://dbpedia.org/resource/Berlin> }","N","0.0","0.0","0.0","0.0","0.0","0.0","N"
"89","N","Wann wurde die Provinz Alberta gegruendet?","SELECT DISTINCT ?date WHERE { <http://dbpedia.org/resource/Alberta> <http://dbpedia.org/property/admittancedate> ?date }","N","0.0","0.0","0.0","0.0","0.0","0.0","N"
"91","N","Gib mir alle Fernsehserien mit Neil Patrick Harris","SELECT DISTINCT ?uri WHERE { ?uri a <http://dbpedia.org/ontology/TelevisionShow> ; <http://dbpedia.org/ontology/starring> <http://dbpedia.org/resource/Neil_Patrick_Harris> }","N","0.0","0.0","0.0","0.0","0.0","0.0","N"
"92","N","Wann wurden die Hells Angels gegruendet?","SELECT DISTINCT ?date WHERE { <http://dbpedia.org/resource/Hells_Angels> <http://dbpedia.org/property/founded> ?date }","N","0.0","0.0","0.0","0.0","0.0","0.0","N"
"94","N","Gib mir alle schwedischen Feiertage","SELECT DISTINCT ?uri WHERE { ?uri a <http://dbpedia.org/ontology/Holiday> ; <http://dbpedia.org/ontology/country> <http://dbpedia.org/resource/Sweden> }","N","0.0","0.0","0.0","0.0","0.0","0.0","N"
"95","N","In welcher Stadt wurde die ehemalige niederlaendische Koenigin Juliana beerdigt?","SELECT DISTINCT ?uri WHERE { <http://dbpedia.org/resource/Juliana_of_the_Netherlands> <http://dbpedia.org/property/burialPlace> ?uri . ?uri a <http://dbpedia.org/ontology/Settlement> }","N","0.0","0.0","0.0","0.0","0.0","0.0","N"
"96","N","Liste alle Musicals mit Musik von Leonard Bernstein auf","SELECT DISTINCT ?uri WHERE { ?uri a <http://dbpedia.org/ontology/Musical> ; <http://dbpedia.org/ontology/musicBy> <http://dbpedia.org/resource/Leonard_Bernstein> }","N","0.0","0.0","0.0","0.0","0.0","0.0","N"
"98","N","Was ist das groeßte Ballungsgebiet im Staat Washington?","SELECT DISTINCT ?uri WHERE { <http://dbpedia.org/resource/Washington_(state)> <http://dbpedia.org/property/largestmetro> ?uri }","N","0.0","0.0","0.0","0.0","0.0","0.0","N"
"99","N","Wer hat John Lennon getoetet?","SELECT DISTINCT ?uri WHERE { ?uri a <http://dbpedia.org/ontology/Person> ; <http://dbpedia.org/property/conviction> <http://dbpedia.org/resource/Death_of_John_Lennon> }","N","0.0","0.0","0.0","0.0","0.0","0.0","N"
"102","N","Welche Laender haben den Euro uebernommen?","SELECT DISTINCT ?uri WHERE { ?uri a <http://dbpedia.org/ontology/Country> { ?uri <http://dbpedia.org/ontology/currency> <http://dbpedia.org/resource/Euro> } UNION { ?uri <http://dbpedia.org/property/currencyCode> ""EUR""@en } }","N","0.0","0.0","0.0","0.0","0.0","0.0","N"
"109","N","Gib mir alle Buecher, die Danielle Steel geschrieben hat","SELECT DISTINCT ?uri WHERE { ?uri a <http://dbpedia.org/ontology/Book> ; <http://dbpedia.org/ontology/author> <http://dbpedia.org/resource/Danielle_Steel> }","N","0.0","0.0","0.0","0.0","0.0","0.0","N"
"111","N","Wieviele Maenner und Frauen arbeiten in der New Yorker Berufsfeuerwehr?","SELECT DISTINCT ?num WHERE { <http://dbpedia.org/resource/New_York_City_Fire_Department> <http://dbpedia.org/property/employees> ?num }","N","0.0","0.0","0.0","0.0","0.0","0.0","N"
"113","N","Gib mir alle Bibliotheken, die vor 1400 gegruendet worden","SELECT DISTINCT ?uri WHERE { ?uri a <http://dbpedia.org/ontology/Library> ; <http://dbpedia.org/property/established> ?year FILTER ( ?year < 1400 ) }","N","0.0","0.0","0.0","0.0","0.0","0.0","N"
"118","N","Gib mir alle Politiker, die Methodisten sind","SELECT DISTINCT ?uri WHERE { ?uri a <http://dbpedia.org/ontology/Politician> ; <http://dbpedia.org/ontology/religion> <http://dbpedia.org/resource/Methodism> }","N","0.0","0.0","0.0","0.0","0.0","0.0","N"
"119","N","Welche anderen Buecher wurden vom Autor von Der Fehler unserer Sterne geschrieben? ","PREFIX dbo: <http://dbpedia.org/ontology/> SELECT ?books WHERE { ?books dbo:author <http://dbpedia.org/resource/John_Green_(author)> }","N","0.0","0.0","0.0","0.0","0.0","0.0","N"
"120","N","Was ist der hoechste Berg?","SELECT DISTINCT ?uri WHERE { ?uri a <http://dbpedia.org/ontology/Mountain> ; <http://dbpedia.org/ontology/elevation> ?elevation } ORDER BY DESC(?elevation) OFFSET 0 LIMIT 1","N","0.0","0.0","0.0","0.0","0.0","0.0","N"
"121","N","Welcher Dichter hat die meisten Buecher geschrieben?","SELECT DISTINCT ?uri WHERE { ?uri <http://dbpedia.org/ontology/occupation> <http://dbpedia.org/resource/Poet> . ?x <http://dbpedia.org/ontology/author> ?uri . ?x <http://www.w3.org/1999/02/22-rdf-syntax-ns#type> <http://dbpedia.org/ontology/Book> . } ORDER BY DESC(COUNT(?x)) OFFSET 0 LIMIT 1","N","0.0","0.0","0.0","0.0","0.0","0.0","N"
"123","N","Welcher Musiker hat die meisten Buecher geschrieben?","SELECT DISTINCT ?uri WHERE { ?uri <http://dbpedia.org/ontology/occupation> <http://dbpedia.org/resource/Musician> . ?x <http://dbpedia.org/ontology/author> ?uri . ?x <http://www.w3.org/1999/02/22-rdf-syntax-ns#type> <http://dbpedia.org/ontology/Book> . } ORDER BY DESC(COUNT(?x)) OFFSET 0 LIMIT 1","N","0.0","0.0","0.0","0.0","0.0","0.0","N"
"124","N","Bei welchen Filmen mit Clint Eastwood hat er selber Regie gefuehrt?","SELECT DISTINCT ?uri WHERE { ?uri <http://dbpedia.org/ontology/director> <http://dbpedia.org/resource/Clint_Eastwood> ; <http://dbpedia.org/ontology/starring> <http://dbpedia.org/resource/Clint_Eastwood> }","N","0.0","0.0","0.0","0.0","0.0","0.0","N"
"125","N","Welche Softwareprodukte wurden von Unternehmen entwickelt, die in Kalifornien gegruendet wurden?","SELECT DISTINCT ?uri WHERE { ?uri a <http://dbpedia.org/ontology/Software> . ?company a <http://dbpedia.org/ontology/Company> . ?uri <http://dbpedia.org/ontology/developer> ?company . ?company <http://dbpedia.org/ontology/foundationPlace> <http://dbpedia.org/resource/California> }","N","0.0","0.0","0.0","0.0","0.0","0.0","N"
"134","N","Welche Laender haben mehr als zwei Amtssprachen?","SELECT DISTINCT ?uri WHERE { ?uri a <http://dbpedia.org/ontology/Country> ; <http://dbpedia.org/ontology/officialLanguage> ?language } GROUP BY ?uri HAVING ( COUNT(?language) > 2 )","N","0.0","0.0","0.0","0.0","0.0","0.0","N"
"135","N","In welchen Laendern gibt es mehr als zehn Hoehlen?","SELECT DISTINCT ?uri WHERE { ?uri a <http://dbpedia.org/ontology/Country> . ?cave a <http://dbpedia.org/ontology/Cave> { ?cave <http://dbpedia.org/ontology/location> ?uri } UNION { ?cave <http://dbpedia.org/ontology/location> ?loc . ?loc <http://dbpedia.org/ontology/country> ?uri } } GROUP BY ?uri HAVING ( COUNT(?cave) > 10 )","N","0.0","0.0","0.0","0.0","0.0","0.0","N"
"141","N","Gib mir die Geburtstage von allen Darstellern der Fernsehserie Charmed","SELECT DISTINCT ?date WHERE { <http://dbpedia.org/resource/Charmed> <http://dbpedia.org/ontology/starring> ?actor . ?actor <http://dbpedia.org/ontology/birthDate> ?date }","N","0.0","0.0","0.0","0.0","0.0","0.0","N"
"143","N","Gib mir eine Liste aller Seen in Daenemark","SELECT DISTINCT ?uri WHERE { { ?uri a <http://dbpedia.org/ontology/Lake> ; <http://dbpedia.org/ontology/country> <http://dbpedia.org/resource/Denmark> } UNION { ?uri a <http://dbpedia.org/class/yago/LakesOfDenmark> } }","N","0.0","0.0","0.0","0.0","0.0","0.0","N"
"147","N","In welchen Laendern kann ich mit dem CFA-Franc BCEAO bezahlen?","SELECT DISTINCT ?uri WHERE { ?uri <http://dbpedia.org/ontology/currency> <http://dbpedia.org/resource/West_African_CFA_franc> }","N","0.0","0.0","0.0","0.0","0.0","0.0","N"
"149","N","Was ist der laengste Fluss?","SELECT DISTINCT ?uri WHERE { ?uri a <http://dbpedia.org/ontology/River> { ?uri <http://dbpedia.org/ontology/length> ?l } UNION { ?uri <http://dbpedia.org/property/length> ?l } } ORDER BY DESC(?l) OFFSET 0 LIMIT 1","N","0.0","0.0","0.0","0.0","0.0","0.0","N"
"150","N","Welche Unternehmen wurden 1930 gegruendet?","SELECT DISTINCT ?uri WHERE { ?uri a <http://dbpedia.org/ontology/Organisation> { ?uri <http://dbpedia.org/ontology/formationYear> ?date } UNION { ?uri <http://dbpedia.org/ontology/foundingYear> ?date } FILTER regex(?date, ""^1930"") }","N","0.0","0.0","0.0","0.0","0.0","0.0","N"
"159","N","Wofuer steht ICRO?","SELECT DISTINCT ?uri WHERE { ?uri <http://dbpedia.org/ontology/abbreviation> ""ICRO"" }","N","0.0","0.0","0.0","0.0","0.0","0.0","N"
"161","N","Gib mir alle Filme des Produzenten Hal Roach","SELECT DISTINCT ?uri WHERE { ?uri a <http://dbpedia.org/ontology/Film> ; <http://dbpedia.org/ontology/producer> <http://dbpedia.org/resource/Hal_Roach> }","N","0.0","0.0","0.0","0.0","0.0","0.0","N"
"163","N","Welche griechischen Parteien sind pro-europaeisch?","SELECT DISTINCT ?uri WHERE { ?uri a <http://dbpedia.org/ontology/PoliticalParty> ; <http://dbpedia.org/ontology/country> <http://dbpedia.org/resource/Greece> ; <http://dbpedia.org/ontology/ideology> <http://dbpedia.org/resource/Pro-Europeanism> }","N","0.0","0.0","0.0","0.0","0.0","0.0","N"
"164","N","Gib mir eine Liste aller Bandleader, die Trompete spielen","SELECT DISTINCT ?uri WHERE { ?uri <http://dbpedia.org/ontology/occupation> <http://dbpedia.org/resource/Bandleader> ; <http://dbpedia.org/ontology/instrument> <http://dbpedia.org/resource/Trumpet> }","N","0.0","0.0","0.0","0.0","0.0","0.0","N"
"165","N","Was ist der zweithoechste Berg der Erde?","SELECT DISTINCT ?uri WHERE { ?uri a <http://dbpedia.org/ontology/Mountain> ; <http://dbpedia.org/ontology/elevation> ?elevation } ORDER BY DESC(?elevation) OFFSET 1 LIMIT 1","N","0.0","0.0","0.0","0.0","0.0","0.0","N"
"166","N","Ist Ägyptens groeßte Stadt auch seine Hauptstadt?","ASK WHERE { <http://dbpedia.org/resource/Egypt> <http://dbpedia.org/ontology/largestCity> ?large ; <http://dbpedia.org/ontology/capital> ?capital FILTER ( ?large = ?capital ) }","N","0.0","0.0","0.0","0.0","0.0","0.0","N"
"169","N","Welche Schachspieler starben am selben Ort, an dem sie geboren wurden?","SELECT DISTINCT ?uri WHERE { ?uri a <http://dbpedia.org/ontology/ChessPlayer> ; <http://dbpedia.org/ontology/birthPlace> ?x ; <http://dbpedia.org/ontology/deathPlace> ?y FILTER ( ?x = ?y ) }","N","0.0","0.0","0.0","0.0","0.0","0.0","N"
"170","N","Wem gehoert Facebook?","SELECT DISTINCT ?uri WHERE { <http://dbpedia.org/resource/Facebook> <http://dbpedia.org/ontology/foundedBy> ?uri }","N","0.0","0.0","0.0","0.0","0.0","0.0","N"
"171","N","Gib mir alle Filme mit Tom Cruise","SELECT DISTINCT ?uri WHERE { ?uri a <http://dbpedia.org/ontology/Film> ; <http://dbpedia.org/ontology/starring> <http://dbpedia.org/resource/Tom_Cruise> }","N","0.0","0.0","0.0","0.0","0.0","0.0","N"
"173","N","Gib mir alle Staedte in New Jersey, die mehr als 100000 Einwohner haben","PREFIX dbo: <http://dbpedia.org/ontology/> PREFIX res: <http://dbpedia.org/resource/> PREFIX dbp: <http://dbpedia.org/property/> PREFIX rdf: <http://www.w3.org/1999/02/22-rdf-syntax-ns#> SELECT DISTINCT ?uri WHERE { ?uri rdf:type dbo:City ; dbo:isPartOf res:New_Jersey ; dbo:populationTotal ?inhabitants FILTER ( ?inhabitants > 100000 ) }","N","0.0","0.0","0.0","0.0","0.0","0.0","N"
"174","N","Welche Berge sind hoeher als der Nanga Parbat?","SELECT DISTINCT ?uri WHERE { <http://dbpedia.org/resource/Nanga_Parbat> <http://dbpedia.org/ontology/elevation> ?elevation . ?uri a <http://dbpedia.org/ontology/Mountain> { ?uri <http://dbpedia.org/ontology/elevation> ?otherelevation } UNION { ?uri <http://dbpedia.org/property/elevationM> ?otherelevation } FILTER ( ?otherelevation > ?elevation ) }","N","0.0","0.0","0.0","0.0","0.0","0.0","N"
"175","N","Gib mir alle B-Seiten der Ramones","SELECT DISTINCT ?string WHERE { ?x <http://dbpedia.org/ontology/musicalArtist> <http://dbpedia.org/resource/Ramones> ; <http://dbpedia.org/ontology/bSide> ?string }","N","0.0","0.0","0.0","0.0","0.0","0.0","N"
"178","N","Gib mir eine Liste aller Koenige von Rom","SELECT DISTINCT ?uri WHERE { ?uri <http://dbpedia.org/property/title> <http://dbpedia.org/resource/King_of_Rome> }","N","0.0","0.0","0.0","0.0","0.0","0.0","N"
"179","N","Gib mir alle Personen, die in Wien geboren wurden und in Berlin gestorben sind","SELECT DISTINCT ?uri WHERE { ?uri <http://dbpedia.org/ontology/birthPlace> <http://dbpedia.org/resource/Vienna> ; <http://dbpedia.org/ontology/deathPlace> <http://dbpedia.org/resource/Berlin> }","N","0.0","0.0","0.0","0.0","0.0","0.0","N"
"185","N","Gib mir alle Schaeferhundrassen","SELECT DISTINCT ?uri WHERE { ?uri <http://dbpedia.org/property/breed> <http://dbpedia.org/resource/German_Shepherd> }","N","0.0","0.0","0.0","0.0","0.0","0.0","N"
"188","N","Was ist das groeßte Land der Welt?","PREFIX dbo: <http://dbpedia.org/ontology/> PREFIX rdf: <http://www.w3.org/1999/02/22-rdf-syntax-ns#> SELECT DISTINCT ?uri WHERE { ?uri rdf:type dbo:Country ; dbo:areaTotal ?n } ORDER BY DESC(?n) OFFSET 0 LIMIT 1","N","0.0","0.0","0.0","0.0","0.0","0.0","N"
"189","N","Was ist das groeßten Stadt im Amerika? ","PREFIX dbo: <http://dbpedia.org/ontology/> PREFIX dbr: <http://dbpedia.org/resource/> SELECT ?lcity WHERE { dbr:United_States dbo:largestCity ?lcity }","N","0.0","0.0","0.0","0.0","0.0","0.0","N"
"190","N","Welcher Papst hat das Vatikanische Fernsehen gegruendet?","PREFIX dbo: <http://dbpedia.org/ontology/> PREFIX res: <http://dbpedia.org/resource/> PREFIX rdf: <http://www.w3.org/1999/02/22-rdf-syntax-ns#> SELECT ?uri WHERE { ?uri rdf:type dbo:Pope . res:Vatican_Television_Center dbo:foundedBy ?uri }","N","0.0","0.0","0.0","0.0","0.0","0.0","N"
"192","N","Wer ist der Koenig der Niederlande?","PREFIX dbo: <http://dbpedia.org/ontology/> PREFIX res: <http://dbpedia.org/resource/> PREFIX rdf: <http://www.w3.org/1999/02/22-rdf-syntax-ns#> SELECT DISTINCT ?uri WHERE { res:Netherlands dbo:leader ?uri . ?uri rdf:type dbo:Royalty }","N","0.0","0.0","0.0","0.0","0.0","0.0","N"
"193","N","Ist Cola ein Getraenk?","PREFIX dbo: <http://dbpedia.org/ontology/> PREFIX res: <http://dbpedia.org/resource/> PREFIX rdf: <http://www.w3.org/1999/02/22-rdf-syntax-ns#> ASK WHERE { res:Cola rdf:type dbo:Beverage }","N","0.0","0.0","0.0","0.0","0.0","0.0","N"
"194","N","Was ist das Alma mater von das Kanzler von Deutschland Angela Merkel? ","PREFIX dbo: <http://dbpedia.org/ontology/> PREFIX dbr: <http://dbpedia.org/resource/> SELECT ?Almamater WHERE { dbr:Angela_Merkel dbo:almaMater ?Almamater }","N","0.0","0.0","0.0","0.0","0.0","0.0","N"
"195","N","Wer schrieb das Buch Die Saeulen der Erde?","PREFIX dbo: <http://dbpedia.org/ontology/> PREFIX res: <http://dbpedia.org/resource/> SELECT DISTINCT ?uri WHERE { res:The_Pillars_of_the_Earth dbo:author ?uri }","N","0.0","0.0","0.0","0.0","0.0","0.0","N"
"196","N","Welche Flughaefen fliegt Yeti Airlines an?","PREFIX dbo: <http://dbpedia.org/ontology/> PREFIX res: <http://dbpedia.org/resource/> SELECT DISTINCT ?uri WHERE { res:Yeti_Airlines dbo:targetAirport ?uri }","N","0.0","0.0","0.0","0.0","0.0","0.0","N"
"197","N","Woher ist das Geburtsort von Goethe? ","PREFIX dbo: <http://dbpedia.org/ontology/> PREFIX dbr: <http://dbpedia.org/resource/> SELECT ?Goethe WHERE { dbr:Johann_Wolfgang_von_Goethe dbo:birthPlace ?Goethe }","N","0.0","0.0","0.0","0.0","0.0","0.0","N"
"199","N","Welche Zutaten brauche ich fuer Moehrenkuchen?","PREFIX dbo: <http://dbpedia.org/ontology/> PREFIX res: <http://dbpedia.org/resource/> SELECT DISTINCT ?uri WHERE { res:Carrot_cake dbo:ingredient ?uri }","N","0.0","0.0","0.0","0.0","0.0","0.0","N"
"200","N","Wer hat Wikipedia gegruendet?","PREFIX dbo: <http://dbpedia.org/ontology/> PREFIX res: <http://dbpedia.org/resource/> SELECT DISTINCT ?uri WHERE { res:Wikipedia dbo:author ?uri }","N","0.0","0.0","0.0","0.0","0.0","0.0","N"
"201","N","Was ist das hoechste Berg im Sachsen Deutschland? ","PREFIX dbo: <http://dbpedia.org/ontology/> PREFIX dbr: <http://dbpedia.org/resource/> SELECT ?m WHERE { ?m dbo:mountainRange dbr:Ore_Mountains ; dbo:elevation ?height } ORDER BY DESC(?height) LIMIT 1","N","0.0","0.0","0.0","0.0","0.0","0.0","N"
"202","N","Wer ist das Strom Bundes Minister von Finanzen im Deutschland? ","PREFIX dbo: <http://dbpedia.org/ontology/> SELECT ?leader WHERE { <http://dbpedia.org/resource/Federal_Ministry_of_Finance_(Germany)> dbo:leader ?leader }","N","0.0","0.0","0.0","0.0","0.0","0.0","N"
"206","N","Im welche Zustand Penn Zustand Universitaet ist gelegen? ","PREFIX dbo: <http://dbpedia.org/ontology/> PREFIX dbr: <http://dbpedia.org/resource/> SELECT ?s WHERE { dbr:Pennsylvania_State_University dbo:state ?s }","N","0.0","0.0","0.0","0.0","0.0","0.0","N"
"207","N","Was ist das groeßte Stadion in Spanien?","PREFIX dbo: <http://dbpedia.org/ontology/> PREFIX res: <http://dbpedia.org/resource/> PREFIX rdf: <http://www.w3.org/1999/02/22-rdf-syntax-ns#> SELECT DISTINCT ?uri WHERE { ?uri rdf:type dbo:Stadium ; dbo:location res:Spain ; dbo:seatingCapacity ?n } ORDER BY DESC(?n) OFFSET 0 LIMIT 1","N","0.0","0.0","0.0","0.0","0.0","0.0","N"
"209","N","Wie groß ist das Bereich von VEREINIGTES KÖNIGREICH? ","PREFIX dbo: <http://dbpedia.org/ontology/> PREFIX dbr: <http://dbpedia.org/resource/> SELECT ?area WHERE { dbr:United_Kingdom dbo:areaTotal ?area }","N","0.0","0.0","0.0","0.0","0.0","0.0","N"
"213","N","Gib mir alle Filme, bei denen Francis Ford Coppola Regie gefuehrt hat","PREFIX dbo: <http://dbpedia.org/ontology/> PREFIX res: <http://dbpedia.org/resource/> PREFIX rdf: <http://www.w3.org/1999/02/22-rdf-syntax-ns#> SELECT DISTINCT ?uri WHERE { ?uri rdf:type dbo:Film ; dbo:director res:Francis_Ford_Coppola }","N","0.0","0.0","0.0","0.0","0.0","0.0","N"
"214","N","Sind Laubfroesche Amphibien?","PREFIX dbo: <http://dbpedia.org/ontology/> PREFIX res: <http://dbpedia.org/resource/> ASK WHERE { res:Hylidae dbo:class res:Amphibian }","N","0.0","0.0","0.0","0.0","0.0","0.0","N"
"216","N","Wie viel ist das Elevation von Duesseldorf Flughafen ? ","PREFIX dbo: <http://dbpedia.org/ontology/> PREFIX dbr: <http://dbpedia.org/resource/> SELECT ?ele WHERE { dbr:Düsseldorf_Airport dbo:elevation ?ele } LIMIT 1","N","0.0","0.0","0.0","0.0","0.0","0.0","N"
"217","N","Wie viel ist das Population von Mexiko Stadt ? ","PREFIX dbo: <http://dbpedia.org/ontology/> PREFIX dbr: <http://dbpedia.org/resource/> SELECT ?Mexico_City WHERE { dbr:Mexico_City dbo:populationTotal ?Mexico_City }","N","0.0","0.0","0.0","0.0","0.0","0.0","N"
"218","N","wann war das Gruendung Datum von Franzoesisch fuenfte Republik? ","PREFIX dbo: <http://dbpedia.org/ontology/> PREFIX dbr: <http://dbpedia.org/resource/> SELECT ?ff WHERE { dbr:French_Fifth_Republic dbo:foundingDate ?ff }","N","0.0","0.0","0.0","0.0","0.0","0.0","N"
