"ID","status","sentence","sparqlQueGG","sparqlQald","TP","FP","FN","Precision","Recall","Fscore","Status"
"219","N","Wer war der erste Koenig von England?","PREFIX dbo: <http://dbpedia.org/ontology/> PREFIX yago: <http://dbpedia.org/class/yago/> PREFIX rdf: <http://www.w3.org/1999/02/22-rdf-syntax-ns#> SELECT DISTINCT ?uri WHERE { ?uri rdf:type dbo:Royalty ; rdf:type yago:WikicatEnglishMonarchs ; dbo:activeYearsStartYear ?date } ORDER BY ASC(?date) OFFSET 0 LIMIT 1","N","0.0","0.0","0.0","0.0","0.0","0.0","N"
"222","N","Wer ist der juengste Dartspieler?","PREFIX dbo: <http://dbpedia.org/ontology/> PREFIX rdf: <http://www.w3.org/1999/02/22-rdf-syntax-ns#> SELECT DISTINCT ?uri WHERE { ?uri rdf:type dbo:DartsPlayer ; dbo:birthDate ?date } ORDER BY DESC(?date) OFFSET 0 LIMIT 1","N","0.0","0.0","0.0","0.0","0.0","0.0","N"
"224","N","Welchen Fluss ueberspannt die Brooklyn Bridge?","PREFIX dbo: <http://dbpedia.org/ontology/> PREFIX res: <http://dbpedia.org/resource/> SELECT DISTINCT ?uri WHERE { res:Brooklyn_Bridge dbo:crosses ?uri }","N","0.0","0.0","0.0","0.0","0.0","0.0","N"
"226","N","Wann war das letzte Folge von das Fernseher Serie Freunde ausgestrahlt? ","PREFIX dbo: <http://dbpedia.org/ontology/> PREFIX dbr: <http://dbpedia.org/resource/> SELECT ?date WHERE { dbr:Friends dbo:completionDate ?date }","N","0.0","0.0","0.0","0.0","0.0","0.0","N"
"227","N","Heißt die Frau von Praesident Obama Michelle?","PREFIX dbo: <http://dbpedia.org/ontology/> PREFIX res: <http://dbpedia.org/resource/> PREFIX rdfs: <http://www.w3.org/2000/01/rdf-schema#> ASK WHERE { res:Barack_Obama dbo:spouse ?spouse . ?spouse rdfs:label ?name FILTER regex(?name, ""Michelle"") }","N","0.0","0.0","0.0","0.0","0.0","0.0","N"
"230","N","Wie viel ist das gesamt Population von europaeisch Union? ","PREFIX dbo: <http://dbpedia.org/ontology/> PREFIX dbr: <http://dbpedia.org/resource/> SELECT ?europop WHERE { dbr:European_Union dbo:populationTotal ?europop }","N","0.0","0.0","0.0","0.0","0.0","0.0","N"
"231","N","Gib mir alle von der NASA betriebenen Startrampen","PREFIX dbo: <http://dbpedia.org/ontology/> PREFIX res: <http://dbpedia.org/resource/> PREFIX rdf: <http://www.w3.org/1999/02/22-rdf-syntax-ns#> SELECT DISTINCT ?uri WHERE { ?uri rdf:type dbo:LaunchPad ; dbo:operator res:NASA }","N","0.0","0.0","0.0","0.0","0.0","0.0","N"
"233","N","Was ist das Geburt Name von Adele? ","PREFIX dbo: <http://dbpedia.org/ontology/> PREFIX dbr: <http://dbpedia.org/resource/> SELECT ?bn WHERE { dbr:Adele dbo:birthName ?bn }","N","0.0","0.0","0.0","0.0","0.0","0.0","N"
"234","N","Was ist das Population von Kairo? ","PREFIX dbo: <http://dbpedia.org/ontology/> PREFIX dbr: <http://dbpedia.org/resource/> SELECT ?pop WHERE { dbr:Cairo dbo:populationTotal ?pop }","N","0.0","0.0","0.0","0.0","0.0","0.0","N"
"237","N","Woher ist Sungkyunkwan Universitaet? ","PREFIX dbo: <http://dbpedia.org/ontology/> PREFIX dbr: <http://dbpedia.org/resource/> SELECT DISTINCT ?country WHERE { dbr:Sungkyunkwan_University dbo:city ?city ; dbo:country ?country }","N","0.0","0.0","0.0","0.0","0.0","0.0","N"
"238","N","Wer ist das Autor von das Deutung von Traeume? ","PREFIX dbo: <http://dbpedia.org/ontology/> PREFIX dbr: <http://dbpedia.org/resource/> SELECT ?Author WHERE { dbr:The_Interpretation_of_Dreams dbo:author ?Author }","N","0.0","0.0","0.0","0.0","0.0","0.0","N"
"239","N","Wann war das Tod von Shakespeare? ","PREFIX dbo: <http://dbpedia.org/ontology/> PREFIX dbr: <http://dbpedia.org/resource/> SELECT ?x WHERE { dbr:William_Shakespeare dbo:deathDate ?x } LIMIT 1","N","0.0","0.0","0.0","0.0","0.0","0.0","N"
"242","N","Woher ist das Ursprung von Carolina Sensenmann? ","PREFIX dbo: <http://dbpedia.org/ontology/>PREFIX dbr: <http://dbpedia.org/resource/> SELECT ?uri WHERE { dbr:Carolina_Reaper dbo:origin ?uri}","N","0.0","0.0","0.0","0.0","0.0","0.0","N"
"245","N","Hieß die Frau von Praesident Lincoln Mary?","PREFIX dbo: <http://dbpedia.org/ontology/> PREFIX res: <http://dbpedia.org/resource/> PREFIX rdfs: <http://www.w3.org/2000/01/rdf-schema#> ASK WHERE { res:Abraham_Lincoln dbo:spouse ?spouse . ?spouse rdfs:label ?name FILTER regex(?name, ""Mary"") }","N","0.0","0.0","0.0","0.0","0.0","0.0","N"
"246","N","Durch welche Staedte fließt die Weser?","PREFIX dbo: <http://dbpedia.org/ontology/> PREFIX res: <http://dbpedia.org/resource/> SELECT DISTINCT ?uri WHERE { res:Weser dbo:city ?uri }","N","0.0","0.0","0.0","0.0","0.0","0.0","N"
"248","N","Welche Universiaet hat Angela Merkel besucht?","PREFIX dbo: <http://dbpedia.org/ontology/> PREFIX res: <http://dbpedia.org/resource/> SELECT DISTINCT ?university WHERE { res:Angela_Merkel dbo:almaMater ?university }","N","0.0","0.0","0.0","0.0","0.0","0.0","N"
"249","N","Liste alle Musicals mit Musik von Elton John auf","PREFIX dbo: <http://dbpedia.org/ontology/> PREFIX res: <http://dbpedia.org/resource/> PREFIX rdf: <http://www.w3.org/1999/02/22-rdf-syntax-ns#> SELECT DISTINCT ?uri WHERE { ?uri rdf:type dbo:Musical ; dbo:musicBy res:Elton_John }","N","0.0","0.0","0.0","0.0","0.0","0.0","N"
"251","N","Was ist der laengste Fluss der Welt?","PREFIX dbo: <http://dbpedia.org/ontology/> PREFIX rdf: <http://www.w3.org/1999/02/22-rdf-syntax-ns#> SELECT ?uri WHERE { ?uri rdf:type dbo:BodyOfWater ; dbo:length ?length } ORDER BY DESC(?length) LIMIT 1","N","0.0","0.0","0.0","0.0","0.0","0.0","N"
"254","N","Wer war die Frau von US-Praesident Lincoln?","PREFIX dbo: <http://dbpedia.org/ontology/> PREFIX res: <http://dbpedia.org/resource/> SELECT DISTINCT ?uri WHERE { res:Abraham_Lincoln dbo:spouse ?uri }","N","0.0","0.0","0.0","0.0","0.0","0.0","N"
"255","N","Welche Spezies tut ein Elefant gehoeren? ","PREFIX dbr: <http://dbpedia.org/resource/> PREFIX dbp: <http://dbpedia.org/property/> SELECT ?species WHERE { dbr:Elephant dbp:species ?species }","N","0.0","0.0","0.0","0.0","0.0","0.0","N"
"259","N","Wer hat den Soundtrack fuer Camerons Titanic geschrieben?","PREFIX dbo: <http://dbpedia.org/ontology/> SELECT DISTINCT ?uri WHERE { <http://dbpedia.org/resource/Titanic_(1997_film)> dbo:musicComposer ?uri }","N","0.0","0.0","0.0","0.0","0.0","0.0","N"
"260","N","Gib mir die Laufzeit von Toy Story","PREFIX dbo: <http://dbpedia.org/ontology/> PREFIX res: <http://dbpedia.org/resource/> SELECT DISTINCT ?runtime WHERE { res:Toy_Story dbo:runtime ?runtime }","N","0.0","0.0","0.0","0.0","0.0","0.0","N"
"262","N","Mit Wie viele Laender Ich rannte hat Grenzen? ","PREFIX dbr: <http://dbpedia.org/resource/> PREFIX dbp: <http://dbpedia.org/property/> SELECT ?border WHERE { dbr:Geography_of_Iran dbp:borders ?border } LIMIT 8","N","0.0","0.0","0.0","0.0","0.0","0.0","N"
"263","N","Welche Elektronikunternehmen wurden in Peking gegruendet?","PREFIX dbo: <http://dbpedia.org/ontology/> PREFIX res: <http://dbpedia.org/resource/> PREFIX rdf: <http://www.w3.org/1999/02/22-rdf-syntax-ns#> SELECT DISTINCT ?uri WHERE { ?uri rdf:type dbo:Company ; dbo:industry res:Electronics ; dbo:foundationPlace res:Beijing }","N","0.0","0.0","0.0","0.0","0.0","0.0","N"
"265","N","Wer ist Buergermeister von Paris?","PREFIX dbo: <http://dbpedia.org/ontology/> PREFIX res: <http://dbpedia.org/resource/> SELECT DISTINCT ?uri WHERE { res:Paris dbo:mayor ?uri }","N","0.0","0.0","0.0","0.0","0.0","0.0","N"
"266","N","Hat Arnold Schwarzenegger eine Universitaet besucht?","PREFIX dbo: <http://dbpedia.org/ontology/> PREFIX res: <http://dbpedia.org/resource/> PREFIX rdf: <http://www.w3.org/1999/02/22-rdf-syntax-ns#> ASK WHERE { res:Arnold_Schwarzenegger dbo:almaMater ?x . ?x rdf:type dbo:University }","N","0.0","0.0","0.0","0.0","0.0","0.0","N"
"270","N","Wer war der Vizepraesident unter John F Kennedy?","PREFIX dbo: <http://dbpedia.org/ontology/> PREFIX res: <http://dbpedia.org/resource/> SELECT DISTINCT ?uri WHERE { res:John_F._Kennedy dbo:vicePresident ?uri }","N","0.0","0.0","0.0","0.0","0.0","0.0","N"
"275","N","Liste die Kinder von Margaret Thatcher auf","PREFIX dbo: <http://dbpedia.org/ontology/> PREFIX res: <http://dbpedia.org/resource/> SELECT DISTINCT ?uri WHERE { res:Margaret_Thatcher dbo:child ?uri }","N","0.0","0.0","0.0","0.0","0.0","0.0","N"
"278","N","Wie groß ist das gesamt Bereich von Norden Rhein- Westfalen? ","PREFIX dbo: <http://dbpedia.org/ontology/> PREFIX dbr: <http://dbpedia.org/resource/> SELECT ?tarea WHERE { dbr:North_Rhine-Westphalia dbo:areaTotal ?tarea }","N","0.0","0.0","0.0","0.0","0.0","0.0","N"
"280","N","Was ist Donald Trumps Main Geschaeft? ","PREFIX dbo: <http://dbpedia.org/ontology/> PREFIX dbr: <http://dbpedia.org/resource/> SELECT ?owner WHERE { ?owner dbo:owner dbr:Donald_Trump }","N","0.0","0.0","0.0","0.0","0.0","0.0","N"
"281","N","Wann werden Anfang das Finale Spiel von das Fußball Welt Tasse 2018? ","PREFIX dbr: <http://dbpedia.org/resource/> PREFIX dbp: <http://dbpedia.org/property/> SELECT ?Date WHERE { dbr:2018_FIFA_World_Cup dbp:date ?Date } ORDER BY DESC(?Date) LIMIT 1","N","0.0","0.0","0.0","0.0","0.0","0.0","N"
"282","N","Bei wievielen Filmen hat Stanley Kubrick Regie gefuehrt?","PREFIX dbo: <http://dbpedia.org/ontology/> PREFIX res: <http://dbpedia.org/resource/> SELECT DISTINCT ?uri WHERE { ?uri dbo:director res:Stanley_Kubrick }","N","0.0","0.0","0.0","0.0","0.0","0.0","N"
"283","N","Wie viel ist das Population Irak? ","PREFIX dbo: <http://dbpedia.org/ontology/> PREFIX dbr: <http://dbpedia.org/resource/> SELECT ?pIraq WHERE { dbr:Iraq dbo:populationTotal ?pIraq }","N","0.0","0.0","0.0","0.0","0.0","0.0","N"
"284","N","Wieviele Einwohner hat die groeßte Stadt in Kanada?","PREFIX dbo: <http://dbpedia.org/ontology/> PREFIX res: <http://dbpedia.org/resource/> SELECT DISTINCT ?num WHERE { res:Canada dbo:largestCity ?city . ?city dbo:populationTotal ?num }","N","0.0","0.0","0.0","0.0","0.0","0.0","N"
"285","WORK","Wer ist der Buergermeister der Hauptstadt von Franzoesisch-Polynesien?","PREFIX dbo: <http://dbpedia.org/ontology/> PREFIX res: <http://dbpedia.org/resource/> SELECT DISTINCT ?uri WHERE { res:French_Polynesia dbo:capital ?x . ?x dbo:mayor ?uri }","N","0.0","0.0","0.0","0.0","0.0","0.0","WORK"
"286","N","Gib mir alle Schauspieler von Filmen, in denen William Shatner Regie gefuehrt hat","PREFIX dbo: <http://dbpedia.org/ontology/> PREFIX res: <http://dbpedia.org/resource/> SELECT DISTINCT ?uri WHERE { ?x dbo:director res:William_Shatner ; dbo:starring ?uri }","N","0.0","0.0","0.0","0.0","0.0","0.0","N"
"288","N","Wie viel ist das Population Dichte Rang von Deutschland? ","PREFIX dbr: <http://dbpedia.org/resource/> PREFIX dbp: <http://dbpedia.org/property/> SELECT ?rank WHERE { dbr:Germany dbp:populationDensityRank ?rank }","N","0.0","0.0","0.0","0.0","0.0","0.0","N"
"289","N","Was ist der hoechste Berg in Italien?","PREFIX dbo: <http://dbpedia.org/ontology/> PREFIX res: <http://dbpedia.org/resource/> PREFIX rdf: <http://www.w3.org/1999/02/22-rdf-syntax-ns#> SELECT DISTINCT ?uri WHERE { ?uri rdf:type dbo:Mountain ; dbo:locatedInArea res:Italy ; dbo:elevation ?num } ORDER BY DESC(?num) OFFSET 0 LIMIT 1","N","0.0","0.0","0.0","0.0","0.0","0.0","N"
"290","WORK","Liste alle Spiele von GMT auf","PREFIX dbo: <http://dbpedia.org/ontology/> PREFIX res: <http://dbpedia.org/resource/> SELECT DISTINCT ?uri WHERE { ?uri dbo:publisher res:GMT_Games }","N","0.0","0.0","0.0","0.0","0.0","0.0","WORK"
"295","N","Gib mir alle Videospiele von Mean Hamster Software","PREFIX dbo: <http://dbpedia.org/ontology/> PREFIX res: <http://dbpedia.org/resource/> PREFIX rdf: <http://www.w3.org/1999/02/22-rdf-syntax-ns#> SELECT DISTINCT ?uri WHERE { ?uri rdf:type dbo:VideoGame ; dbo:publisher res:Mean_Hamster_Software }","N","0.0","0.0","0.0","0.0","0.0","0.0","N"
"296","N","Gib mir alle Bandmitglieder von Prodigy","PREFIX dbo: <http://dbpedia.org/ontology/> PREFIX res: <http://dbpedia.org/resource/> SELECT DISTINCT ?uri WHERE { res:The_Prodigy dbo:bandMember ?uri }","N","0.0","0.0","0.0","0.0","0.0","0.0","N"
"300","WORK","Wer ist der Buergermeister von Rotterdam?","PREFIX dbo: <http://dbpedia.org/ontology/> PREFIX res: <http://dbpedia.org/resource/> SELECT DISTINCT ?uri WHERE { res:Rotterdam dbo:leaderName ?uri }","N","0.0","0.0","0.0","0.0","0.0","0.0","WORK"
"301","N","Was ist die groeßte Stadt in Australien?","PREFIX dbo: <http://dbpedia.org/ontology/> PREFIX res: <http://dbpedia.org/resource/> SELECT DISTINCT ?uri WHERE { res:Australia dbo:largestCity ?uri }","N","0.0","0.0","0.0","0.0","0.0","0.0","N"
"302","N","Wer war mit Praesident Chirac verheiratet?","PREFIX dbo: <http://dbpedia.org/ontology/> PREFIX res: <http://dbpedia.org/resource/> SELECT DISTINCT ?uri WHERE { res:Jacques_Chirac dbo:spouse ?uri }","N","0.0","0.0","0.0","0.0","0.0","0.0","N"
"303","N","Welche Regierungsform hat Suedafrika?","PREFIX dbo: <http://dbpedia.org/ontology/> PREFIX dbr: <http://dbpedia.org/resource/> SELECT ?uri WHERE { dbr:South_Africa dbo:governmentType ?uri }","N","0.0","0.0","0.0","0.0","0.0","0.0","N"
"305","N","Welche Feiertage werden auf der Welt gefeiert? test1","PREFIX dbo: <http://dbpedia.org/ontology/> PREFIX rdf: <http://www.w3.org/1999/02/22-rdf-syntax-ns#> SELECT DISTINCT ?uri WHERE { ?uri rdf:type dbo:Holiday }","N","0.0","0.0","0.0","0.0","0.0","0.0","N"
"306","N","Wer ist der groeßte Basketballspieler?","PREFIX dbo: <http://dbpedia.org/ontology/> PREFIX rdf: <http://www.w3.org/1999/02/22-rdf-syntax-ns#> SELECT DISTINCT ?uri WHERE { ?uri rdf:type dbo:BasketballPlayer ; dbo:height ?num } ORDER BY DESC(?num) OFFSET 0 LIMIT 1","N","0.0","0.0","0.0","0.0","0.0","0.0","N"
"309","N","Hat Kaurismaeki jemals den Großen Preis der Jury in Cannes gewonnen?","PREFIX dbo: <http://dbpedia.org/ontology/> PREFIX res: <http://dbpedia.org/resource/> ASK WHERE { res:Aki_Kaurismäki dbo:award <http://dbpedia.org/resource/Grand_Prix_(Cannes_Film_Festival)> }","N","0.0","0.0","0.0","0.0","0.0","0.0","N"
"310","N","Welcher Partei gehoert die Buergermeisterin von Paris an?","PREFIX dbo: <http://dbpedia.org/ontology/> PREFIX res: <http://dbpedia.org/resource/> SELECT DISTINCT ?uri WHERE { res:Paris dbo:mayor ?x . ?x dbo:party ?uri }","N","0.0","0.0","0.0","0.0","0.0","0.0","N"
"313","N","Gib mir den Geburtsort von Frank Sinatra","PREFIX dbo: <http://dbpedia.org/ontology/> PREFIX res: <http://dbpedia.org/resource/> SELECT DISTINCT ?place WHERE { res:Frank_Sinatra dbo:birthPlace ?place }","N","0.0","0.0","0.0","0.0","0.0","0.0","N"
"320","N","Wer ist das aelteste Kind von Meryl Streep?","PREFIX dbo: <http://dbpedia.org/ontology/> PREFIX res: <http://dbpedia.org/resource/> SELECT DISTINCT ?uri WHERE { res:Meryl_Streep dbo:child ?uri . ?uri dbo:birthDate ?d } ORDER BY ASC(?d) OFFSET 0 LIMIT 1","N","0.0","0.0","0.0","0.0","0.0","0.0","N"
"322","N","Wofuer steht IYCM?","PREFIX dbo: <http://dbpedia.org/ontology/> PREFIX res: <http://dbpedia.org/resource/> SELECT DISTINCT ?uri WHERE { ?uri dbo:abbreviation ""IYCM"" }","N","0.0","0.0","0.0","0.0","0.0","0.0","N"
"324","N","War US-Praesident Jackson in einen Krieg verwickelt?","PREFIX dbo: <http://dbpedia.org/ontology/> PREFIX res: <http://dbpedia.org/resource/> ASK WHERE { res:Andrew_Jackson dbo:battle ?battle }","N","0.0","0.0","0.0","0.0","0.0","0.0","N"
"326","N","Hat Tesla den Nobelpreis fuer Physik gewonnen?","PREFIX dbo: <http://dbpedia.org/ontology/> PREFIX res: <http://dbpedia.org/resource/> ASK WHERE { res:Nikola_Tesla dbo:award res:Nobel_Prize_in_Physics }","N","0.0","0.0","0.0","0.0","0.0","0.0","N"
"328","N","Welcher Wissenschaftler ist bekannt fuer das Manhattan-Projekt und den Friedensnobelpreis?","PREFIX dbo: <http://dbpedia.org/ontology/> PREFIX res: <http://dbpedia.org/resource/> PREFIX rdf: <http://www.w3.org/1999/02/22-rdf-syntax-ns#> SELECT DISTINCT ?uri WHERE { ?uri dbo:knownFor res:Manhattan_Project ; rdf:type dbo:Scientist ; dbo:knownFor res:Nobel_Peace_Prize }","N","0.0","0.0","0.0","0.0","0.0","0.0","N"
"330","N","Wer hat die Musik fuer Harold und Maude komponiert?","PREFIX dbo: <http://dbpedia.org/ontology/> PREFIX res: <http://dbpedia.org/resource/> SELECT DISTINCT ?uri WHERE { res:Harold_and_Maude dbo:musicComposer ?uri }","N","0.0","0.0","0.0","0.0","0.0","0.0","N"
"334","N","Spielt Neymar fuer Real Madrid?","PREFIX dbo: <http://dbpedia.org/ontology/> PREFIX res: <http://dbpedia.org/resource/> ASK WHERE { res:Neymar dbo:team <http://dbpedia.org/resource/Real_Madrid_C.F.> }","N","0.0","0.0","0.0","0.0","0.0","0.0","N"
"340","N","Welches Gebaeude nach dem Burj Khalifa hat die meisten Etagen","PREFIX dbo: <http://dbpedia.org/ontology/> PREFIX res: <http://dbpedia.org/resource/> PREFIX rdf: <http://www.w3.org/1999/02/22-rdf-syntax-ns#> SELECT DISTINCT ?uri WHERE { res:Burj_Khalifa dbo:floorCount ?burj . ?uri rdf:type dbo:Building ; dbo:floorCount ?proj FILTER ( ?proj < ?burj ) } ORDER BY DESC(?proj) LIMIT 1","N","0.0","0.0","0.0","0.0","0.0","0.0","N"
"345","N","Wer spielt alles in spanischen Filmen produziert von Benicio del Toro mit? ","PREFIX dbo: <http://dbpedia.org/ontology/> PREFIX res: <http://dbpedia.org/resource/> PREFIX rdf: <http://www.w3.org/1999/02/22-rdf-syntax-ns#> SELECT DISTINCT ?uri WHERE { ?film rdf:type dbo:Film ; dbo:country res:Spain ; dbo:producer res:Benicio_del_Toro ; dbo:starring ?uri . ?uri rdf:type dbo:Person }","N","0.0","0.0","0.0","0.0","0.0","0.0","N"
"346","N","Ist der Baikalsee groeßer als der Große Baerensee?","PREFIX dbo: <http://dbpedia.org/ontology/> PREFIX res: <http://dbpedia.org/resource/> ASK WHERE { res:Lake_Baikal dbo:areaTotal ?a1 . res:Great_Bear_Lake dbo:areaTotal ?a2 FILTER ( ?a1 > ?a2 ) }","N","0.0","0.0","0.0","0.0","0.0","0.0","N"
"347","N","Zeig mir alle Buecher in Asimovs Foundation-Serie","PREFIX dbo: <http://dbpedia.org/ontology/> PREFIX res: <http://dbpedia.org/resource/> SELECT DISTINCT ?uri WHERE { ?uri dbo:series res:Foundation_series }","N","0.0","0.0","0.0","0.0","0.0","0.0","N"
"349","N","Welche Stadt hat die aelteste funktionierende U-Bahn?","PREFIX dbo: <http://dbpedia.org/ontology/> PREFIX dbr: <http://dbpedia.org/resource/> PREFIX rdf: <http://www.w3.org/1999/02/22-rdf-syntax-ns#> SELECT ?loc WHERE { ?uri dbo:type dbr:Rapid_transit ; dbo:openingYear ?date ; dbo:location ?loc . ?loc rdf:type dbo:City } ORDER BY ASC(?date) LIMIT 1","N","0.0","0.0","0.0","0.0","0.0","0.0","N"
"355","N","Welcher Stilrichtung gehoerte der Maler der Drei Taenzer an?","PREFIX dbo: <http://dbpedia.org/ontology/> PREFIX res: <http://dbpedia.org/resource/> SELECT DISTINCT ?uri WHERE { res:The_Three_Dancers dbo:author ?person . ?person dbo:movement ?uri }","N","0.0","0.0","0.0","0.0","0.0","0.0","N"
"356","N","Wann wurde die Operation Overlord durchgefuehrt?","PREFIX dbo: <http://dbpedia.org/ontology/> PREFIX res: <http://dbpedia.org/resource/> SELECT DISTINCT ?d WHERE { res:Operation_Overlord dbo:date ?d }","N","0.0","0.0","0.0","0.0","0.0","0.0","N"
"357","N","Welche Bruecke hat die laengste Spannweite?","PREFIX dbo: <http://dbpedia.org/ontology/> PREFIX res: <http://dbpedia.org/resource/> PREFIX rdf: <http://www.w3.org/1999/02/22-rdf-syntax-ns#> SELECT DISTINCT ?uri WHERE { ?uri rdf:type dbo:Bridge ; dbo:mainspan ?s } ORDER BY DESC(?s) OFFSET 0 LIMIT 1","N","0.0","0.0","0.0","0.0","0.0","0.0","N"
"358","N","Gibt es ein Videospiel, das Battle Chess heißt?","PREFIX dbo: <http://dbpedia.org/ontology/> PREFIX rdfs: <http://www.w3.org/2000/01/rdf-schema#> PREFIX rdf: <http://www.w3.org/1999/02/22-rdf-syntax-ns#> ASK WHERE { ?uri rdf:type dbo:VideoGame ; rdfs:label ""Battle Chess""@en }","N","0.0","0.0","0.0","0.0","0.0","0.0","N"
"364","N","In welcher Stadt im Vereinigten Koenigreich ist das Hauptquartier des MI6?","PREFIX dbo: <http://dbpedia.org/ontology/> PREFIX res: <http://dbpedia.org/resource/> PREFIX rdf: <http://www.w3.org/1999/02/22-rdf-syntax-ns#> SELECT DISTINCT ?uri WHERE { res:Secret_Intelligence_Service dbo:headquarter ?uri . ?uri dbo:country res:United_Kingdom }","N","0.0","0.0","0.0","0.0","0.0","0.0","N"
"366","N","In welcher Stadt hoert die Ruta 68 auf?","PREFIX dbo: <http://dbpedia.org/ontology/> PREFIX res: <http://dbpedia.org/resource/> SELECT DISTINCT ?uri WHERE { res:Chile_Route_68 dbo:routeEnd ?uri }","N","0.0","0.0","0.0","0.0","0.0","0.0","N"
"367","N","Gib mir die Enkel von Elvis Presley","PREFIX dbo: <http://dbpedia.org/ontology/> PREFIX res: <http://dbpedia.org/resource/> SELECT DISTINCT ?uri WHERE { res:Elvis_Presley dbo:child ?child . ?child dbo:child ?uri }","N","0.0","0.0","0.0","0.0","0.0","0.0","N"
"369","N","An welchen militaerischen Auseinandersetzungen war Lawrence von Arabien beteiligt?","PREFIX dbo: <http://dbpedia.org/ontology/> PREFIX res: <http://dbpedia.org/resource/> SELECT DISTINCT ?uri WHERE { res:T._E._Lawrence dbo:battle ?uri }","N","0.0","0.0","0.0","0.0","0.0","0.0","N"
"371","N","Gib mir alle Buecher von William Goldman mit mehr als 300 Seiten","PREFIX dbo: <http://dbpedia.org/ontology/> PREFIX res: <http://dbpedia.org/resource/> PREFIX rdf: <http://www.w3.org/1999/02/22-rdf-syntax-ns#> SELECT DISTINCT ?uri WHERE { ?uri rdf:type dbo:Book ; dbo:author res:William_Goldman ; dbo:numberOfPages ?x FILTER ( ?x > 300 ) }","N","0.0","0.0","0.0","0.0","0.0","0.0","N"
"378","N","Welche Buecher von Kerouac wurden von Viking Press verlegt?","PREFIX dbo: <http://dbpedia.org/ontology/> PREFIX res: <http://dbpedia.org/resource/> PREFIX rdf: <http://www.w3.org/1999/02/22-rdf-syntax-ns#> SELECT DISTINCT ?uri WHERE { ?uri rdf:type dbo:Book ; dbo:publisher res:Viking_Press ; dbo:author res:Jack_Kerouac }","N","0.0","0.0","0.0","0.0","0.0","0.0","N"
"381","WORK","Wer ist der Buergermeister von Tel Aviv?","PREFIX dbo: <http://dbpedia.org/ontology/> PREFIX res: <http://dbpedia.org/resource/> SELECT DISTINCT ?uri WHERE { res:Tel_Aviv dbo:leaderName ?uri }","N","0.0","0.0","0.0","0.0","0.0","0.0","WORK"
"383","N","Zeig mir das Buch, das Muhammad Ali geschrieben hat","PREFIX dbo: <http://dbpedia.org/ontology/> PREFIX res: <http://dbpedia.org/resource/> PREFIX rdf: <http://www.w3.org/1999/02/22-rdf-syntax-ns#> SELECT DISTINCT ?uri WHERE { ?uri rdf:type dbo:Book ; dbo:author res:Muhammad_Ali }","N","0.0","0.0","0.0","0.0","0.0","0.0","N"
"386","N","Was ist die Waehrung der Tschechischen Republik?","PREFIX dbo: <http://dbpedia.org/ontology/> PREFIX res: <http://dbpedia.org/resource/> SELECT DISTINCT ?uri WHERE { res:Czech_Republic dbo:currency ?uri }","N","0.0","0.0","0.0","0.0","0.0","0.0","N"
"389","N","Bei welchen Filmen, in denen Mickey Rourke mitspielt, hat Guy Ritchie Regie gefuehrt?","PREFIX dbo: <http://dbpedia.org/ontology/> PREFIX res: <http://dbpedia.org/resource/> PREFIX rdf: <http://www.w3.org/1999/02/22-rdf-syntax-ns#> SELECT DISTINCT ?uri WHERE { ?uri rdf:type dbo:Film ; dbo:starring res:Mickey_Rourke ; dbo:director res:Guy_Ritchie }","N","0.0","0.0","0.0","0.0","0.0","0.0","N"
"391","N","Zeig mir Hemmingways Autobiographie","PREFIX dbo: <http://dbpedia.org/ontology/> PREFIX res: <http://dbpedia.org/resource/> SELECT DISTINCT ?uri WHERE { ?uri dbo:author res:Ernest_Hemingway ; dbo:literaryGenre res:Autobiography }","N","0.0","0.0","0.0","0.0","0.0","0.0","N"
"393","N","Was sind die fuenf Stadtteile von New York?","PREFIX dbo: <http://dbpedia.org/ontology/> SELECT DISTINCT ?uri WHERE { ?uri dbo:governmentType <http://dbpedia.org/resource/Borough_(New_York_City)> }","N","0.0","0.0","0.0","0.0","0.0","0.0","N"
"394","N","Gib mir alle kanadischen Grunge-Plattenfirmen","PREFIX dbo: <http://dbpedia.org/ontology/> PREFIX res: <http://dbpedia.org/resource/> PREFIX rdf: <http://www.w3.org/1999/02/22-rdf-syntax-ns#> SELECT DISTINCT ?uri WHERE { ?uri rdf:type dbo:RecordLabel ; dbo:genre res:Grunge ; dbo:country res:Canada }","N","0.0","0.0","0.0","0.0","0.0","0.0","N"
"396","N","Wer hat Penguin Books gegruendet?","PREFIX dbo: <http://dbpedia.org/ontology/> PREFIX res: <http://dbpedia.org/resource/> PREFIX rdf: <http://www.w3.org/1999/02/22-rdf-syntax-ns#> SELECT DISTINCT ?uri WHERE { res:Penguin_Books dbo:founder ?uri }","N","0.0","0.0","0.0","0.0","0.0","0.0","N"
"397","N","Wer hat das Titellied fuer Games of Thrones geschrieben?","PREFIX dbo: <http://dbpedia.org/ontology/> PREFIX res: <http://dbpedia.org/resource/> SELECT DISTINCT ?uri WHERE { res:Game_of_Thrones dbo:composer ?uri }","N","0.0","0.0","0.0","0.0","0.0","0.0","N"
"398","N","Wer ist der Praesident von Eritrea?","PREFIX dbo: <http://dbpedia.org/ontology/> PREFIX res: <http://dbpedia.org/resource/> SELECT DISTINCT ?uri WHERE { res:Eritrea dbo:leader ?uri ; dbo:leaderTitle ""President""@en }","N","0.0","0.0","0.0","0.0","0.0","0.0","N"
"400","N","Was ist der hoechste Berg in Australien?","PREFIX dbo: <http://dbpedia.org/ontology/> PREFIX res: <http://dbpedia.org/resource/> PREFIX rdf: <http://www.w3.org/1999/02/22-rdf-syntax-ns#> SELECT DISTINCT ?uri WHERE { ?uri rdf:type dbo:Mountain ; dbo:locatedInArea res:Australia ; dbo:elevation ?elevation } ORDER BY DESC(?elevation) LIMIT 1","N","0.0","0.0","0.0","0.0","0.0","0.0","N"
"402","N","Zeig mir die Waehrung in China an","PREFIX dbo: <http://dbpedia.org/ontology/> PREFIX res: <http://dbpedia.org/resource/> SELECT DISTINCT ?uri WHERE { res:China dbo:currency ?uri }","N","0.0","0.0","0.0","0.0","0.0","0.0","N"
"403","N","Gib mir alle in Schweden geborenen Ozeanographen","PREFIX dbo: <http://dbpedia.org/ontology/> PREFIX res: <http://dbpedia.org/resource/> SELECT DISTINCT ?uri WHERE { ?uri dbo:field res:Oceanography ; dbo:birthPlace res:Sweden }","N","0.0","0.0","0.0","0.0","0.0","0.0","N"
"406","N","In welchen Laendern wird Japanisch gesprochen?","PREFIX dbo: <http://dbpedia.org/ontology/> PREFIX res: <http://dbpedia.org/resource/> PREFIX rdf: <http://www.w3.org/1999/02/22-rdf-syntax-ns#> SELECT DISTINCT ?uri WHERE { ?uri rdf:type dbo:Country ; dbo:language res:Japanese_language }","N","0.0","0.0","0.0","0.0","0.0","0.0","N"
"407","N","Welcher von Tim Burtons Filmen hatte das hoechste Budget?","PREFIX dbo: <http://dbpedia.org/ontology/> PREFIX res: <http://dbpedia.org/resource/> SELECT DISTINCT ?uri WHERE { ?uri dbo:director res:Tim_Burton ; dbo:budget ?b } ORDER BY ?b OFFSET 0 LIMIT 1","N","0.0","0.0","0.0","0.0","0.0","0.0","N"
"412","N","Gib mir alle Schauspieler, die in Last Action Hero mitgespielt haben","PREFIX dbo: <http://dbpedia.org/ontology/> PREFIX res: <http://dbpedia.org/resource/> SELECT DISTINCT ?uri WHERE { res:Last_Action_Hero dbo:starring ?uri }","N","0.0","0.0","0.0","0.0","0.0","0.0","N"
