ID,status,sentence,TP,FP,FN,sparqlQueGG,sparqlQald,TP,FP,FN,Precision,Recall,Fscore,Status
5,N,Wer ist der Buergermeister von New York City?,0,0,1,PREFIX dbo: <http://dbpedia.org/ontology/> PREFIX res: <http://dbpedia.org/resource/> SELECT DISTINCT ?uri WHERE { res:New_York_City dbo:leaderName ?uri },N,0,0,1,0,0,0,N
9,N,"Gib mir alle Schauspieler von Filmen, in denen William Shatner sowohl Regie gefuehrt als auch selber mitgespielt hat",0,0,12,PREFIX dbo: <http://dbpedia.org/ontology/> PREFIX res: <http://dbpedia.org/resource/> PREFIX dbp: <http://dbpedia.org/property/> SELECT DISTINCT ?uri WHERE { ?x dbo:director res:William_Shatner ; dbo:starring res:William_Shatner { ?x dbo:starring ?uri } UNION { ?x dbp:starring ?uri } },N,0,0,12,0,0,0,N
10,N,Was sind die Amtssprachen der Philippinen?,0,0,2,PREFIX dbo: <http://dbpedia.org/ontology/> PREFIX res: <http://dbpedia.org/resource/> SELECT DISTINCT ?uri WHERE { res:Philippines dbo:officialLanguage ?uri },N,0,0,2,0,0,0,N
13,WORK,Gib mir die Enkel von Bruce Lee,0,2,1,PREFIX dbo: <http://dbpedia.org/ontology/> PREFIX res: <http://dbpedia.org/resource/> SELECT DISTINCT ?uri WHERE { res:Bruce_Lee dbo:child ?child . ?child <http://dbpedia.org/property/children> ?uri },SELECT ?Answer WHERE { <http://dbpedia.org/resource/Marjorie_Bruce> <http://dbpedia.org/ontology/parent> ?Answer .},0,2,1,0,0,0,WORK
21,N,Wer schrieb das Buch Das Saeulen von das Erde? ,0,0,1,PREFIX dbo: <http://dbpedia.org/ontology/> PREFIX res: <http://dbpedia.org/resource/> PREFIX rdfs: <http://www.w3.org/2000/01/rdf-schema#> SELECT DISTINCT ?uri WHERE { res:The_Pillars_of_the_Earth dbo:author ?uri },N,0,0,1,0,0,0,N
22,N,Welche Zustand von das Vereinigt Zustaende von Amerika hat das hoechste Dichte? ,0,0,1,PREFIX yago: <http://dbpedia.org/class/yago/> PREFIX rdfs: <http://www.w3.org/2000/01/rdf-schema#> PREFIX dbp: <http://dbpedia.org/property/> PREFIX rdf: <http://www.w3.org/1999/02/22-rdf-syntax-ns#> SELECT ?uri WHERE { ?uri dbp:densityrank ?density } ORDER BY ASC(?density) LIMIT 1,N,0,0,1,0,0,0,N
23,N,Welche Raumfluege sind von Baikonur gestartet?,0,0,13,PREFIX dbo: <http://dbpedia.org/ontology/> PREFIX res: <http://dbpedia.org/resource/> SELECT DISTINCT ?uri WHERE { ?uri <http://dbpedia.org/property/launchPad> res:Baikonur_Cosmodrome },N,0,0,13,0,0,0,N
27,WORK,Mit wem ist die Tochter von Ingrid Bergman verheiratet?,0,2,0,PREFIX dbo: <http://dbpedia.org/ontology/> PREFIX res: <http://dbpedia.org/resource/> SELECT DISTINCT ?uri WHERE { res:Ingrid_Bergman dbo:child ?child . ?child <http://dbpedia.org/property/spouse> ?uri },SELECT ?Answer WHERE { <http://dbpedia.org/resource/Ingrid_Bergman> <http://dbpedia.org/ontology/child> ?Answer .},0,2,0,0,0,0,WORK
66,N,Wer ist der Gouverneur von Wyoming?,0,0,1,SELECT DISTINCT ?uri WHERE { <http://dbpedia.org/resource/Wyoming> <http://dbpedia.org/property/governor> ?uri },N,0,0,1,0,0,0,N
74,N,Wer war 1978 Praesident von Pakistan?,0,0,1,SELECT DISTINCT ?uri WHERE { ?uri <http://dbpedia.org/property/title> <http://dbpedia.org/resource/President_of_Pakistan> ; <http://dbpedia.org/property/years> 1978 },N,0,0,1,0,0,0,N
93,N,Was ist der Nettogewinn von Apple?,0,0,1,SELECT DISTINCT ?ni WHERE { <http://dbpedia.org/resource/Apple_Inc.> <http://dbpedia.org/ontology/netIncome> ?ni },N,0,0,1,0,0,0,N
119,N,Welche anderen Buecher wurden vom Autor von Der Fehler unserer Sterne geschrieben? ,0,0,6,PREFIX dbo: <http://dbpedia.org/ontology/> SELECT ?books WHERE { ?books dbo:author <http://dbpedia.org/resource/John_Green_(author)> },N,0,0,6,0,0,0,N
129,N,Wer hat Die Tribute von Panem geschrieben?,0,0,1,SELECT DISTINCT ?uri WHERE { <http://dbpedia.org/resource/The_Hunger_Games> <http://dbpedia.org/property/author> ?uri },N,0,0,1,0,0,0,N
132,N,Wo wohnt der Premierminister von Spanien?,0,0,1,SELECT DISTINCT ?uri WHERE { <http://dbpedia.org/resource/Prime_Minister_of_Spain> <http://dbpedia.org/property/residence> ?uri },N,0,0,1,0,0,0,N
141,N,Gib mir die Geburtstage von allen Darstellern der Fernsehserie Charmed,0,0,10,SELECT DISTINCT ?date WHERE { <http://dbpedia.org/resource/Charmed> <http://dbpedia.org/ontology/starring> ?actor . ?actor <http://dbpedia.org/ontology/birthDate> ?date },N,0,0,10,0,0,0,N
146,N,Wer ist der Manager von Real Madrid?,0,0,1,SELECT DISTINCT ?uri WHERE { <http://dbpedia.org/resource/Real_Madrid_C.F.> <http://dbpedia.org/ontology/manager> ?uri },N,0,0,1,0,0,0,N
151,N,Was ist der Geburtsname von Angela Merkel?,0,0,0,SELECT DISTINCT ?string WHERE { <http://dbpedia.org/resource/Angela_Merkel> <http://dbpedia.org/property/birthName> ?string },N,0,0,0,0,0,0,N
167,N,Welche Raketen sind von Baikonur gestartet?,0,0,38,SELECT DISTINCT ?uri WHERE { ?uri a <http://dbpedia.org/ontology/Rocket> ; <http://dbpedia.org/ontology/launchSite> <http://dbpedia.org/resource/Baikonur_Cosmodrome> },N,0,0,38,0,0,0,N
194,N,Was ist das Alma mater von das Kanzler von Deutschland Angela Merkel? ,0,0,1,PREFIX dbo: <http://dbpedia.org/ontology/> PREFIX dbr: <http://dbpedia.org/resource/> SELECT ?Almamater WHERE { dbr:Angela_Merkel dbo:almaMater ?Almamater },N,0,0,1,0,0,0,N
208,N,Wer ist der Trainer von Ankaras Eishockeymannschaft?,0,0,1,PREFIX dbo: <http://dbpedia.org/ontology/> PREFIX res: <http://dbpedia.org/resource/> SELECT DISTINCT ?uri WHERE { ?x dbo:city res:Ankara ; dbo:league res:Turkish_Ice_Hockey_First_League ; dbo:coach ?uri },N,0,0,1,0,0,0,N
209,N,Wie groß ist das Bereich von VEREINIGTES KÖNIGREICH? ,0,0,2,PREFIX dbo: <http://dbpedia.org/ontology/> PREFIX dbr: <http://dbpedia.org/resource/> SELECT ?area WHERE { dbr:United_Kingdom dbo:areaTotal ?area },N,0,0,2,0,0,0,N
216,N,Wie viel ist das Elevation von Duesseldorf Flughafen ? ,0,0,1,PREFIX dbo: <http://dbpedia.org/ontology/> PREFIX dbr: <http://dbpedia.org/resource/> SELECT ?ele WHERE { dbr:Düsseldorf_Airport dbo:elevation ?ele } LIMIT 1,N,0,0,1,0,0,0,N
217,N,Wie viel ist das Population von Mexiko Stadt ? ,0,0,1,PREFIX dbo: <http://dbpedia.org/ontology/> PREFIX dbr: <http://dbpedia.org/resource/> SELECT ?Mexico_City WHERE { dbr:Mexico_City dbo:populationTotal ?Mexico_City },N,0,0,1,0,0,0,N
218,N,wann war das Gruendung Datum von Franzoesisch fuenfte Republik? ,0,0,1,PREFIX dbo: <http://dbpedia.org/ontology/> PREFIX dbr: <http://dbpedia.org/resource/> SELECT ?ff WHERE { dbr:French_Fifth_Republic dbo:foundingDate ?ff },N,0,0,1,0,0,0,N
219,N,Wer war der erste Koenig von England?,0,0,0,PREFIX dbo: <http://dbpedia.org/ontology/> PREFIX yago: <http://dbpedia.org/class/yago/> PREFIX rdf: <http://www.w3.org/1999/02/22-rdf-syntax-ns#> SELECT DISTINCT ?uri WHERE { ?uri rdf:type dbo:Royalty ; rdf:type yago:WikicatEnglishMonarchs ; dbo:activeYearsStartYear ?date } ORDER BY ASC(?date) OFFSET 0 LIMIT 1,N,0,0,0,0,0,0,N
220,N,Wer ist der Herausgeber von Forbes?,0,0,1,PREFIX dbo: <http://dbpedia.org/ontology/> PREFIX res: <http://dbpedia.org/resource/> SELECT DISTINCT ?uri WHERE { res:Forbes dbo:editor ?uri },N,0,0,1,0,0,0,N
226,N,Wann war das letzte Folge von das Fernseher Serie Freunde ausgestrahlt? ,0,0,1,PREFIX dbo: <http://dbpedia.org/ontology/> PREFIX dbr: <http://dbpedia.org/resource/> SELECT ?date WHERE { dbr:Friends dbo:completionDate ?date },N,0,0,1,0,0,0,N
227,WORK,Heißt die Frau von Praesident Obama Michelle?,0,1,0,"PREFIX dbo: <http://dbpedia.org/ontology/> PREFIX res: <http://dbpedia.org/resource/> PREFIX rdfs: <http://www.w3.org/2000/01/rdf-schema#> ASK WHERE { res:Barack_Obama dbo:spouse ?spouse . ?spouse rdfs:label ?name FILTER regex(?name, ""Michelle"") }",SELECT ?Answer WHERE { <http://dbpedia.org/resource/Michelle_Obama> <http://dbpedia.org/ontology/spouse> ?Answer .},0,1,0,0,0,0,WORK
231,N,Gib mir alle von der NASA betriebenen Startrampen,0,0,7,PREFIX dbo: <http://dbpedia.org/ontology/> PREFIX res: <http://dbpedia.org/resource/> PREFIX rdf: <http://www.w3.org/1999/02/22-rdf-syntax-ns#> SELECT DISTINCT ?uri WHERE { ?uri rdf:type dbo:LaunchPad ; dbo:operator res:NASA },N,0,0,7,0,0,0,N
234,N,Was ist das Population von Kairo? ,0,0,1,PREFIX dbo: <http://dbpedia.org/ontology/> PREFIX dbr: <http://dbpedia.org/resource/> SELECT ?pop WHERE { dbr:Cairo dbo:populationTotal ?pop },N,0,0,1,0,0,0,N
238,N,Wer ist das Autor von das Deutung von Traeume? ,0,0,1,PREFIX dbo: <http://dbpedia.org/ontology/> PREFIX dbr: <http://dbpedia.org/resource/> SELECT ?Author WHERE { dbr:The_Interpretation_of_Dreams dbo:author ?Author },N,0,0,1,0,0,0,N
242,N,Woher ist das Ursprung von Carolina Sensenmann? ,0,0,1,PREFIX dbo: <http://dbpedia.org/ontology/>PREFIX dbr: <http://dbpedia.org/resource/> SELECT ?uri WHERE { dbr:Carolina_Reaper dbo:origin ?uri},N,0,0,1,0,0,0,N
245,WORK,Hieß die Frau von Praesident Lincoln Mary?,0,1,0,"PREFIX dbo: <http://dbpedia.org/ontology/> PREFIX res: <http://dbpedia.org/resource/> PREFIX rdfs: <http://www.w3.org/2000/01/rdf-schema#> ASK WHERE { res:Abraham_Lincoln dbo:spouse ?spouse . ?spouse rdfs:label ?name FILTER regex(?name, ""Mary"") }",SELECT ?Answer WHERE { <http://dbpedia.org/resource/Mary_Todd_Lincoln> <http://dbpedia.org/ontology/spouse> ?Answer .},0,1,0,0,0,0,WORK
249,N,Liste alle Musicals mit Musik von Elton John auf,0,0,5,PREFIX dbo: <http://dbpedia.org/ontology/> PREFIX res: <http://dbpedia.org/resource/> PREFIX rdf: <http://www.w3.org/1999/02/22-rdf-syntax-ns#> SELECT DISTINCT ?uri WHERE { ?uri rdf:type dbo:Musical ; dbo:musicBy res:Elton_John },N,0,0,5,0,0,0,N
254,WORK,Wer war die Frau von US-Praesident Lincoln?,0,2,1,PREFIX dbo: <http://dbpedia.org/ontology/> PREFIX res: <http://dbpedia.org/resource/> SELECT DISTINCT ?uri WHERE { res:Abraham_Lincoln dbo:spouse ?uri },SELECT ?Answer WHERE { <http://dbpedia.org/resource/Thomas_Lincoln> <http://dbpedia.org/ontology/spouse> ?Answer .},0,2,1,0,0,0,WORK
264,N,Wer war der Nachfolger von John F Kennedy?,0,0,3,PREFIX dbo: <http://dbpedia.org/ontology/> PREFIX res: <http://dbpedia.org/resource/> SELECT DISTINCT ?uri WHERE { res:John_F._Kennedy dbo:successor ?uri },N,0,0,3,0,0,0,N
265,N,Wer ist Buergermeister von Paris?,0,0,1,PREFIX dbo: <http://dbpedia.org/ontology/> PREFIX res: <http://dbpedia.org/resource/> SELECT DISTINCT ?uri WHERE { res:Paris dbo:mayor ?uri },N,0,0,1,0,0,0,N
271,N,Aus welchem Land kommt der Erfinder von Nijntje?,0,0,1,PREFIX dbo: <http://dbpedia.org/ontology/> PREFIX res: <http://dbpedia.org/resource/> SELECT DISTINCT ?uri WHERE { res:Miffy dbo:creator ?x . ?x dbo:nationality ?uri },N,0,0,1,0,0,0,N
275,N,Liste die Kinder von Margaret Thatcher auf,0,0,2,PREFIX dbo: <http://dbpedia.org/ontology/> PREFIX res: <http://dbpedia.org/resource/> SELECT DISTINCT ?uri WHERE { res:Margaret_Thatcher dbo:child ?uri },N,0,0,2,0,0,0,N
276,N,Aus welcher Region ist der Melon de Bourgogne?,0,0,4,PREFIX dbo: <http://dbpedia.org/ontology/> PREFIX res: <http://dbpedia.org/resource/> SELECT DISTINCT ?uri WHERE { res:Melon_de_Bourgogne dbo:wineRegion ?uri },N,0,0,4,0,0,0,N
278,N,Wie groß ist das gesamt Bereich von Norden Rhein- Westfalen? ,0,0,1,PREFIX dbo: <http://dbpedia.org/ontology/> PREFIX dbr: <http://dbpedia.org/resource/> SELECT ?tarea WHERE { dbr:North_Rhine-Westphalia dbo:areaTotal ?tarea },N,0,0,1,0,0,0,N
281,N,Wann werden Anfang das Finale Spiel von das Fußball Welt Tasse 2018? ,0,0,1,PREFIX dbr: <http://dbpedia.org/resource/> PREFIX dbp: <http://dbpedia.org/property/> SELECT ?Date WHERE { dbr:2018_FIFA_World_Cup dbp:date ?Date } ORDER BY DESC(?Date) LIMIT 1,N,0,0,1,0,0,0,N
286,N,"Gib mir alle Schauspieler von Filmen, in denen William Shatner Regie gefuehrt hat",0,0,18,PREFIX dbo: <http://dbpedia.org/ontology/> PREFIX res: <http://dbpedia.org/resource/> SELECT DISTINCT ?uri WHERE { ?x dbo:director res:William_Shatner ; dbo:starring ?uri },N,0,0,18,0,0,0,N
288,N,Wie viel ist das Population Dichte Rang von Deutschland? ,0,0,1,PREFIX dbr: <http://dbpedia.org/resource/> PREFIX dbp: <http://dbpedia.org/property/> SELECT ?rank WHERE { dbr:Germany dbp:populationDensityRank ?rank },N,0,0,1,0,0,0,N
291,N,Was ist die Amtssprache Von Surinam?,0,0,1,PREFIX dbo: <http://dbpedia.org/ontology/> PREFIX res: <http://dbpedia.org/resource/> SELECT DISTINCT ?uri WHERE { res:Suriname dbo:officialLanguage ?uri },N,0,0,1,0,0,0,N
296,N,Gib mir alle Bandmitglieder von Prodigy,0,0,3,PREFIX dbo: <http://dbpedia.org/ontology/> PREFIX res: <http://dbpedia.org/resource/> SELECT DISTINCT ?uri WHERE { res:The_Prodigy dbo:bandMember ?uri },N,0,0,3,0,0,0,N
299,N,Wer sind das Schriftsteller von das Mauer Album von Rosa Floyd? ,0,0,0,PREFIX dbr: <http://dbpedia.org/resource/> PREFIX dbp: <http://dbpedia.org/property/> SELECT ?writers WHERE { dbr:The_Wall dbp:writer ?writers },N,0,0,0,0,0,0,N
300,N,Wer ist der Buergermeister von Rotterdam?,0,0,1,PREFIX dbo: <http://dbpedia.org/ontology/> PREFIX res: <http://dbpedia.org/resource/> SELECT DISTINCT ?uri WHERE { res:Rotterdam dbo:leaderName ?uri },N,0,0,1,0,0,0,N
310,N,Welcher Partei gehoert die Buergermeisterin von Paris an?,0,0,1,PREFIX dbo: <http://dbpedia.org/ontology/> PREFIX res: <http://dbpedia.org/resource/> SELECT DISTINCT ?uri WHERE { res:Paris dbo:mayor ?x . ?x dbo:party ?uri },N,0,0,1,0,0,0,N
313,N,Gib mir den Geburtsort von Frank Sinatra,0,0,1,PREFIX dbo: <http://dbpedia.org/ontology/> PREFIX res: <http://dbpedia.org/resource/> SELECT DISTINCT ?place WHERE { res:Frank_Sinatra dbo:birthPlace ?place },N,0,0,1,0,0,0,N
315,N,Wer ist der Sohn von Sonny und Cher?,0,0,1,PREFIX dbo: <http://dbpedia.org/ontology/> PREFIX res: <http://dbpedia.org/resource/> SELECT DISTINCT ?uri WHERE { ?uri dbo:parent res:Cher ; dbo:parent res:Sonny_Bono },N,0,0,1,0,0,0,N
320,N,Wer ist das aelteste Kind von Meryl Streep?,0,0,1,PREFIX dbo: <http://dbpedia.org/ontology/> PREFIX res: <http://dbpedia.org/resource/> SELECT DISTINCT ?uri WHERE { res:Meryl_Streep dbo:child ?uri . ?uri dbo:birthDate ?d } ORDER BY ASC(?d) OFFSET 0 LIMIT 1,N,0,0,1,0,0,0,N
337,N,Wer war der Doktorvater von Albert Einstein?,0,0,1,PREFIX dbo: <http://dbpedia.org/ontology/> PREFIX res: <http://dbpedia.org/resource/> SELECT DISTINCT ?uri WHERE { res:Albert_Einstein dbo:doctoralAdvisor ?uri },N,0,0,1,0,0,0,N
367,WORK,Gib mir die Enkel von Elvis Presley,0,2,1,PREFIX dbo: <http://dbpedia.org/ontology/> PREFIX res: <http://dbpedia.org/resource/> SELECT DISTINCT ?uri WHERE { res:Elvis_Presley dbo:child ?child . ?child dbo:child ?uri },SELECT ?Answer WHERE { <http://dbpedia.org/resource/Lisa_Marie_Presley> <http://dbpedia.org/ontology/parent> ?Answer .},0,2,1,0,0,0,WORK
371,WORK,Gib mir alle Buecher von William Goldman mit mehr als 300 Seiten,0,1,10,PREFIX dbo: <http://dbpedia.org/ontology/> PREFIX res: <http://dbpedia.org/resource/> PREFIX rdf: <http://www.w3.org/1999/02/22-rdf-syntax-ns#> SELECT DISTINCT ?uri WHERE { ?uri rdf:type dbo:Book ; dbo:author res:William_Goldman ; dbo:numberOfPages ?x FILTER ( ?x > 300 ) },SELECT ?Answer WHERE { <http://dbpedia.org/resource/Still_William> <http://dbpedia.org/ontology/author> ?Answer .},0,1,10,0,0,0,WORK
378,N,Welche Buecher von Kerouac wurden von Viking Press verlegt?,0,0,3,PREFIX dbo: <http://dbpedia.org/ontology/> PREFIX res: <http://dbpedia.org/resource/> PREFIX rdf: <http://www.w3.org/1999/02/22-rdf-syntax-ns#> SELECT DISTINCT ?uri WHERE { ?uri rdf:type dbo:Book ; dbo:publisher res:Viking_Press ; dbo:author res:Jack_Kerouac },N,0,0,3,0,0,0,N
380,N,Was ist die Hauptstadt von Kanada?,0,0,1,PREFIX dbo: <http://dbpedia.org/ontology/> PREFIX res: <http://dbpedia.org/resource/> SELECT DISTINCT ?uri WHERE { res:Canada dbo:capital ?uri },N,0,0,1,0,0,0,N
381,N,Wer ist der Buergermeister von Tel Aviv?,0,0,1,PREFIX dbo: <http://dbpedia.org/ontology/> PREFIX res: <http://dbpedia.org/resource/> SELECT DISTINCT ?uri WHERE { res:Tel_Aviv dbo:leaderName ?uri },N,0,0,1,0,0,0,N
393,N,Was sind die fuenf Stadtteile von New York?,0,0,5,PREFIX dbo: <http://dbpedia.org/ontology/> SELECT DISTINCT ?uri WHERE { ?uri dbo:governmentType <http://dbpedia.org/resource/Borough_(New_York_City)> },N,0,0,5,0,0,0,N
398,N,Wer ist der Praesident von Eritrea?,0,0,1,"PREFIX dbo: <http://dbpedia.org/ontology/> PREFIX res: <http://dbpedia.org/resource/> SELECT DISTINCT ?uri WHERE { res:Eritrea dbo:leader ?uri ; dbo:leaderTitle ""President""@en }",N,0,0,1,0,0,0,N
407,N,Welcher von Tim Burtons Filmen hatte das hoechste Budget?,0,0,1,PREFIX dbo: <http://dbpedia.org/ontology/> PREFIX res: <http://dbpedia.org/resource/> SELECT DISTINCT ?uri WHERE { ?uri dbo:director res:Tim_Burton ; dbo:budget ?b } ORDER BY ?b OFFSET 0 LIMIT 1,N,0,0,1,0,0,0,N
