ID,status,sentence,TP,FP,FN,sparqlQueGG,sparqlQald,TP,FP,FN,Precision,Recall,Fscore,Status
13,N,Give me the grandchildren of Bruce Lee.,0,0,1,PREFIX dbo: <http://dbpedia.org/ontology/> PREFIX res: <http://dbpedia.org/resource/> SELECT DISTINCT ?uri WHERE { res:Bruce_Lee dbo:child ?child . ?child <http://dbpedia.org/property/children> ?uri },N,0,0,1,0,0,0,N
14,WORK,Which other weapons did the designer of the Uzi develop?,0,3,1,PREFIX dbo: <http://dbpedia.org/ontology/> PREFIX res: <http://dbpedia.org/resource/> PREFIX dbp: <http://dbpedia.org/property/> PREFIX rdf: <http://www.w3.org/1999/02/22-rdf-syntax-ns#> SELECT DISTINCT ?uri WHERE { ?uri rdf:type dbo:Weapon ; dbp:designer ?x . res:Uzi dbp:designer ?x FILTER ( ?uri != res:Uzi ) },SELECT ?Answer WHERE { <http://dbpedia.org/resource/Yvon_of_the_Yukon> <http://dbpedia.org/ontology/developer> ?Answer .},0,3,1,0,0,0,WORK
17,WORK,Which monarchs were married to a German?,0,0,1,PREFIX dbo: <http://dbpedia.org/ontology/> PREFIX res: <http://dbpedia.org/resource/> PREFIX rdf: <http://www.w3.org/1999/02/22-rdf-syntax-ns#> SELECT DISTINCT ?uri WHERE { ?uri rdf:type dbo:Monarch ; dbo:spouse ?spouse { ?spouse dbo:birthPlace res:Germany } UNION { ?spouse dbo:birthPlace ?p . ?p dbo:country res:Germany } },SELECT ?Answer WHERE { ?Answer <http://www.w3.org/1999/02/22-rdf-syntax-ns#type>   <http://dbpedia.org/ontology/Monarch>. ?Answer <http://dbpedia.org/ontology/spouse> <http://dbpedia.org/resource/Mike_German> .},0,0,1,0,0,0,WORK
24,N,Give me a list of all trumpet players that were bandleaders.,0,0,46,PREFIX dbo: <http://dbpedia.org/ontology/> PREFIX res: <http://dbpedia.org/resource/> SELECT DISTINCT ?uri WHERE { ?uri dbo:occupation res:Bandleader ; dbo:instrument res:Trumpet },N,0,0,46,0,0,0,N
27,WORK,Who is the daughter of Ingrid Bergman married to?,0,2,0,PREFIX dbo: <http://dbpedia.org/ontology/> PREFIX res: <http://dbpedia.org/resource/> SELECT DISTINCT ?uri WHERE { res:Ingrid_Bergman dbo:child ?child . ?child <http://dbpedia.org/property/spouse> ?uri },SELECT ?Answer WHERE { <http://dbpedia.org/resource/Ingrid_Bergman> <http://dbpedia.org/ontology/child> ?Answer .},0,2,0,0,0,0,WORK
29,WORK,Show me all museums in London.,0,1,81,SELECT DISTINCT ?uri WHERE { ?uri a <http://dbpedia.org/ontology/Museum> ; <http://dbpedia.org/ontology/location> <http://dbpedia.org/resource/London> },SELECT ?Answer WHERE { <http://dbpedia.org/resource/Westfield_London> <http://dbpedia.org/ontology/location> ?Answer .},0,1,81,0,0,0,WORK
42,WORK,Give me all Swiss non-profit organizations.,0,0,1,SELECT DISTINCT ?uri WHERE { ?uri <http://dbpedia.org/ontology/type> <http://dbpedia.org/resource/Nonprofit_organization> { ?uri <http://dbpedia.org/ontology/location> <http://dbpedia.org/resource/Switzerland> } UNION { ?uri <http://dbpedia.org/ontology/location> ?x . ?x <http://dbpedia.org/ontology/country> <http://dbpedia.org/resource/Switzerland> } },SELECT DISTINCT ?Answer WHERE { ?Answer <http://www.w3.org/1999/02/22-rdf-syntax-ns#type> <http://dbpedia.org/resource/Nonprofit_organization> ; <http://dbpedia.org/ontology/country> <http://dbpedia.org/resource/Switzerland> },0,0,1,0,0,0,WORK
45,N,Where do the Red Sox play?,0,0,1,SELECT DISTINCT ?uri WHERE { <http://dbpedia.org/resource/Boston_Red_Sox> <http://dbpedia.org/property/ballpark> ?uri },N,0,0,1,0,0,0,N
50,N,How many films did Hal Roach produce?,0,0,1,SELECT (COUNT(DISTINCT ?uri) AS ?c) WHERE { ?uri <http://dbpedia.org/ontology/producer> <http://dbpedia.org/resource/Hal_Roach> },N,0,0,1,0,0,0,N
52,N,What is the most frequent cause of death?,0,0,0,SELECT DISTINCT ?x WHERE { ?uri <http://dbpedia.org/ontology/deathCause> ?x . } ORDER BY DESC(COUNT(DISTINCT ?uri)) OFFSET 0 LIMIT 1,N,0,0,0,0,0,0,N
55,WORK,Give me the capitals of all countries that the Himalayas run through.,0,1,1,SELECT DISTINCT ?uri WHERE { <http://dbpedia.org/resource/Himalayas> <http://dbpedia.org/ontology/country> ?country . ?country <http://dbpedia.org/ontology/capital> ?uri },SELECT ?Answer WHERE { <http://dbpedia.org/resource/Voice_of_Music> <http://dbpedia.org/ontology/foundationPlace> ?Answer .},0,1,1,0,0,0,WORK
56,N,How many movies did Park Chan-wook direct?,0,0,0,SELECT COUNT(DISTINCT ?uri AS ?uri) WHERE { ?uri <http://dbpedia.org/ontology/director> <http://dbpedia.org/resource/Park_Chan-wook> . },N,0,0,0,0,0,0,N
57,WORK,Which rivers flow into a German lake?,0,1,105,SELECT DISTINCT ?uri WHERE { ?uri a <http://dbpedia.org/ontology/River> . ?x <http://dbpedia.org/ontology/inflow> ?uri ; a <http://dbpedia.org/ontology/Lake> ; <http://dbpedia.org/ontology/country> <http://dbpedia.org/resource/Germany> },SELECT ?Answer WHERE { ?Answer <http://www.w3.org/1999/02/22-rdf-syntax-ns#type>   <http://dbpedia.org/ontology/River>. <http://dbpedia.org/resource/?üa?Âskie_Lake> <http://dbpedia.org/ontology/inflow> ?Answer .},0,1,105,0,0,0,WORK
59,N,Give me all islands that belong to Japan.,0,0,88,SELECT DISTINCT ?uri WHERE { ?uri a <http://dbpedia.org/ontology/Island> ; <http://dbpedia.org/ontology/country> <http://dbpedia.org/resource/Japan> },N,0,0,88,0,0,0,N
60,N,How many inhabitants does Maribor have?,0,0,1,SELECT DISTINCT ?num WHERE { <http://dbpedia.org/resource/Maribor> <http://dbpedia.org/ontology/populationTotal> ?num },N,0,0,1,0,0,0,N
63,WORK,In which films directed by Garry Marshall was Julia Roberts starring?,0,2,3,SELECT DISTINCT ?uri WHERE { ?uri a <http://dbpedia.org/ontology/Film> ; <http://dbpedia.org/ontology/starring> <http://dbpedia.org/resource/Julia_Roberts> ; <http://dbpedia.org/ontology/director> <http://dbpedia.org/resource/Garry_Marshall> },SELECT ?Answer WHERE { <http://dbpedia.org/resource/Julia_Julia> <http://dbpedia.org/ontology/director> ?Answer .},0,2,3,0,0,0,WORK
64,WORK,Give me all soccer clubs in the Premier League.,0,1,264,SELECT DISTINCT ?uri WHERE { ?uri a <http://dbpedia.org/ontology/SoccerClub> ; <http://dbpedia.org/ontology/league> <http://dbpedia.org/resource/Premier_League> },SELECT ?Answer WHERE { <http://dbpedia.org/resource/Saltillo_Soccer> <http://dbpedia.org/ontology/ground> ?Answer .},0,1,264,0,0,0,WORK
69,WORK,Give me all actors who were born in Paris after 1950.,0,107,0,SELECT DISTINCT ?uri WHERE { ?uri <http://www.w3.org/1999/02/22-rdf-syntax-ns#type> <http://dbpedia.org/ontology/Actor> . ?uri <http://dbpedia.org/ontology/birthPlace> <http://dbpedia.org/resource/Paris> . ?uri <http://dbpedia.org/ontology/birthDate> ?date . FILTER ( ?date >= xsd:dateTime('1950-12-31T00:00:00Z')) },SELECT ?Answer WHERE { ?Answer <http://www.w3.org/1999/02/22-rdf-syntax-ns#type>   <http://dbpedia.org/ontology/Actor>. ?Answer <http://dbpedia.org/ontology/birthPlace> <http://dbpedia.org/resource/Paris> .},0,107,0,0,0,0,WORK
70,WORK,Which movies star both Liz Taylor and Richard Burton?,0,0,11,SELECT DISTINCT ?uri WHERE { ?uri <http://dbpedia.org/ontology/starring> <http://dbpedia.org/resource/Elizabeth_Taylor> ; <http://dbpedia.org/ontology/starring> <http://dbpedia.org/resource/Richard_Burton> },SELECT ?Answer WHERE { ?Answer <http://www.w3.org/1999/02/22-rdf-syntax-ns#type>   <http://dbpedia.org/ontology/Film>. <http://dbpedia.org/resource/Burton_&_Taylor> <http://dbpedia.org/ontology/starring> ?Answer .},0,0,11,0,0,0,WORK
71,WORK,Give me all Australian nonprofit organizations.,0,0,1,SELECT DISTINCT ?uri WHERE { ?uri <http://dbpedia.org/ontology/type> <http://dbpedia.org/resource/Nonprofit_organization> { ?uri <http://dbpedia.org/ontology/locationCountry> <http://dbpedia.org/resource/Australia> } UNION { ?uri <http://dbpedia.org/ontology/location> ?x . ?x <http://dbpedia.org/ontology/country> <http://dbpedia.org/resource/Australia> } },SELECT DISTINCT ?Answer WHERE { ?Answer <http://www.w3.org/1999/02/22-rdf-syntax-ns#type> <http://dbpedia.org/resource/Nonprofit_organization> ; <http://dbpedia.org/ontology/hometown> <http://dbpedia.org/resource/Australia> },0,0,1,0,0,0,WORK
73,N,Give me all ESA astronauts.,0,0,1,SELECT DISTINCT ?uri WHERE { ?uri a <http://dbpedia.org/ontology/Astronaut> ; <http://dbpedia.org/property/type> <http://dbpedia.org/resource/European_Space_Agency> },N,0,0,1,0,0,0,N
75,N,Who is the owner of Rolls-Royce?,0,0,2,SELECT DISTINCT ?uri WHERE { <http://dbpedia.org/resource/Rolls-Royce_Motors> <http://dbpedia.org/ontology/owner> ?uri },N,0,0,2,0,0,0,N
77,N,Where was JFK assassinated?,0,0,1,SELECT DISTINCT ?uri WHERE { <http://dbpedia.org/resource/John_F._Kennedy> <http://dbpedia.org/ontology/deathPlace> ?uri },N,0,0,1,0,0,0,N
81,N,To which countries does the Himalayan mountain system extend?,0,0,1,SELECT DISTINCT ?uri WHERE { <http://dbpedia.org/resource/Himalayas> <http://dbpedia.org/ontology/country> ?uri },N,0,0,1,0,0,0,N
83,N,How much carbs does peanut butter have?,0,0,1,SELECT DISTINCT ?carbs WHERE { <http://dbpedia.org/resource/Peanut_butter> <http://dbpedia.org/property/carbs> ?carbs },N,0,0,1,0,0,0,N
84,WORK,Who produced the most films?,0,1,0,SELECT DISTINCT ?uri WHERE { ?film <http://www.w3.org/1999/02/22-rdf-syntax-ns#type> <http://dbpedia.org/ontology/Film> . ?film <http://dbpedia.org/ontology/producer> ?uri . } ORDER BY DESC(COUNT(?film)) OFFSET 0 LIMIT 1,SELECT ?Answer WHERE { <http://dbpedia.org/resource/Music_for_Films> <http://dbpedia.org/ontology/producer> ?Answer .},0,1,0,0,0,0,WORK
85,N,How many employees does Google have?,0,0,1,SELECT DISTINCT ?num WHERE { <http://dbpedia.org/resource/Google> <http://dbpedia.org/ontology/numberOfEmployees> ?num },N,0,0,1,0,0,0,N
88,N,Which music albums contain the song Last Christmas?,0,0,0,"SELECT DISTINCT ?uri WHERE { ?single <http://dbpedia.org/ontology/album> ?uri ; <http://www.w3.org/2000/01/rdf-schema#label> ""Last Christmas""@en }",N,0,0,0,0,0,0,N
89,N,When was Alberta admitted as province?,0,0,1,SELECT DISTINCT ?date WHERE { <http://dbpedia.org/resource/Alberta> <http://dbpedia.org/property/admittancedate> ?date },N,0,0,1,0,0,0,N
91,WORK,Give me all the TV shows with Neil Patrick Harris.,0,1,12,SELECT DISTINCT ?uri WHERE { ?uri a <http://dbpedia.org/ontology/TelevisionShow> ; <http://dbpedia.org/ontology/starring> <http://dbpedia.org/resource/Neil_Patrick_Harris> },SELECT ?Answer WHERE { <http://dbpedia.org/resource/Walk_the_Walk> <http://dbpedia.org/ontology/starring> ?Answer .},0,1,12,0,0,0,WORK
94,N,Give me all Swedish holidays.,0,0,4,SELECT DISTINCT ?uri WHERE { ?uri a <http://dbpedia.org/ontology/Holiday> ; <http://dbpedia.org/ontology/country> <http://dbpedia.org/resource/Sweden> },N,0,0,4,0,0,0,N
95,N,In which city was the former Dutch queen Juliana buried?,0,0,1,SELECT DISTINCT ?uri WHERE { <http://dbpedia.org/resource/Juliana_of_the_Netherlands> <http://dbpedia.org/property/burialPlace> ?uri . ?uri a <http://dbpedia.org/ontology/Settlement> },N,0,0,1,0,0,0,N
96,N,List all the musicals with music by Leonard Bernstein.,0,0,8,SELECT DISTINCT ?uri WHERE { ?uri a <http://dbpedia.org/ontology/Musical> ; <http://dbpedia.org/ontology/musicBy> <http://dbpedia.org/resource/Leonard_Bernstein> },N,0,0,8,0,0,0,N
97,WORK,Give me all companies in the advertising industry.,0,1,1,"SELECT (COUNT(DISTINCT ?uri) AS ?c) WHERE { ?uri a <http://dbpedia.org/ontology/Company> { ?uri <http://dbpedia.org/ontology/industry> <http://dbpedia.org/resource/Advertising> } UNION { ?uri <http://dbpedia.org/ontology/industry> ?industry FILTER regex(?industry, ""advertising"", ""i"") } }",SELECT ?Answer WHERE { <http://dbpedia.org/resource/Veidekke_Industry> <http://dbpedia.org/ontology/industry> ?Answer .},0,1,1,0,0,0,WORK
100,N,Which writers studied in Istanbul?,0,0,12,SELECT DISTINCT ?uri WHERE { ?uri a <http://dbpedia.org/ontology/Writer> { ?uri <http://dbpedia.org/ontology/almaMater> ?x } UNION { ?uri <http://dbpedia.org/ontology/education> ?x } { ?x <http://dbpedia.org/ontology/city> <http://dbpedia.org/resource/Istanbul> } UNION { ?x <http://dbpedia.org/property/city> <http://dbpedia.org/resource/Istanbul> } },N,0,0,12,0,0,0,N
103,N,Give me all types of eating disorders.,0,0,0,SELECT DISTINCT ?uri WHERE { ?uri a <http://dbpedia.org/class/yago/WikicatEatingDisorders> },N,0,0,0,0,0,0,N
106,N,How many films did Leonardo DiCaprio star in?,0,0,1,SELECT (COUNT(DISTINCT ?uri) AS ?c) WHERE { ?uri a <http://dbpedia.org/ontology/Film> ; <http://dbpedia.org/ontology/starring> <http://dbpedia.org/resource/Leonardo_DiCaprio> },N,0,0,1,0,0,0,N
107,N,Was Margaret Thatcher a chemist?,0,0,0,ASK WHERE { <http://dbpedia.org/resource/Margaret_Thatcher> <http://dbpedia.org/ontology/profession> <http://dbpedia.org/resource/Chemist> },N,0,0,0,0,0,0,N
110,N,Which country has the most official languages?,0,0,0,SELECT DISTINCT ?uri WHERE { ?uri <http://www.w3.org/1999/02/22-rdf-syntax-ns#type> <http://dbpedia.org/ontology/Country> . ?uri <http://dbpedia.org/property/officialLanguages> ?language . } ORDER BY DESC(COUNT(?language)) OFFSET 0 LIMIT 1,N,0,0,0,0,0,0,N
113,N,Give me all libraries established earlier than 1400.,0,0,12,SELECT DISTINCT ?uri WHERE { ?uri a <http://dbpedia.org/ontology/Library> ; <http://dbpedia.org/property/established> ?year FILTER ( ?year < 1400 ) },N,0,0,12,0,0,0,N
115,N,In which U.S. state is Mount McKinley located?,0,0,0,SELECT DISTINCT ?uri WHERE { <http://dbpedia.org/resource/Mount_McKinley> dbo:wikiPageRedirects ?x . ?x <http://dbpedia.org/ontology/locatedInArea> ?uri. ?uri rdf:type yago:WikicatStatesOfTheUnitedStates },N,0,0,0,0,0,0,N
117,N,Which ships were called after Benjamin Franklin?,0,0,5,SELECT DISTINCT ?uri WHERE { ?uri <http://dbpedia.org/property/shipNamesake> <http://dbpedia.org/resource/Benjamin_Franklin> },N,0,0,5,0,0,0,N
118,WORK,Give me all Methodist politicians.,0,0,86,SELECT DISTINCT ?uri WHERE { ?uri a <http://dbpedia.org/ontology/Politician> ; <http://dbpedia.org/ontology/religion> <http://dbpedia.org/resource/Methodism> },SELECT DISTINCT ?Answer WHERE { ?uri a <http://dbpedia.org/ontology/Politician> ; <http://dbpedia.org/ontology/religion> <http://dbpedia.org/resource/Methodism> },0,0,86,0,0,0,WORK
120,N,What is the highest mountain?,0,0,1,SELECT DISTINCT ?uri WHERE { ?uri a <http://dbpedia.org/ontology/Mountain> ; <http://dbpedia.org/ontology/elevation> ?elevation } ORDER BY DESC(?elevation) OFFSET 0 LIMIT 1,N,0,0,1,0,0,0,N
121,WORK,Which poet wrote the most books?,0,0,0,SELECT DISTINCT ?uri WHERE { ?uri <http://dbpedia.org/ontology/occupation> <http://dbpedia.org/resource/Poet> . ?x <http://dbpedia.org/ontology/author> ?uri . ?x <http://www.w3.org/1999/02/22-rdf-syntax-ns#type> <http://dbpedia.org/ontology/Book> . } ORDER BY DESC(COUNT(?x)) OFFSET 0 LIMIT 1,SELECT ?Answer WHERE { ?Answer <http://www.w3.org/1999/02/22-rdf-syntax-ns#type>   <http://dbpedia.org/ontology/Poet>. <http://dbpedia.org/resource/Doing_the_Most> <http://dbpedia.org/property/writer> ?Answer .},0,0,0,0,0,0,WORK
124,WORK,Which films starring Clint Eastwood did he direct himself?,0,1,10,SELECT DISTINCT ?uri WHERE { ?uri <http://dbpedia.org/ontology/director> <http://dbpedia.org/resource/Clint_Eastwood> ; <http://dbpedia.org/ontology/starring> <http://dbpedia.org/resource/Clint_Eastwood> },SELECT ?Answer WHERE { <http://dbpedia.org/resource/Bill_Cosby:_Himself> <http://dbpedia.org/ontology/director> ?Answer .},0,1,10,0,0,0,WORK
127,N,How many airlines are members of the Star Alliance?,0,0,1,SELECT (COUNT(DISTINCT ?uri) AS ?c) WHERE { ?uri a <http://dbpedia.org/ontology/Airline> ; <http://dbpedia.org/ontology/alliance> <http://dbpedia.org/resource/Star_Alliance> },N,0,0,1,0,0,0,N
131,N,Is Christian Bale starring in Batman Begins?,0,0,0,PREFIX dbo: <http://dbpedia.org/ontology/> PREFIX res: <http://dbpedia.org/resource/> ASK WHERE { res:Batman_Begins dbo:starring res:Christian_Bale },N,0,0,0,0,0,0,N
138,N,When did Latvia join the EU?,0,0,1,SELECT DISTINCT ?date WHERE { <http://dbpedia.org/resource/Latvia> <http://dbpedia.org/property/accessioneudate> ?date },N,0,0,1,0,0,0,N
140,N,How many politicians graduated from Columbia University?,0,0,1,SELECT (COUNT(DISTINCT ?uri) AS ?c) WHERE { ?uri <http://dbpedia.org/ontology/profession> <http://dbpedia.org/resource/Politician> ; <http://dbpedia.org/ontology/almaMater> <http://dbpedia.org/resource/Columbia_University> },N,0,0,1,0,0,0,N
141,WORK,Give me the birthdays of all actors of the television show Charmed.,0,1,10,SELECT DISTINCT ?date WHERE { <http://dbpedia.org/resource/Charmed> <http://dbpedia.org/ontology/starring> ?actor . ?actor <http://dbpedia.org/ontology/birthDate> ?date },SELECT ?Answer WHERE { <http://dbpedia.org/resource/Wolfgang_of_the_Palatinate> <http://dbpedia.org/ontology/birthDate> ?Answer .},0,1,10,0,0,0,WORK
143,N,Give me a list of all lakes in Denmark.,0,0,8,SELECT DISTINCT ?uri WHERE { { ?uri a <http://dbpedia.org/ontology/Lake> ; <http://dbpedia.org/ontology/country> <http://dbpedia.org/resource/Denmark> } UNION { ?uri a <http://dbpedia.org/class/yago/LakesOfDenmark> } },N,0,0,8,0,0,0,N
147,WORK,In which countries can you pay using the West African CFA franc?,0,1,15,SELECT DISTINCT ?uri WHERE { ?uri <http://dbpedia.org/ontology/currency> <http://dbpedia.org/resource/West_African_CFA_franc> },SELECT ?Answer WHERE { <http://dbpedia.org/resource/Jordanian_occupation_of_the_West_Bank> <http://dbpedia.org/ontology/currency> ?Answer .},0,1,15,0,0,0,WORK
148,N,Which holidays are celebrated around the world?,0,0,2184,PREFIX dbo: <http://dbpedia.org/ontology/> PREFIX rdf: <http://www.w3.org/1999/02/22-rdf-syntax-ns#> SELECT DISTINCT ?uri WHERE { ?uri rdf:type dbo:Holiday },N,0,0,2184,0,0,0,N
149,N,What is the longest river?,0,0,1,SELECT DISTINCT ?uri WHERE { ?uri a <http://dbpedia.org/ontology/River> { ?uri <http://dbpedia.org/ontology/length> ?l } UNION { ?uri <http://dbpedia.org/property/length> ?l } } ORDER BY DESC(?l) OFFSET 0 LIMIT 1,N,0,0,1,0,0,0,N
151,N,What is the birth name of Angela Merkel?,0,0,0,SELECT DISTINCT ?string WHERE { <http://dbpedia.org/resource/Angela_Merkel> <http://dbpedia.org/property/birthName> ?string },N,0,0,0,0,0,0,N
152,N,Who has Tom Cruise been married to?,0,0,3,SELECT DISTINCT ?uri WHERE { ?uri <http://dbpedia.org/ontology/spouse> <http://dbpedia.org/resource/Tom_Cruise> },N,0,0,3,0,0,0,N
153,N,Which weapons did Heckler & Koch develop?,0,0,13,SELECT DISTINCT ?uri WHERE { ?uri a <http://dbpedia.org/ontology/Weapon> ; <http://dbpedia.org/property/designer> <http://dbpedia.org/resource/Heckler_&_Koch> },N,0,0,13,0,0,0,N
154,N,What is the smallest city by area in Germany?,0,0,0,PREFIX dbo: <http://dbpedia.org/ontology/> PREFIX skos: <http://www.w3.org/2004/02/skos/core#> PREFIX dbc: <http://dbpedia.org/resource/Category:> PREFIX dct: <http://purl.org/dc/terms/> SELECT ?city WHERE { ?m skos:broader dbc:Cities_in_Germany . ?city dct:subject ?m ; dbo:areaTotal ?area } ORDER BY ?area LIMIT 1,N,0,0,0,0,0,0,N
156,N,How heavy is Jupiter's lightest moon?,0,0,1,SELECT DISTINCT ?n WHERE { ?uri <http://dbpedia.org/property/satelliteOf> <http://dbpedia.org/resource/Jupiter> ; <http://dbpedia.org/ontology/mass> ?n } ORDER BY ASC(?n) OFFSET 0 LIMIT 1,N,0,0,1,0,0,0,N
157,N,How many employees does IBM have?,0,0,1,SELECT DISTINCT ?number WHERE { <http://dbpedia.org/resource/IBM> <http://dbpedia.org/ontology/numberOfEmployees> ?number },N,0,0,1,0,0,0,N
158,WORK,List all episodes of the first season of the HBO television series The Sopranos!,0,1,0,PREFIX dbo: <http://dbpedia.org/ontology/> PREFIX res: <http://dbpedia.org/resource/> SELECT DISTINCT ?uri WHERE { ?uri dbo:series res:The_Sopranos ; dbo:seasonNumber 1 },SELECT ?Answer WHERE { <http://dbpedia.org/resource/The_Sopranos_(episode)> <http://dbpedia.org/ontology/seasonNumber> ?Answer .},0,1,0,0,0,0,WORK
159,N,What does ICRO stand for?,0,0,1,"SELECT DISTINCT ?uri WHERE { ?uri <http://dbpedia.org/ontology/abbreviation> ""ICRO"" }",N,0,0,1,0,0,0,N
161,WORK,Give me all films produced by Hal Roach.,0,1,528,SELECT DISTINCT ?uri WHERE { ?uri a <http://dbpedia.org/ontology/Film> ; <http://dbpedia.org/ontology/producer> <http://dbpedia.org/resource/Hal_Roach> },SELECT ?Answer WHERE { <http://dbpedia.org/resource/Shallow_Hal> <http://dbpedia.org/ontology/director> ?Answer .},0,1,528,0,0,0,WORK
162,WORK,Who played Agent Smith in Matrix?,0,1,2,PREFIX res: <http://dbpedia.org/resource/> PREFIX dbp: <http://dbpedia.org/property/> SELECT DISTINCT ?uri WHERE { res:Agent_Smith <http://dbpedia.org/ontology/portrayer> ?uri },SELECT ?Answer WHERE { <http://dbpedia.org/resource/Wilbur_Smith> <http://dbpedia.org/ontology/genre> ?Answer .},0,1,2,0,0,0,WORK
164,N,Give me a list of all bandleaders that play trumpet.,0,0,46,SELECT DISTINCT ?uri WHERE { ?uri <http://dbpedia.org/ontology/occupation> <http://dbpedia.org/resource/Bandleader> ; <http://dbpedia.org/ontology/instrument> <http://dbpedia.org/resource/Trumpet> },N,0,0,46,0,0,0,N
165,N,What is the second highest mountain on Earth?,0,0,1,SELECT DISTINCT ?uri WHERE { ?uri a <http://dbpedia.org/ontology/Mountain> ; <http://dbpedia.org/ontology/elevation> ?elevation } ORDER BY DESC(?elevation) OFFSET 1 LIMIT 1,N,0,0,1,0,0,0,N
171,WORK,Give me all movies with Tom Cruise.,0,1,26,SELECT DISTINCT ?uri WHERE { ?uri a <http://dbpedia.org/ontology/Film> ; <http://dbpedia.org/ontology/starring> <http://dbpedia.org/resource/Tom_Cruise> },SELECT ?Answer WHERE { <http://dbpedia.org/resource/Tom_Terrific> <http://dbpedia.org/ontology/starring> ?Answer .},0,1,26,0,0,0,WORK
172,N,In which U.S. state is Fort Knox located?,0,0,1,PREFIX dbo: <http://dbpedia.org/ontology/> PREFIX res: <http://dbpedia.org/resource/> PREFIX dbp: <http://dbpedia.org/property/> SELECT DISTINCT ?uri WHERE { res:Fort_Knox dbo:location ?uri . ?uri dbo:country res:United_States },N,0,0,1,0,0,0,N
173,WORK,Give me all cities in New Jersey with more than 100000 inhabitants.,0,4,4,PREFIX dbo: <http://dbpedia.org/ontology/> PREFIX res: <http://dbpedia.org/resource/> PREFIX dbp: <http://dbpedia.org/property/> PREFIX rdf: <http://www.w3.org/1999/02/22-rdf-syntax-ns#> SELECT DISTINCT ?uri WHERE { ?uri rdf:type dbo:City ; dbo:isPartOf res:New_Jersey ; dbo:populationTotal ?inhabitants FILTER ( ?inhabitants > 100000 ) },"SELECT ?Answer WHERE { <http://dbpedia.org/resource/Zion,_New_Jersey> <http://dbpedia.org/ontology/isPartOf> ?Answer .}",0,4,4,0,0,0,WORK
175,N,Give me all B-sides of the Ramones.,0,0,11,SELECT DISTINCT ?string WHERE { ?x <http://dbpedia.org/ontology/musicalArtist> <http://dbpedia.org/resource/Ramones> ; <http://dbpedia.org/ontology/bSide> ?string },N,0,0,11,0,0,0,N
177,N,When was Olof Palme shot?,0,0,1,SELECT DISTINCT ?date WHERE { <http://dbpedia.org/resource/Olof_Palme> <http://dbpedia.org/ontology/deathDate> ?date },N,0,0,1,0,0,0,N
178,N,List the seven kings of Rome.,0,0,7,SELECT DISTINCT ?uri WHERE { ?uri <http://dbpedia.org/property/title> <http://dbpedia.org/resource/King_of_Rome> },N,0,0,7,0,0,0,N
179,N,Give me all people that were born in Vienna and died in Berlin.,0,0,13,SELECT DISTINCT ?uri WHERE { ?uri <http://dbpedia.org/ontology/birthPlace> <http://dbpedia.org/resource/Vienna> ; <http://dbpedia.org/ontology/deathPlace> <http://dbpedia.org/resource/Berlin> },N,0,0,13,0,0,0,N
180,N,Is Darth Vader Luke?ÇÔs father?,0,0,0,ASK WHERE { <http://dbpedia.org/resource/Darth_Vader> <http://dbpedia.org/ontology/child> <http://dbpedia.org/resource/Luke_Skywalker> },N,0,0,0,0,0,0,N
182,WORK,Give me all films produced by Steven Spielberg with a budget of at least $80 million.,0,1,0,SELECT DISTINCT ?uri WHERE { ?uri <http://www.w3.org/1999/02/22-rdf-syntax-ns#type> <http://dbpedia.org/ontology/Film> . ?uri <http://dbpedia.org/ontology/director> <http://dbpedia.org/resource/Steven_Spielberg> . ?uri <http://dbpedia.org/ontology/budget> ?b . FILTER( xsd:double(?b) >= 8.0E7 ) },SELECT ?Answer WHERE { <http://dbpedia.org/resource/A_Woman_with_Power_of_Attorney> <http://dbpedia.org/ontology/director> ?Answer .},0,1,0,0,0,0,WORK
183,WORK,Give me all soccer clubs in Spain.,0,1,700,"SELECT DISTINCT ?uri WHERE { ?uri a <http://dbpedia.org/ontology/SoccerClub> { ?uri <http://dbpedia.org/ontology/ground> <http://dbpedia.org/resource/Spain> } UNION { ?uri <http://dbpedia.org/property/ground> ?ground FILTER regex(?ground, ""Spain"") } }",SELECT ?Answer WHERE { <http://dbpedia.org/resource/Saltillo_Soccer> <http://dbpedia.org/ontology/ground> ?Answer .},0,1,700,0,0,0,WORK
185,N,Give me all breeds of the German Shepherd dog.,0,0,8,SELECT DISTINCT ?uri WHERE { ?uri <http://dbpedia.org/property/breed> <http://dbpedia.org/resource/German_Shepherd> },N,0,0,8,0,0,0,N
186,N,Who is the heaviest player of the Chicago Bulls?,0,0,1,SELECT DISTINCT ?uri WHERE { ?uri a <http://dbpedia.org/ontology/Person> ; <http://dbpedia.org/ontology/weight> ?num { ?uri <http://dbpedia.org/property/team> <http://dbpedia.org/resource/Chicago_Bulls> } UNION { ?uri <http://dbpedia.org/property/draftTeam> <http://dbpedia.org/resource/Chicago_Bulls> } UNION { ?uri <http://dbpedia.org/ontology/draftTeam> <http://dbpedia.org/resource/Chicago_Bulls> } } ORDER BY DESC(?num) OFFSET 0 LIMIT 1,N,0,0,1,0,0,0,N
188,N,What is the largest country in the world?,0,0,1,PREFIX dbo: <http://dbpedia.org/ontology/> PREFIX rdf: <http://www.w3.org/1999/02/22-rdf-syntax-ns#> SELECT DISTINCT ?uri WHERE { ?uri rdf:type dbo:Country ; dbo:areaTotal ?n } ORDER BY DESC(?n) OFFSET 0 LIMIT 1,N,0,0,1,0,0,0,N
189,N,What is the largest city in america?,0,0,1,PREFIX dbo: <http://dbpedia.org/ontology/> PREFIX dbr: <http://dbpedia.org/resource/> SELECT ?lcity WHERE { dbr:United_States dbo:largestCity ?lcity },N,0,0,1,0,0,0,N
197,N,Where is the birthplace of Goethe?,0,0,2,PREFIX dbo: <http://dbpedia.org/ontology/> PREFIX dbr: <http://dbpedia.org/resource/> SELECT ?Goethe WHERE { dbr:Johann_Wolfgang_von_Goethe dbo:birthPlace ?Goethe },N,0,0,2,0,0,0,N
201,N,What is the highest mountain in Saxony Germany?,0,0,1,PREFIX dbo: <http://dbpedia.org/ontology/> PREFIX dbr: <http://dbpedia.org/resource/> SELECT ?m WHERE { ?m dbo:mountainRange dbr:Ore_Mountains ; dbo:elevation ?height } ORDER BY DESC(?height) LIMIT 1,N,0,0,1,0,0,0,N
202,N,Who is the current federal minister of finance in Germany?,0,0,1,PREFIX dbo: <http://dbpedia.org/ontology/> SELECT ?leader WHERE { <http://dbpedia.org/resource/Federal_Ministry_of_Finance_(Germany)> dbo:leader ?leader },N,0,0,1,0,0,0,N
206,N,In which state Penn State University is located?,0,0,1,PREFIX dbo: <http://dbpedia.org/ontology/> PREFIX dbr: <http://dbpedia.org/resource/> SELECT ?s WHERE { dbr:Pennsylvania_State_University dbo:state ?s },N,0,0,1,0,0,0,N
207,N,What is the biggest stadium in Spain?,0,0,1,PREFIX dbo: <http://dbpedia.org/ontology/> PREFIX res: <http://dbpedia.org/resource/> PREFIX rdf: <http://www.w3.org/1999/02/22-rdf-syntax-ns#> SELECT DISTINCT ?uri WHERE { ?uri rdf:type dbo:Stadium ; dbo:location res:Spain ; dbo:seatingCapacity ?n } ORDER BY DESC(?n) OFFSET 0 LIMIT 1,N,0,0,1,0,0,0,N
208,N,Who is the coach of Ankara's ice hockey team?,0,0,1,PREFIX dbo: <http://dbpedia.org/ontology/> PREFIX res: <http://dbpedia.org/resource/> SELECT DISTINCT ?uri WHERE { ?x dbo:city res:Ankara ; dbo:league res:Turkish_Ice_Hockey_First_League ; dbo:coach ?uri },N,0,0,1,0,0,0,N
211,N,Was Sigmund Freud married?,0,0,0,PREFIX dbo: <http://dbpedia.org/ontology/> PREFIX dbr: <http://dbpedia.org/resource/> ASK WHERE { dbr:Sigmund_Freud dbo:spouse ?uri },N,0,0,0,0,0,0,N
214,N,Are tree frogs a type of amphibian?,0,0,0,PREFIX dbo: <http://dbpedia.org/ontology/> PREFIX res: <http://dbpedia.org/resource/> ASK WHERE { res:Hylidae dbo:class res:Amphibian },N,0,0,0,0,0,0,N
215,WORK,What is the location of the Houses of Parliament?,0,2,2,PREFIX dbo: <http://dbpedia.org/ontology/> PREFIX res: <http://dbpedia.org/resource/> SELECT ?uri WHERE { res:Palace_of_Westminster dbo:location ?uri },SELECT ?Answer WHERE { <http://dbpedia.org/resource/Malaysian_Houses_of_Parliament> <http://dbpedia.org/ontology/location> ?Answer .},0,2,2,0,0,0,WORK
216,WORK,how much is the elevation of D??sseldorf Airport ?,0,1,1,PREFIX dbo: <http://dbpedia.org/ontology/> PREFIX dbr: <http://dbpedia.org/resource/> SELECT ?ele WHERE { dbr:D??sseldorf_Airport dbo:elevation ?ele } LIMIT 1,SELECT ?Answer WHERE { <http://dbpedia.org/resource/H_D_Range> <http://dbpedia.org/ontology/elevation> ?Answer .},0,1,1,0,0,0,WORK
219,N,Who was the first King of England?,0,0,0,PREFIX dbo: <http://dbpedia.org/ontology/> PREFIX yago: <http://dbpedia.org/class/yago/> PREFIX rdf: <http://www.w3.org/1999/02/22-rdf-syntax-ns#> SELECT DISTINCT ?uri WHERE { ?uri rdf:type dbo:Royalty ; rdf:type yago:WikicatEnglishMonarchs ; dbo:activeYearsStartYear ?date } ORDER BY ASC(?date) OFFSET 0 LIMIT 1,N,0,0,0,0,0,0,N
229,N,Who is 8th president of US?,0,0,0,PREFIX dbo: <http://dbpedia.org/ontology/> PREFIX dbp: <http://dbpedia.org/property/> PREFIX dbr: <http://dbpedia.org/resource/> SELECT ?name WHERE { dbr:8th_President_of_the_United_States dbo:wikiPageRedirects ?link . ?link dbp:name ?name },N,0,0,0,0,0,0,N
230,N,how much is the total population of  european union?,0,0,1,PREFIX dbo: <http://dbpedia.org/ontology/> PREFIX dbr: <http://dbpedia.org/resource/> SELECT ?europop WHERE { dbr:European_Union dbo:populationTotal ?europop },N,0,0,1,0,0,0,N
231,WORK,Give me all launch pads operated by NASA.,7,0,0,PREFIX dbo: <http://dbpedia.org/ontology/> PREFIX res: <http://dbpedia.org/resource/> PREFIX rdf: <http://www.w3.org/1999/02/22-rdf-syntax-ns#> SELECT DISTINCT ?uri WHERE { ?uri rdf:type dbo:LaunchPad ; dbo:operator res:NASA },SELECT ?Answer WHERE { ?Answer <http://www.w3.org/1999/02/22-rdf-syntax-ns#type>   <http://dbpedia.org/ontology/LaunchPad>. ?Answer <http://dbpedia.org/ontology/operator> <http://dbpedia.org/resource/NASA> .},7,0,0,1,1,1,WORK
233,N,What is the birth name of Adele?,0,0,1,PREFIX dbo: <http://dbpedia.org/ontology/> PREFIX dbr: <http://dbpedia.org/resource/> SELECT ?bn WHERE { dbr:Adele dbo:birthName ?bn },N,0,0,1,0,0,0,N
236,N,What is the last work of Dan Brown?,0,0,0,PREFIX dbo: <http://dbpedia.org/ontology/> PREFIX dbp: <http://dbpedia.org/property/> PREFIX dbr: <http://dbpedia.org/resource/> SELECT ?book WHERE { { ?book dbo:author dbr:Dan_Brown . ?book dbp:releaseDate ?date } UNION { ?book dbo:author dbr:Dan_Brown . ?book dbo:publicationDate ?date} } ORDER BY DESC(xsd:date(?date)) LIMIT 1,N,0,0,0,0,0,0,N
237,N,Where is Sungkyunkwan University?,0,0,1,PREFIX dbo: <http://dbpedia.org/ontology/> PREFIX dbr: <http://dbpedia.org/resource/> SELECT DISTINCT ?country WHERE { dbr:Sungkyunkwan_University dbo:city ?city ; dbo:country ?country },N,0,0,1,0,0,0,N
239,N,When was the death  of  Shakespeare?,0,0,1,PREFIX dbo: <http://dbpedia.org/ontology/> PREFIX dbr: <http://dbpedia.org/resource/> SELECT ?x WHERE { dbr:William_Shakespeare dbo:deathDate ?x } LIMIT 1,N,0,0,1,0,0,0,N
244,N,How often did Jane Fonda marry?,0,0,1,PREFIX dbo: <http://dbpedia.org/ontology/> PREFIX res: <http://dbpedia.org/resource/> SELECT (COUNT(DISTINCT ?uri) AS ?c) WHERE { res:Jane_Fonda dbo:spouse ?uri },N,0,0,1,0,0,0,N
245,WORK,Was the wife of president Lincoln called Mary?,0,1,0,"PREFIX dbo: <http://dbpedia.org/ontology/> PREFIX res: <http://dbpedia.org/resource/> PREFIX rdfs: <http://www.w3.org/2000/01/rdf-schema#> ASK WHERE { res:Abraham_Lincoln dbo:spouse ?spouse . ?spouse rdfs:label ?name FILTER regex(?name, ""Mary"") }",SELECT ?Answer WHERE { <http://dbpedia.org/resource/Mary_Todd_Lincoln> <http://dbpedia.org/ontology/spouse> ?Answer .},0,1,0,0,0,0,WORK
247,N,In which programming language is GIMP written?,0,0,2,PREFIX dbo: <http://dbpedia.org/ontology/> PREFIX res: <http://dbpedia.org/resource/> SELECT DISTINCT ?uri WHERE { res:GIMP dbo:programmingLanguage ?uri },N,0,0,2,0,0,0,N
248,N,Which university did Angela Merkel attend?,0,0,1,PREFIX dbo: <http://dbpedia.org/ontology/> PREFIX res: <http://dbpedia.org/resource/> SELECT DISTINCT ?university WHERE { res:Angela_Merkel dbo:almaMater ?university },N,0,0,1,0,0,0,N
