"ID","status","sentence","sparqlQueGG","sparqlQald","TP","FP","FN","Precision","Recall","Fscore","Status"
"11","WORK","Give me all Danish films.","PREFIX dbo: <http://dbpedia.org/ontology/> PREFIX res: <http://dbpedia.org/resource/> PREFIX rdf: <http://www.w3.org/1999/02/22-rdf-syntax-ns#> SELECT DISTINCT ?uri WHERE { ?uri rdf:type dbo:Film ; dbo:country res:Denmark }","SELECT DISTINCT ?Answer WHERE { ?Answer <http://www.w3.org/1999/02/22-rdf-syntax-ns#type> <http://dbpedia.org/ontology/Film> ; <http://dbpedia.org/ontology/country> <http://dbpedia.org/resource/Denmark> }","122.0","0.0","0.0","1.0","1.0","1.0","WORK"
"29","WORK","Show me all museums in London.","SELECT DISTINCT ?uri WHERE { ?uri a <http://dbpedia.org/ontology/Museum> ; <http://dbpedia.org/ontology/location> <http://dbpedia.org/resource/London> }","SELECT ?Answer WHERE { <http://dbpedia.org/resource/Westfield_London> <http://dbpedia.org/ontology/location> ?Answer .}","0.0","1.0","81.0","0.0","0.0","0.0","WORK"
"33","WORK","Give me all writers that won the Nobel Prize in literature.","SELECT DISTINCT ?uri WHERE { ?uri a <http://dbpedia.org/ontology/Writer> ; <http://dbpedia.org/ontology/award> <http://dbpedia.org/resource/Nobel_Prize_in_Literature> }","SELECT ?Answer WHERE { ?Answer <http://www.w3.org/1999/02/22-rdf-syntax-ns#type>   <http://dbpedia.org/ontology/Writer>. <http://dbpedia.org/resource/In_the_Heights> <http://dbpedia.org/ontology/award> ?Answer .}","0.0","0.0","21.0","0.0","0.0","0.0","WORK"
"34","WORK","Show me all basketball players that are higher than 2 meters.","SELECT DISTINCT ?uri WHERE { ?uri a <http://dbpedia.org/ontology/BasketballPlayer> ; <http://dbpedia.org/ontology/height> ?n FILTER ( ?n > 2.0 ) }","SELECT DISTINCT ?Answer WHERE { ?Answer <http://www.w3.org/1999/02/22-rdf-syntax-ns#type>   <http://dbpedia.org/ontology/BasketballPlayer>. ?Answer <http://dbpedia.org/ontology/height> ?objOfProp FILTER ( ?objOfProp > 2 ) }","4269.0","0.0","0.0","1.0","1.0","1.0","WORK"
"55","WORK","Give me the capitals of all countries that the Himalayas run through.","SELECT DISTINCT ?uri WHERE { <http://dbpedia.org/resource/Himalayas> <http://dbpedia.org/ontology/country> ?country . ?country <http://dbpedia.org/ontology/capital> ?uri }","SELECT ?Answer WHERE { <http://dbpedia.org/resource/Voice_of_Music> <http://dbpedia.org/ontology/foundationPlace> ?Answer .}","0.0","1.0","1.0","0.0","0.0","0.0","WORK"
"91","WORK","Give me all the TV shows with Neil Patrick Harris.","SELECT DISTINCT ?uri WHERE { ?uri a <http://dbpedia.org/ontology/TelevisionShow> ; <http://dbpedia.org/ontology/starring> <http://dbpedia.org/resource/Neil_Patrick_Harris> }","SELECT ?Answer WHERE { <http://dbpedia.org/resource/Walk_the_Walk> <http://dbpedia.org/ontology/starring> ?Answer .}","0.0","1.0","12.0","0.0","0.0","0.0","WORK"
