ID,status,sentence,TP,FP,FN,sparqlQueGG,sparqlQald,TP,FP,FN,Precision,Recall,Fscore,Status
249,WORK,List all the musicals with music by Elton John.,0,1,5,PREFIX dbo: <http://dbpedia.org/ontology/> PREFIX res: <http://dbpedia.org/resource/> PREFIX rdf: <http://www.w3.org/1999/02/22-rdf-syntax-ns#> SELECT DISTINCT ?uri WHERE { ?uri rdf:type dbo:Musical ; dbo:musicBy res:Elton_John },SELECT ?Answer WHERE { <http://dbpedia.org/resource/John_Henry_(musical)> <http://dbpedia.org/ontology/musicBy> ?Answer .},0,1,5,0,0,0,WORK
251,N,What is the longest river in the world?,0,0,1,PREFIX dbo: <http://dbpedia.org/ontology/> PREFIX rdf: <http://www.w3.org/1999/02/22-rdf-syntax-ns#> SELECT ?uri WHERE { ?uri rdf:type dbo:BodyOfWater ; dbo:length ?length } ORDER BY DESC(?length) LIMIT 1,N,0,0,1,0,0,0,N
255,N,Which species does an elephant belong?,0,0,0,PREFIX dbr: <http://dbpedia.org/resource/> PREFIX dbp: <http://dbpedia.org/property/> SELECT ?species WHERE { dbr:Elephant dbp:species ?species },N,0,0,0,0,0,0,N
257,WORK,In which ancient empire could you pay with cocoa beans?,0,2,1,PREFIX dbo: <http://dbpedia.org/ontology/> PREFIX res: <http://dbpedia.org/resource/> SELECT DISTINCT ?uri WHERE { ?uri dbo:currency res:Cocoa_bean },SELECT ?Answer WHERE { <http://dbpedia.org/resource/Croatia_in_the_union_with_Hungary> <http://dbpedia.org/ontology/currency> ?Answer .},0,2,1,0,0,0,WORK
258,N,How many theories did Albert Einstein come up with?,0,0,1,PREFIX dbo: <http://dbpedia.org/ontology/> PREFIX dbr: <http://dbpedia.org/resource/> SELECT (COUNT(?uri) AS ?count) WHERE { dbr:Albert_Einstein dbo:knownFor ?uri },N,0,0,1,0,0,0,N
259,N,Who composed the soundtrack for Cameron's Titanic?,0,0,1,PREFIX dbo: <http://dbpedia.org/ontology/> SELECT DISTINCT ?uri WHERE { <http://dbpedia.org/resource/Titanic_(1997_film)> dbo:musicComposer ?uri },N,0,0,1,0,0,0,N
260,WORK,Give me the runtime of Toy Story.,1,0,0,PREFIX dbo: <http://dbpedia.org/ontology/> PREFIX res: <http://dbpedia.org/resource/> SELECT DISTINCT ?runtime WHERE { res:Toy_Story dbo:runtime ?runtime },SELECT ?Answer WHERE { <http://dbpedia.org/resource/Toy_Story> <http://dbpedia.org/ontology/runtime> ?Answer .},1,0,0,1,1,1,WORK
263,WORK,Which electronics companies were founded in Beijing?,1,29,0,PREFIX dbo: <http://dbpedia.org/ontology/> PREFIX res: <http://dbpedia.org/resource/> PREFIX rdf: <http://www.w3.org/1999/02/22-rdf-syntax-ns#> SELECT DISTINCT ?uri WHERE { ?uri rdf:type dbo:Company ; dbo:industry res:Electronics ; dbo:foundationPlace res:Beijing },SELECT ?Answer WHERE { ?Answer <http://dbpedia.org/ontology/foundationPlace> <http://dbpedia.org/resource/Beijing> .},1,29,0,0.033333335,1,0.064516135,WORK
266,N,Did Arnold Schwarzenegger attend a university?,0,0,0,PREFIX dbo: <http://dbpedia.org/ontology/> PREFIX res: <http://dbpedia.org/resource/> PREFIX rdf: <http://www.w3.org/1999/02/22-rdf-syntax-ns#> ASK WHERE { res:Arnold_Schwarzenegger dbo:almaMater ?x . ?x rdf:type dbo:University },N,0,0,0,0,0,0,N
267,N,Is James Bond married?,0,0,0,PREFIX dbo: <http://dbpedia.org/ontology/> PREFIX res: <http://dbpedia.org/resource/> ASK WHERE { res:James_Bond dbo:spouse ?uri },N,0,0,0,0,0,0,N
268,N,Does the Isar flow into a lake?,0,0,0,PREFIX dbo: <http://dbpedia.org/ontology/> PREFIX res: <http://dbpedia.org/resource/> PREFIX rdf: <http://www.w3.org/1999/02/22-rdf-syntax-ns#> ASK WHERE { ?x dbo:inflow res:Isar ; rdf:type dbo:Lake },N,0,0,0,0,0,0,N
270,N,Who was John F. Kennedy's vice president?,0,0,1,PREFIX dbo: <http://dbpedia.org/ontology/> PREFIX res: <http://dbpedia.org/resource/> SELECT DISTINCT ?uri WHERE { res:John_F._Kennedy dbo:vicePresident ?uri },N,0,0,1,0,0,0,N
273,N,In what city is the Heineken brewery?,0,0,1,PREFIX dbo: <http://dbpedia.org/ontology/> PREFIX res: <http://dbpedia.org/resource/> SELECT DISTINCT ?uri WHERE { res:Heineken dbo:manufacturer ?x . ?x dbo:locationCity ?uri },N,0,0,1,0,0,0,N
274,N,Is Barack Obama a democrat?,0,0,0,PREFIX dbo: <http://dbpedia.org/ontology/> PREFIX res: <http://dbpedia.org/resource/> ASK WHERE { res:Barack_Obama dbo:party <http://dbpedia.org/resource/Democratic_Party_(United_States)> },N,0,0,0,0,0,0,N
275,WORK,List the children of Margaret Thatcher.,2,0,0,PREFIX dbo: <http://dbpedia.org/ontology/> PREFIX res: <http://dbpedia.org/resource/> SELECT DISTINCT ?uri WHERE { res:Margaret_Thatcher dbo:child ?uri },SELECT ?Answer WHERE { <http://dbpedia.org/resource/Margaret_Thatcher> <http://dbpedia.org/ontology/child> ?Answer .},2,0,0,1,1,1,WORK
276,N,From which region is the Melon de Bourgogne?,0,0,4,PREFIX dbo: <http://dbpedia.org/ontology/> PREFIX res: <http://dbpedia.org/resource/> SELECT DISTINCT ?uri WHERE { res:Melon_de_Bourgogne dbo:wineRegion ?uri },N,0,0,4,0,0,0,N
280,N,What is Donald Trump's main business?,0,0,4,PREFIX dbo: <http://dbpedia.org/ontology/> PREFIX dbr: <http://dbpedia.org/resource/> SELECT ?owner WHERE { ?owner dbo:owner dbr:Donald_Trump },N,0,0,4,0,0,0,N
283,N,how much is the population  Iraq?,0,0,1,PREFIX dbo: <http://dbpedia.org/ontology/> PREFIX dbr: <http://dbpedia.org/resource/> SELECT ?pIraq WHERE { dbr:Iraq dbo:populationTotal ?pIraq },N,0,0,1,0,0,0,N
289,N,What is the highest mountain in Italy?,0,0,1,PREFIX dbo: <http://dbpedia.org/ontology/> PREFIX res: <http://dbpedia.org/resource/> PREFIX rdf: <http://www.w3.org/1999/02/22-rdf-syntax-ns#> SELECT DISTINCT ?uri WHERE { ?uri rdf:type dbo:Mountain ; dbo:locatedInArea res:Italy ; dbo:elevation ?num } ORDER BY DESC(?num) OFFSET 0 LIMIT 1,N,0,0,1,0,0,0,N
290,N,List all games by GMT.,0,0,8,PREFIX dbo: <http://dbpedia.org/ontology/> PREFIX res: <http://dbpedia.org/resource/> SELECT DISTINCT ?uri WHERE { ?uri dbo:publisher res:GMT_Games },N,0,0,8,0,0,0,N
296,WORK,Give me all members of Prodigy.,3,0,0,PREFIX dbo: <http://dbpedia.org/ontology/> PREFIX res: <http://dbpedia.org/resource/> SELECT DISTINCT ?uri WHERE { res:The_Prodigy dbo:bandMember ?uri },SELECT ?Answer WHERE { <http://dbpedia.org/resource/The_Prodigy> <http://dbpedia.org/ontology/bandMember> ?Answer .},3,0,0,1,1,1,WORK
297,N,In which time zone is Rome?,0,0,1,PREFIX dbo: <http://dbpedia.org/ontology/> PREFIX res: <http://dbpedia.org/resource/> SELECT DISTINCT ?uri WHERE { res:Rome dbo:timeZone ?uri },N,0,0,1,0,0,0,N
301,N,What is the largest city in Australia?,0,0,1,PREFIX dbo: <http://dbpedia.org/ontology/> PREFIX res: <http://dbpedia.org/resource/> SELECT DISTINCT ?uri WHERE { res:Australia dbo:largestCity ?uri },N,0,0,1,0,0,0,N
307,N,How many languages are spoken in Turkmenistan?,0,0,1,PREFIX dbo: <http://dbpedia.org/ontology/> PREFIX res: <http://dbpedia.org/resource/> SELECT (COUNT(DISTINCT ?x) AS ?c) WHERE { res:Turkmenistan dbo:language ?x },N,0,0,1,0,0,0,N
308,N,Did Che Guevara have children?,0,0,0,PREFIX dbo: <http://dbpedia.org/ontology/> PREFIX res: <http://dbpedia.org/resource/> ASK WHERE { res:Che_Guevara dbo:child ?uri },N,0,0,0,0,0,0,N
309,N,Did Kaurism?¨ki ever win the Grand Prix at Cannes?,0,0,0,PREFIX dbo: <http://dbpedia.org/ontology/> PREFIX res: <http://dbpedia.org/resource/> ASK WHERE { res:Aki_Kaurism?¨ki dbo:award <http://dbpedia.org/resource/Grand_Prix_(Cannes_Film_Festival)> },N,0,0,0,0,0,0,N
312,N,What country is Sitecore from?,0,0,1,PREFIX dbo: <http://dbpedia.org/ontology/> PREFIX res: <http://dbpedia.org/resource/> SELECT DISTINCT ?uri WHERE { res:Sitecore dbo:foundationPlace ?uri },N,0,0,1,0,0,0,N
313,WORK,Give me the birth place of Frank Sinatra.,1,0,0,PREFIX dbo: <http://dbpedia.org/ontology/> PREFIX res: <http://dbpedia.org/resource/> SELECT DISTINCT ?place WHERE { res:Frank_Sinatra dbo:birthPlace ?place },SELECT ?Answer WHERE { <http://dbpedia.org/resource/Frank_Sinatra> <http://dbpedia.org/ontology/birthPlace> ?Answer .},1,0,0,1,1,1,WORK
314,N,Is Christian Bale starring in Velvet Goldmine?,0,0,0,PREFIX dbo: <http://dbpedia.org/ontology/> PREFIX res: <http://dbpedia.org/resource/> ASK WHERE { res:Velvet_Goldmine dbo:starring res:Christian_Bale },N,0,0,0,0,0,0,N
315,WORK,Who is the son of Sonny and Cher?,1,1,0,PREFIX dbo: <http://dbpedia.org/ontology/> PREFIX res: <http://dbpedia.org/resource/> SELECT DISTINCT ?uri WHERE { ?uri dbo:parent res:Cher ; dbo:parent res:Sonny_Bono },SELECT ?Answer WHERE { <http://dbpedia.org/resource/Cher> <http://dbpedia.org/ontology/child> ?Answer .},1,1,0,0.5,1,0.6666667,WORK
316,N,How many ethnic groups live in Slovenia?,0,0,1,PREFIX dbo: <http://dbpedia.org/ontology/> PREFIX res: <http://dbpedia.org/resource/> SELECT (COUNT(DISTINCT ?uri) AS ?c) WHERE { res:Slovenia dbo:ethnicGroup ?uri },N,0,0,1,0,0,0,N
318,N,Was Natalie Portman born in the United States?,0,0,0,PREFIX dbo: <http://dbpedia.org/ontology/> PREFIX res: <http://dbpedia.org/resource/> ASK WHERE { res:Natalie_Portman dbo:birthPlace ?city . ?city dbo:country res:United_States },N,0,0,0,0,0,0,N
320,N,Who is the oldest child of Meryl Streep?,0,0,1,PREFIX dbo: <http://dbpedia.org/ontology/> PREFIX res: <http://dbpedia.org/resource/> SELECT DISTINCT ?uri WHERE { res:Meryl_Streep dbo:child ?uri . ?uri dbo:birthDate ?d } ORDER BY ASC(?d) OFFSET 0 LIMIT 1,N,0,0,1,0,0,0,N
322,N,What does IYCM stand for?,0,0,1,"PREFIX dbo: <http://dbpedia.org/ontology/> PREFIX res: <http://dbpedia.org/resource/> SELECT DISTINCT ?uri WHERE { ?uri dbo:abbreviation ""IYCM"" }",N,0,0,1,0,0,0,N
324,N,Was U.S. president Jackson involved in a war?,0,0,0,PREFIX dbo: <http://dbpedia.org/ontology/> PREFIX res: <http://dbpedia.org/resource/> ASK WHERE { res:Andrew_Jackson dbo:battle ?battle },N,0,0,0,0,0,0,N
326,N,Did Tesla win a nobel prize in physics?,0,0,0,PREFIX dbo: <http://dbpedia.org/ontology/> PREFIX res: <http://dbpedia.org/resource/> ASK WHERE { res:Nikola_Tesla dbo:award res:Nobel_Prize_in_Physics },N,0,0,0,0,0,0,N
327,N,How many states are in Mexico?,0,0,1,PREFIX dbo: <http://dbpedia.org/ontology/> PREFIX dbr: <http://dbpedia.org/resource/> SELECT (COUNT(?uri) AS ?count) WHERE { ?uri dbo:type dbr:States_of_Mexico },N,0,0,1,0,0,0,N
329,N,How much did the Lego Movie cost?,0,0,1,PREFIX dbo: <http://dbpedia.org/ontology/> PREFIX res: <http://dbpedia.org/resource/> SELECT DISTINCT ?n WHERE { res:The_Lego_Movie dbo:budget ?n },N,0,0,1,0,0,0,N
334,N,Does Neymar play for Real Madrid?,0,0,0,PREFIX dbo: <http://dbpedia.org/ontology/> PREFIX res: <http://dbpedia.org/resource/> ASK WHERE { res:Neymar dbo:team <http://dbpedia.org/resource/Real_Madrid_C.F.> },N,0,0,0,0,0,0,N
338,N,Does Breaking Bad have more episodes than Game of Thrones?,0,0,0,PREFIX dbo: <http://dbpedia.org/ontology/> PREFIX res: <http://dbpedia.org/resource/> ASK WHERE { res:Breaking_Bad dbo:numberOfEpisodes ?x . res:Game_of_Thrones dbo:numberOfEpisodes ?y FILTER ( ?y > ?x ) },N,0,0,0,0,0,0,N
341,N,What was the final result of the War of the Roses?,0,0,1,PREFIX dbo: <http://dbpedia.org/ontology/> PREFIX dbr: <http://dbpedia.org/resource/> SELECT DISTINCT ?result WHERE { ?uri dbo:isPartOfMilitaryConflict dbr:Wars_of_the_Roses ; dbo:result ?result ; dbo:date ?date } ORDER BY DESC(?date) OFFSET 0 LIMIT 1,N,0,0,1,0,0,0,N
342,N,How much did Pulp Fiction cost?,0,0,1,PREFIX dbo: <http://dbpedia.org/ontology/> PREFIX res: <http://dbpedia.org/resource/> SELECT DISTINCT ?n WHERE { res:Pulp_Fiction dbo:budget ?n },N,0,0,1,0,0,0,N
345,N,Who is starring in Spanish movies produced by Benicio del Toro?,0,0,1,PREFIX dbo: <http://dbpedia.org/ontology/> PREFIX res: <http://dbpedia.org/resource/> PREFIX rdf: <http://www.w3.org/1999/02/22-rdf-syntax-ns#> SELECT DISTINCT ?uri WHERE { ?film rdf:type dbo:Film ; dbo:country res:Spain ; dbo:producer res:Benicio_del_Toro ; dbo:starring ?uri . ?uri rdf:type dbo:Person },N,0,0,1,0,0,0,N
347,WORK,Show me all books in Asimov's Foundation series.,0,1,3,PREFIX dbo: <http://dbpedia.org/ontology/> PREFIX res: <http://dbpedia.org/resource/> SELECT DISTINCT ?uri WHERE { ?uri dbo:series res:Foundation_series },SELECT ?Answer WHERE { <http://dbpedia.org/resource/Foundation_(Isaac_Asimov_novel)> <http://dbpedia.org/ontology/series> ?Answer .},0,1,3,0,0,0,WORK
349,N,Which city has the oldest running metro?,0,0,1,PREFIX dbo: <http://dbpedia.org/ontology/> PREFIX dbr: <http://dbpedia.org/resource/> PREFIX rdf: <http://www.w3.org/1999/02/22-rdf-syntax-ns#> SELECT ?loc WHERE { ?uri dbo:type dbr:Rapid_transit ; dbo:openingYear ?date ; dbo:location ?loc . ?loc rdf:type dbo:City } ORDER BY ASC(?date) LIMIT 1,N,0,0,1,0,0,0,N
354,WORK,What country is Mount Everest in?,0,0,2,PREFIX dbo: <http://dbpedia.org/ontology/> PREFIX res: <http://dbpedia.org/resource/> PREFIX rdf: <http://www.w3.org/1999/02/22-rdf-syntax-ns#> SELECT DISTINCT ?uri WHERE { res:Mount_Everest dbo:locatedInArea ?uri . ?uri rdf:type dbo:Country },SELECT ?Answer WHERE { ?Answer <http://www.w3.org/1999/02/22-rdf-syntax-ns#type>   <http://dbpedia.org/ontology/Country>. ?Answer <http://dbpedia.org/ontology/locatedInArea> <http://dbpedia.org/resource/Mount_Everest> .},0,0,2,0,0,0,WORK
359,N,Who was buried in the Great Pyramid of Giza?,0,0,2,PREFIX dbo: <http://dbpedia.org/ontology/> PREFIX dbr: <http://dbpedia.org/resource/> SELECT ?uri WHERE { ?uri dbo:restingPlace dbr:Great_Pyramid_of_Giza },N,0,0,2,0,0,0,N
361,N,Did Socrates influence Aristotle?,0,0,0,PREFIX dbo: <http://dbpedia.org/ontology/> PREFIX res: <http://dbpedia.org/resource/> ASK WHERE { res:Aristotle dbo:influencedBy res:Socrates },N,0,0,0,0,0,0,N
362,N,How many children did Benjamin Franklin have?,0,0,1,PREFIX dbo: <http://dbpedia.org/ontology/> PREFIX res: <http://dbpedia.org/resource/> SELECT (COUNT(DISTINCT ?uri) AS ?c) WHERE { res:Benjamin_Franklin dbo:child ?uri },N,0,0,1,0,0,0,N
364,WORK,In which UK city are the headquarters of the MI6?,0,0,1,PREFIX dbo: <http://dbpedia.org/ontology/> PREFIX res: <http://dbpedia.org/resource/> PREFIX rdf: <http://www.w3.org/1999/02/22-rdf-syntax-ns#> SELECT DISTINCT ?uri WHERE { res:Secret_Intelligence_Service dbo:headquarter ?uri . ?uri dbo:country res:United_Kingdom },N,0,0,1,0,0,0,WORK
367,N,Give me the grandchildren of Elvis Presley.,0,0,1,PREFIX dbo: <http://dbpedia.org/ontology/> PREFIX res: <http://dbpedia.org/resource/> SELECT DISTINCT ?uri WHERE { res:Elvis_Presley dbo:child ?child . ?child dbo:child ?uri },N,0,0,1,0,0,0,N
368,N,When did the Ming dynasty dissolve?,0,0,1,PREFIX dbo: <http://dbpedia.org/ontology/> PREFIX res: <http://dbpedia.org/resource/> SELECT DISTINCT ?date WHERE { res:Ming_dynasty dbo:dissolutionDate ?date },N,0,0,1,0,0,0,N
371,WORK,Give me all books by William Goldman with more than 300 pages.,0,1,10,PREFIX dbo: <http://dbpedia.org/ontology/> PREFIX res: <http://dbpedia.org/resource/> PREFIX rdf: <http://www.w3.org/1999/02/22-rdf-syntax-ns#> SELECT DISTINCT ?uri WHERE { ?uri rdf:type dbo:Book ; dbo:author res:William_Goldman ; dbo:numberOfPages ?x FILTER ( ?x > 300 ) },SELECT ?Answer WHERE { <http://dbpedia.org/resource/More_William> <http://dbpedia.org/ontology/author> ?Answer .},0,1,10,0,0,0,WORK
372,N,What did Bruce Carver die from?,0,0,1,PREFIX dbo: <http://dbpedia.org/ontology/> PREFIX res: <http://dbpedia.org/resource/> SELECT DISTINCT ?uri WHERE { res:Bruce_Carver dbo:deathCause ?uri },N,0,0,1,0,0,0,N
373,WORK,Which subsidiary of Lufthansa serves both Dortmund and Berlin Tegel?,1,4,0,PREFIX dbo: <http://dbpedia.org/ontology/> PREFIX res: <http://dbpedia.org/resource/> SELECT DISTINCT ?uri WHERE { res:Lufthansa dbo:subsidiary ?uri . ?uri dbo:targetAirport res:Dortmund_Airport ; dbo:targetAirport res:Berlin_Tegel_Airport },SELECT ?Answer WHERE { ?Answer <http://dbpedia.org/ontology/targetAirport> <http://dbpedia.org/resource/Berlin_Tegel_Airport> .},1,4,0,0.2,1,0.3333333,WORK
375,N,Did Elvis Presley have children?,0,0,0,PREFIX dbo: <http://dbpedia.org/ontology/> PREFIX res: <http://dbpedia.org/resource/> ASK WHERE { res:Elvis_Presley dbo:child ?uri },N,0,0,0,0,0,0,N
382,N,What form of government does Russia have?,0,0,1,PREFIX dbo: <http://dbpedia.org/ontology/> PREFIX res: <http://dbpedia.org/resource/> SELECT DISTINCT ?uri WHERE { res:Russia dbo:governmentType ?uri },N,0,0,1,0,0,0,N
383,WORK,Show me the book that Muhammad Ali wrote.,2,0,0,PREFIX dbo: <http://dbpedia.org/ontology/> PREFIX res: <http://dbpedia.org/resource/> PREFIX rdf: <http://www.w3.org/1999/02/22-rdf-syntax-ns#> SELECT DISTINCT ?uri WHERE { ?uri rdf:type dbo:Book ; dbo:author res:Muhammad_Ali },SELECT ?Answer WHERE { ?Answer <http://dbpedia.org/ontology/author> <http://dbpedia.org/resource/Muhammad_Ali> .},2,0,0,1,1,1,WORK
384,N,Who was the first to climb Mount Everest?,0,0,4,PREFIX dbo: <http://dbpedia.org/ontology/> PREFIX res: <http://dbpedia.org/resource/> SELECT DISTINCT ?uri WHERE { res:Mount_Everest dbo:firstAscentPerson ?uri },N,0,0,4,0,0,0,N
385,N,How many languages are spoken in Colombia?,0,0,1,PREFIX dbo: <http://dbpedia.org/ontology/> PREFIX res: <http://dbpedia.org/resource/> PREFIX rdf: <http://www.w3.org/1999/02/22-rdf-syntax-ns#> SELECT (COUNT(DISTINCT ?uri) AS ?c) WHERE { ?uri rdf:type dbo:Language . res:Colombia dbo:language ?uri },N,0,0,1,0,0,0,N
388,N,When did Boris Becker end his active career?,0,0,1,PREFIX dbo: <http://dbpedia.org/ontology/> PREFIX res: <http://dbpedia.org/resource/> SELECT DISTINCT ?d WHERE { res:Boris_Becker dbo:activeYearsEndDate ?d },N,0,0,1,0,0,0,N
389,WORK,Which movies starring Mickey Rourke were directed by Guy Ritchie?,1,10,0,PREFIX dbo: <http://dbpedia.org/ontology/> PREFIX res: <http://dbpedia.org/resource/> PREFIX rdf: <http://www.w3.org/1999/02/22-rdf-syntax-ns#> SELECT DISTINCT ?uri WHERE { ?uri rdf:type dbo:Film ; dbo:starring res:Mickey_Rourke ; dbo:director res:Guy_Ritchie },SELECT ?Answer WHERE { ?Answer <http://dbpedia.org/ontology/director> <http://dbpedia.org/resource/Guy_Ritchie> .},1,10,0,0.09090909,1,0.16666667,WORK
390,WORK,In which films did Julia Roberts as well as Richard Gere play?,0,8,2,PREFIX dbo: <http://dbpedia.org/ontology/> PREFIX res: <http://dbpedia.org/resource/> PREFIX rdf: <http://www.w3.org/1999/02/22-rdf-syntax-ns#> SELECT DISTINCT ?uri WHERE { ?uri rdf:type dbo:Film ; dbo:starring res:Julia_Roberts ; dbo:starring res:Richard_Gere },SELECT ?Answer WHERE { <http://dbpedia.org/resource/You_Might_as_Well_Live> <http://dbpedia.org/ontology/starring> ?Answer .},0,8,2,0,0,0,WORK
391,N,Show me Hemingway's autobiography.,0,0,1,PREFIX dbo: <http://dbpedia.org/ontology/> PREFIX res: <http://dbpedia.org/resource/> SELECT DISTINCT ?uri WHERE { ?uri dbo:author res:Ernest_Hemingway ; dbo:literaryGenre res:Autobiography },N,0,0,1,0,0,0,N
393,N,What are the five boroughs of New York?,0,0,5,PREFIX dbo: <http://dbpedia.org/ontology/> SELECT DISTINCT ?uri WHERE { ?uri dbo:governmentType <http://dbpedia.org/resource/Borough_(New_York_City)> },N,0,0,5,0,0,0,N
394,N,Give me all Canadian Grunge record labels.,0,0,1,PREFIX dbo: <http://dbpedia.org/ontology/> PREFIX res: <http://dbpedia.org/resource/> PREFIX rdf: <http://www.w3.org/1999/02/22-rdf-syntax-ns#> SELECT DISTINCT ?uri WHERE { ?uri rdf:type dbo:RecordLabel ; dbo:genre res:Grunge ; dbo:country res:Canada },N,0,0,1,0,0,0,N
399,N,In which city did John F. Kennedy die?,0,0,1,PREFIX dbo: <http://dbpedia.org/ontology/> PREFIX res: <http://dbpedia.org/resource/> PREFIX rdf: <http://www.w3.org/1999/02/22-rdf-syntax-ns#> SELECT DISTINCT ?uri WHERE { res:John_F._Kennedy dbo:deathPlace ?uri . ?uri rdf:type dbo:City },N,0,0,1,0,0,0,N
400,N,What is the highest mountain in Australia?,0,0,1,PREFIX dbo: <http://dbpedia.org/ontology/> PREFIX res: <http://dbpedia.org/resource/> PREFIX rdf: <http://www.w3.org/1999/02/22-rdf-syntax-ns#> SELECT DISTINCT ?uri WHERE { ?uri rdf:type dbo:Mountain ; dbo:locatedInArea res:Australia ; dbo:elevation ?elevation } ORDER BY DESC(?elevation) LIMIT 1,N,0,0,1,0,0,0,N
402,WORK,Give me the currency of China.,1,0,0,PREFIX dbo: <http://dbpedia.org/ontology/> PREFIX res: <http://dbpedia.org/resource/> SELECT DISTINCT ?uri WHERE { res:China dbo:currency ?uri },SELECT ?Answer WHERE { <http://dbpedia.org/resource/China> <http://dbpedia.org/ontology/currency> ?Answer .},1,0,0,1,1,1,WORK
403,N,Give me all Swedish oceanographers.,0,0,1,PREFIX dbo: <http://dbpedia.org/ontology/> PREFIX res: <http://dbpedia.org/resource/> SELECT DISTINCT ?uri WHERE { ?uri dbo:field res:Oceanography ; dbo:birthPlace res:Sweden },N,0,0,1,0,0,0,N
410,N,What was the first name of the band Queens of the Stone Age?,0,0,1,PREFIX dbo: <http://dbpedia.org/ontology/> PREFIX res: <http://dbpedia.org/resource/> SELECT DISTINCT ?name WHERE { res:Queens_of_the_Stone_Age dbo:alias ?name },N,0,0,1,0,0,0,N
411,N,What was the last movie with Alec Guinness?,0,0,1,PREFIX dbo: <http://dbpedia.org/ontology/> PREFIX res: <http://dbpedia.org/resource/> PREFIX rdf: <http://www.w3.org/1999/02/22-rdf-syntax-ns#> SELECT DISTINCT ?uri WHERE { ?uri rdf:type dbo:Film ; dbo:starring res:Alec_Guinness ; dbo:releaseDate ?date } ORDER BY DESC(?date) LIMIT 1,N,0,0,1,0,0,0,N
412,WORK,Give me all actors starring in Last Action Hero.,0,0,10,PREFIX dbo: <http://dbpedia.org/ontology/> PREFIX res: <http://dbpedia.org/resource/> SELECT DISTINCT ?uri WHERE { res:Last_Action_Hero dbo:starring ?uri },SELECT ?Answer WHERE { ?Answer <http://www.w3.org/1999/02/22-rdf-syntax-ns#type>   <http://dbpedia.org/ontology/Actor>. <http://dbpedia.org/resource/Last_Action_Hero> <http://dbpedia.org/ontology/starring> ?Answer .},0,0,10,0,0,0,WORK
