QALD id,QALD question,sparql
0,Wann fand die Schlacht von Gettysburg statt?,"PREFIX dbo: <http://dbpedia.org/ontology/>
PREFIX res: <http://dbpedia.org/resource/>
SELECT DISTINCT ?date 
WHERE { 
       res:Battle_of_Gettysburg dbo:date ?date .
}"
2,Wie hoch ist der Leuchtturm in Colombo?,SELECT DISTINCT ?num WHERE {  <http://dbpedia.org/resource/Colombo_Lighthouse> <http://dbpedia.org/ontology/height> ?num . } 
3,Wer war die Frau von US-Pr├ñsident Lincoln?,"PREFIX dbo: <http://dbpedia.org/ontology/>
PREFIX res: <http://dbpedia.org/resource/>
SELECT DISTINCT ?uri 
WHERE {
	res:Abraham_Lincoln dbo:spouse ?uri.
}"
4,Wer moderiert die BBC Wildlife Specials?,SELECT DISTINCT ?uri WHERE { <http://dbpedia.org/resource/BBC_Wildlife_Specials> <http://dbpedia.org/ontology/presenter> ?uri . }
5,Wieviel hat Pulp Fiction gekostet?,SELECT DISTINCT ?n WHERE {  <http://dbpedia.org/resource/Pulp_Fiction> <http://dbpedia.org/ontology/budget> ?n . } 
6,In welcher Stadt ist die Heinekenbrauerei?,SELECT DISTINCT ?uri WHERE { <http://dbpedia.org/resource/Heineken> <http://dbpedia.org/ontology/manufacturer> ?x . ?x <http://dbpedia.org/ontology/locationCity> ?uri . }
7,Wann wurde die Operation Overlord durchgef├╝hrt?,SELECT DISTINCT ?d WHERE { <http://dbpedia.org/resource/Operation_Overlord> <http://dbpedia.org/ontology/date> ?d . } 
8,In welcher Stadt h├Ârt die Ruta 68 auf?,SELECT DISTINCT ?uri WHERE {  <http://dbpedia.org/resource/Chile_Route_68> <http://dbpedia.org/ontology/routeEnd> ?uri . } 
9,Wer hat Slack entwickelt?,SELECT DISTINCT ?uri WHERE { ?uri <http://dbpedia.org/ontology/product> <http://dbpedia.org/resource/Slack_(software)> . }
10,Wer war mit Jacques Chirac verheiratet?,"PREFIX dbo: <http://dbpedia.org/ontology/> 
PREFIX res: <http://dbpedia.org/resource/> 
SELECT DISTINCT ?uri
WHERE { 
         res:Jacques_Chirac dbo:spouse ?uri .
}"
11,Woran ist Abraham Lincoln gestorben?,"PREFIX res: <http://dbpedia.org/resource/>
PREFIX dbo: <http://dbpedia.org/ontology/>
SELECT DISTINCT ?uri
WHERE {
        res:Bruce_Carver dbo:deathCause ?uri .     
}"
12,Wer malte Christus im Sturm auf dem See von Galilea?,"PREFIX dbp: <http://dbpedia.org/property/>
PREFIX res: <http://dbpedia.org/resource/>
SELECT DISTINCT ?uri 
WHERE {
	res:The_Storm_on_the_Sea_of_Galilee dbp:artist ?uri .
}"
13,Durch welche St├ñdte flie├ƒt die Zeravshan?,SELECT DISTINCT ?uri WHERE {  <http://dbpedia.org/resource/Weser> <http://dbpedia.org/ontology/city> ?uri . } 
14,Wieviele Pl├ñtze hat das Heimstadium des FC Porto?,SELECT DISTINCT ?n WHERE { <http://dbpedia.org/resource/FC_Porto> <http://dbpedia.org/ontology/ground> ?x . ?x <http://dbpedia.org/ontology/seatingCapacity> ?n . } 
15,Mit wem ist die Tochter von Robert Kennedy verheiratet?,SELECT DISTINCT ?uri WHERE {  <http://dbpedia.org/resource/Robert_F._Kennedy> <http://dbpedia.org/ontology/child> ?child .  ?child <http://dbpedia.org/ontology/spouse> ?uri . } 
16,Welche B├╝cher von Kerouac wurden von Viking Press verlegt?,SELECT DISTINCT ?uri WHERE {  ?uri <http://www.w3.org/1999/02/22-rdf-syntax-ns#type> <http://dbpedia.org/ontology/Book> .  ?uri <http://dbpedia.org/ontology/publisher> <http://dbpedia.org/resource/Viking_Press> .  ?uri <http://dbpedia.org/ontology/author> <http://dbpedia.org/resource/Jack_Kerouac> . } 
17,Wie gro├ƒ ist Amazon Eve?,SELECT DISTINCT ?height WHERE {  <http://dbpedia.org/resource/Amazon_Eve> <http://dbpedia.org/ontology/height> ?height . } 
18,In welchem Museum ist Der Schrei von Munch ausgestellt?,"PREFIX dbo: <http://dbpedia.org/ontology/>
PREFIX res: <http://dbpedia.org/resource/>
SELECT DISTINCT ?uri
WHERE {
       res:The_Scream dbo:museum ?uri .
}"
19,Wer schrieb das Buch Die S├ñulen der Erde?,"PREFIX dbo: <http://dbpedia.org/ontology/>
PREFIX res: <http://dbpedia.org/resource/>
SELECT DISTINCT ?uri 
WHERE {
	res:The_Pillars_of_the_Earth dbo:author ?uri .
}"
20,Ist James Bond verheiratet?,"PREFIX dbo: <http://dbpedia.org/ontology/>
PREFIX res: <http://dbpedia.org/resource/>
ASK 
WHERE {
        res:James_Bond dbo:spouse ?uri . 
}"
21,Wer entdeckte Ceres?,SELECT DISTINCT ?uri WHERE { <http://dbpedia.org/resource/Ceres_(dwarf_planet)> <http://dbpedia.org/ontology/discoverer> ?uri . }
22,Welchen Fluss ├╝berspannt die Brooklyn Bridge?,"PREFIX dbo: <http://dbpedia.org/ontology/>
PREFIX res: <http://dbpedia.org/resource/>
SELECT DISTINCT ?uri
WHERE {       
        res:Brooklyn_Bridge dbo:crosses ?uri . 
}"
23,Wer wurde Eagles genannt?,"PREFIX dbp: <http://dbpedia.org/property/> 
SELECT DISTINCT ?uri 
WHERE { 
        ?uri dbp:nickname 'Frank The Tank'@en . 
}"
24,Was ist das gr├Â├ƒte Land der Welt?,SELECT DISTINCT ?uri WHERE { ?uri a <http://dbpedia.org/ontology/Country> . ?uri <http://dbpedia.org/ontology/areaTotal> ?n . } ORDER BY DESC(?n) OFFSET 0 LIMIT 1
25,Wer ist B├╝rgermeister von Paris?,SELECT DISTINCT ?uri WHERE { <http://dbpedia.org/resource/Paris> <http://dbpedia.org/ontology/mayor> ?uri . }
26,Wer ist der Trainer von Ankaras Eishockeymannschaft?,SELECT DISTINCT ?uri WHERE { ?x <http://dbpedia.org/ontology/city> <http://dbpedia.org/resource/Ankara> . ?x <http://dbpedia.org/ontology/league> <http://dbpedia.org/resource/Turkish_Ice_Hockey_First_League> . ?x <http://dbpedia.org/ontology/coach> ?uri . }
27,Wer ist der B├╝rgermeister der Hauptstadt von Russland?,"PREFIX dbo: <http://dbpedia.org/ontology/>
PREFIX res: <http://dbpedia.org/resource/>
SELECT DISTINCT ?uri 
WHERE { 
        res:French_Polynesia dbo:capital ?x .
        ?x dbo:mayor ?uri .
}"
28,Welche Preise hat Douglas Hofstadter gewonnen?,"PREFIX res: <http://dbpedia.org/resource/>
PREFIX dbo: <http://dbpedia.org/ontology/>
SELECT DISTINCT ?uri
WHERE {
        res:Douglas_Hofstadter dbo:award ?uri .
}"
29,Wieviel hat der Legofilm gekostet?,SELECT DISTINCT ?n WHERE { <http://dbpedia.org/resource/The_Lego_Movie> <http://dbpedia.org/ontology/budget> ?n . } 
30,Wo f├ñngt Piccadilly an?,SELECT DISTINCT ?uri WHERE { ?uri <http://dbpedia.org/ontology/routeStart> <http://dbpedia.org/resource/Piccadilly>. } 
31,Haben Prinz Harry und Prinz William dieselben Eltern?,"PREFIX dbo: <http://dbpedia.org/ontology/> 
ASK
WHERE { 
        <http://dbpedia.org/resource/Prince_William,_Duke_of_Cambridge> dbo:parent ?x . 
        <http://dbpedia.org/resource/Prince_Harry> dbo:parent ?x .
}"
32,Wer hat Agent Smith gespielt?,"PREFIX dbp: <http://dbpedia.org/property/>
PREFIX res: <http://dbpedia.org/resource/>
SELECT DISTINCT ?uri
WHERE { 
        res:Agent_Smith dbp:portrayer ?uri . 
}"
33,Wieviele Sprachen werden in Turkmenistan gesprochen?,SELECT (COUNT(DISTINCT ?x) as ?c) WHERE {  <http://dbpedia.org/resource/Turkmenistan> <http://dbpedia.org/ontology/language> ?x . } 
35,In welchem Land entspringt der Ganges?,"PREFIX dbo: <http://dbpedia.org/ontology/> 
PREFIX res: <http://dbpedia.org/resource/> 
SELECT DISTINCT ?uri 
WHERE { 
        res:Ganges dbo:sourceCountry ?uri .
}"
36,In welchem Jahr wurde Rachel Stevens geboren?,SELECT DISTINCT ?uri WHERE {  <http://dbpedia.org/resource/Rachel_Stevens> <http://dbpedia.org/ontology/birthYear> ?uri . } 
37,Ist Barack Obama ein Demokrat?,"PREFIX dbo: <http://dbpedia.org/ontology/>
PREFIX res: <http://dbpedia.org/resource/>
ASK
WHERE { 
        res:Barack_Obama dbo:party <http://dbpedia.org/resource/Democratic_Party_(United_States)> . 
}"
38,Wo wurde Johann Sebastian Bach geboren?,"PREFIX dbo: <http://dbpedia.org/ontology/>
PREFIX res: <http://dbpedia.org/resource/>
SELECT DISTINCT ?uri 
WHERE {
        res:Johann_Sebastian_Bach dbo:birthPlace ?uri .
}"
39,Wie oft hat Jane Fonda geheiratet?,SELECT (COUNT(DISTINCT ?uri) as ?c) WHERE {  <http://dbpedia.org/resource/Jane_Fonda> <http://dbpedia.org/ontology/spouse> ?uri . } 
40,Wer hat als erstes den Mount Everest bestiegen?,"PREFIX res: <http://dbpedia.org/resource/>
PREFIX dbo: <http://dbpedia.org/ontology/>
SELECT DISTINCT ?uri
WHERE {
          res:Mount_Everest dbo:firstAscentPerson ?uri . 
}"
41,Wieviele Menschen leben in Polen?,SELECT DISTINCT ?uri WHERE { <http://dbpedia.org/resource/Poland> <http://dbpedia.org/ontology/populationTotal> ?uri . }  
42,Wo ist der Westminster-Palast?,SELECT ?uri WHERE {  <http://dbpedia.org/resource/Palace_of_Westminster> <http://dbpedia.org/ontology/location> ?uri . } 
43,Spielt Christian Bale in Batman Begins mit?,"PREFIX dbo: <http://dbpedia.org/ontology/>
PREFIX res: <http://dbpedia.org/resource/>
ASK 
WHERE {
	res:Batman_Begins dbo:starring res:Christian_Bale .
}"
44,In welchem Land befindet sich der Limerick Lake?,"PREFIX dbo: <http://dbpedia.org/ontology/>
PREFIX res: <http://dbpedia.org/resource/>
SELECT DISTINCT ?uri 
WHERE { 
	res:Limerick_Lake dbo:country ?uri .
}"
45,Was war der letzte Film mit Alec Guinness?,SELECT DISTINCT ?uri WHERE {  ?uri <http://www.w3.org/1999/02/22-rdf-syntax-ns#type> <http://dbpedia.org/ontology/Film> .  ?uri <http://dbpedia.org/ontology/starring> <http://dbpedia.org/resource/Alec_Guinness> .  ?uri <http://dbpedia.org/ontology/releaseDate> ?date . } ORDER BY DESC(?date) LIMIT 1 
46,Was ist der h├Âchste Berg in Australien?,"PREFIX dbo: <http://dbpedia.org/ontology/>
PREFIX res: <http://dbpedia.org/resource/>
PREFIX rdf: <http://www.w3.org/1999/02/22-rdf-syntax-ns#>
SELECT DISTINCT ?uri 
WHERE {
	?uri rdf:type dbo:Mountain .
        ?uri dbo:locatedInArea res:Australia .
        ?uri dbo:elevation ?elevation .
} 
ORDER BY DESC(?elevation) LIMIT 1"
47,Lebt Frank Herbert noch?,"PREFIX dbo: <http://dbpedia.org/ontology/>
PREFIX res: <http://dbpedia.org/resource/>
ASK 
WHERE {
	OPTIONAL { res:Frank_Herbert dbo:deathDate ?date . }
        FILTER (!BOUND(?date))
}"
48,Wer hat sich Family Guy ausgedacht?,SELECT DISTINCT ?uri WHERE { <http://dbpedia.org/resource/Family_Guy> <http://dbpedia.org/ontology/creator> ?uri . }  
49,Was ist die Amtssprache Von Surinam?,"PREFIX dbo: <http://dbpedia.org/ontology/>
PREFIX res: <http://dbpedia.org/resource/>
SELECT DISTINCT ?uri
WHERE { 
        res:Suriname dbo:officialLanguage ?uri .
}"
50,Wer hat das Lied Hotel California geschrieben?,SELECT DISTINCT ?uri WHERE { <http://dbpedia.org/resource/Hotel_California> <http://dbpedia.org/ontology/writer> ?uri . }
52,Was ist in Chocolate Chip Cookies drin?,SELECT DISTINCT ?uri WHERE { <http://dbpedia.org/resource/Chocolate_chip_cookie> <http://dbpedia.org/ontology/ingredient> ?uri . }
54,Welche Zutaten brauche ich f├╝r M├Âhrenkuchen?,SELECT DISTINCT ?uri WHERE {  <http://dbpedia.org/resource/Carrot_cake> <http://dbpedia.org/ontology/ingredient> ?uri . } 
55,Spielt Neymar f├╝r Real Madrid?,ASK WHERE { <http://dbpedia.org/resource/Neymar> <http://dbpedia.org/ontology/team> <http://dbpedia.org/resource/Real_Madrid_C.F.> . }
56,Welcher Informatiker hat einen Oscar gewonnen?,"SELECT DISTINCT ?uri WHERE { { ?uri <http://dbpedia.org/ontology/field> <http://dbpedia.org/resource/Computer_science> . } UNION { ?uri <http://purl.org/dc/elements/1.1/description> ?s . FILTER regex(?s,'computer scientist','i') } ?uri <http://dbpedia.org/ontology/award> <http://dbpedia.org/resource/Academy_Awards> . } "
57,Wieviele Firmen wurden im selben Jahr wie Google gegr├╝ndet?,SELECT (COUNT(DISTINCT ?uri) as ?c) WHERE {  ?uri <http://www.w3.org/1999/02/22-rdf-syntax-ns#type> <http://dbpedia.org/ontology/Company> .  ?uri <http://dbpedia.org/ontology/foundingYear> ?year .  <http://dbpedia.org/resource/Google> <http://dbpedia.org/ontology/foundingYear> ?year . } 
58,In welcher Stadt im Vereinigten K├Ânigreich ist das Hauptquartier des MI6?,"PREFIX res: <http://dbpedia.org/resource/> 
PREFIX dbo: <http://dbpedia.org/ontology/> 
PREFIX rdf: <http://www.w3.org/1999/02/22-rdf-syntax-ns#>
SELECT DISTINCT ?uri 
WHERE { 
        res:Secret_Intelligence_Service dbo:headquarter ?uri . 
        ?uri dbo:country res:United_Kingdom . 
}"
59,War die Kubakrise vor der Schweinebuchtinvasion?,"PREFIX dbo: <http://dbpedia.org/ontology/>
PREFIX res: <http://dbpedia.org/resource/>
ASK 
WHERE {
        res:Cuban_Missile_Crisis dbo:date ?x .
	res:Bay_of_Pigs_Invasion dbo:date ?y .
	FILTER (?x < ?y)
}"
60,F├╝r was steh IYCM?,"PREFIX dbo: <http://dbpedia.org/ontology/>
PREFIX res: <http://dbpedia.org/resource/>
SELECT DISTINCT ?uri
WHERE {
        ?uri dbo:abbreviation 'IYCM' .
}"
61,Wann endete die Japanisches Kaiserreich?,"PREFIX res: <http://dbpedia.org/resource/>
PREFIX dbo: <http://dbpedia.org/ontology/> 
SELECT DISTINCT ?date
WHERE {  
        res:Ming_dynasty dbo:dissolutionDate ?date .
}"
64,Hat Arnold Schwarzenegger eine Universit├ñt besucht?,"PREFIX dbo: <http://dbpedia.org/ontology/>
PREFIX res: <http://dbpedia.org/resource/> 
PREFIX rdf: <http://www.w3.org/1999/02/22-rdf-syntax-ns#>
ASK
WHERE {
        res:Arnold_Schwarzenegger dbo:almaMater ?x .
        ?x rdf:type dbo:University .
}"
65,In welchem Land ist der Mount Everest?,"PREFIX dbo: <http://dbpedia.org/ontology/>
PREFIX res: <http://dbpedia.org/resource/>
PREFIX rdf: <http://www.w3.org/1999/02/22-rdf-syntax-ns#> 
SELECT DISTINCT ?uri
WHERE { 
        res:Mount_Everest dbo:locatedInArea ?uri . 
        ?uri rdf:type dbo:Country .
}"
66,Was ist die gr├Â├ƒte Stadt in Australien?,"PREFIX dbo: <http://dbpedia.org/ontology/>
PREFIX res: <http://dbpedia.org/resource/>
SELECT DISTINCT ?uri 
WHERE {
	res:Australia dbo:largestCity ?uri .
}"
68,Wer ist der B├╝rgermeister von Florenz?,"PREFIX dbo: <http://dbpedia.org/ontology/>
PREFIX res: <http://dbpedia.org/resource/>
SELECT DISTINCT ?uri
WHERE { 
        res:Tel_Aviv dbo:leaderName ?uri .
}"
70,Wer hat Batman erfunden?,SELECT DISTINCT ?uri WHERE {  <http://dbpedia.org/resource/Batman> <http://dbpedia.org/ontology/creator> ?uri . } 
71,Wer hat Gus Fring gespielt?,SELECT DISTINCT ?uri WHERE { <http://dbpedia.org/resource/Gus_Fring> <http://dbpedia.org/ontology/portrayer> ?uri . }
72,In welcher Programmiersprache wurde GIMP geschrieben?,"PREFIX dbo: <http://dbpedia.org/ontology/>
PREFIX res: <http://dbpedia.org/resource/>
SELECT DISTINCT ?uri 
WHERE { 
	res:GIMP dbo:programmingLanguage ?uri .
}"
73,In welchem alten Reich konnte man mit Kakaobohnen bezahlen?,SELECT DISTINCT ?uri WHERE { ?uri <http://dbpedia.org/ontology/currency> <http://dbpedia.org/resource/Cocoa_bean> . }
74,Wer ist der Herausgeber von Forbes?,"PREFIX res: <http://dbpedia.org/resource/>
PREFIX dbo: <http://dbpedia.org/ontology/>
SELECT DISTINCT ?uri 
WHERE {
        res:Forbes dbo:editor ?uri .
}"
75,Wieviele Menschen leben in der Hauptstadt Australiens?,"PREFIX dbo: <http://dbpedia.org/ontology/>
PREFIX res: <http://dbpedia.org/resource/>
SELECT DISTINCT ?num 
WHERE {
        res:Australia dbo:capital ?x .
        ?x dbo:populationTotal ?num .
}"
76,Welche Profisurfer wurden in Australien geboren?,"PREFIX dbo: <http://dbpedia.org/ontology/> 
PREFIX res: <http://dbpedia.org/resource/> 
SELECT DISTINCT ?uri 
WHERE { 
        ?uri dbo:occupation res:Surfing .  
        ?uri dbo:birthPlace res:Australia . 
}"
77,Welche Elektronikunternehmen wurden in Peking gegr├╝ndet?,SELECT DISTINCT ?uri WHERE { ?uri a <http://dbpedia.org/ontology/Company> . ?uri <http://dbpedia.org/ontology/industry> <http://dbpedia.org/resource/Electronics> . ?uri <http://dbpedia.org/ontology/foundationPlace> <http://dbpedia.org/resource/Beijing> . }
79,Wieviele Aldi-Filialen gibt es?,SELECT DISTINCT ?number WHERE {  <http://dbpedia.org/resource/Aldi> <http://dbpedia.org/ontology/numberOfLocations> ?number . } 
80,Was ist die Hauptstadt von Kamerun?,SELECT DISTINCT ?uri WHERE { <http://dbpedia.org/resource/Cameroon> <http://dbpedia.org/ontology/capital> ?uri. } 
81,"Gibt es ein Videospiel, das Battle Chess hei├ƒt?","PREFIX dbo: <http://dbpedia.org/ontology/>
PREFIX rdf: <http://www.w3.org/1999/02/22-rdf-syntax-ns#>
PREFIX rdfs: <http://www.w3.org/2000/01/rdf-schema#>
ASK 
WHERE {
	?uri rdf:type dbo:VideoGame .
        ?uri rdfs:label 'Battle Chess'@en .
}"
82,Hie├ƒ die Frau von Pr├ñsident Lincoln Mary?,"PREFIX dbo: <http://dbpedia.org/ontology/>
PREFIX res: <http://dbpedia.org/resource/>
PREFIX rdfs: <http://www.w3.org/2000/01/rdf-schema#>
ASK 
WHERE {
        res:Abraham_Lincoln dbo:spouse ?spouse .
        ?spouse rdfs:label ?name .
        FILTER(regex(?name,'Mary')) 
}"
84,Welcher von Tim Burtons Filmen hatte das h├Âchste Budget?,"PREFIX dbo: <http://dbpedia.org/ontology/>
PREFIX res: <http://dbpedia.org/resource/>
SELECT DISTINCT ?uri 
WHERE { 
        ?uri dbo:director res:Tim_Burton .
        ?uri dbo:budget ?b .
}
ORDER BY ?b
OFFSET 0 LIMIT 1"
85,Hat Breaking Bad mehr Episoden als Game of Thrones?,"PREFIX dbo: <http://dbpedia.org/ontology/> 
PREFIX res: <http://dbpedia.org/resource/> 
ASK 
WHERE { 
        res:Breaking_Bad dbo:numberOfEpisodes ?x . 
        res:Game_of_Thrones dbo:numberOfEpisodes ?y . 
        FILTER (?y > ?x) 
}"
86,Wer wurde Rodzilla genannt?,"PREFIX dbp: <http://dbpedia.org/property/> 
SELECT DISTINCT ?uri 
WHERE { 
         ?uri dbp:nickname ""Rodzilla""@en .
}"
87,Wurde Natalie Portman in den Vereinigten Staaten geboren?,"PREFIX dbo: <http://dbpedia.org/ontology/>
PREFIX res: <http://dbpedia.org/resource/>
ASK 
WHERE { 
	res:Natalie_Portman dbo:birthPlace ?city .
      	?city dbo:country res:United_States .
}"
89,"Bei welchen Filmen, in denen Mickey Rourke mitspielt, hat Guy Ritchie Regie gef├╝hrt?",SELECT DISTINCT ?uri WHERE { ?uri <http://www.w3.org/1999/02/22-rdf-syntax-ns#type> <http://dbpedia.org/ontology/Film> . ?uri <http://dbpedia.org/ontology/starring> <http://dbpedia.org/resource/Mickey_Rourke> . ?uri <http://dbpedia.org/ontology/director> <http://dbpedia.org/resource/Guy_Ritchie> . } 
90,Wann ist Draculas Sch├Âpfer gestorben?,SELECT DISTINCT ?date WHERE {  <http://dbpedia.org/resource/Count_Dracula> <http://dbpedia.org/ontology/creator> ?x .  ?x <http://dbpedia.org/ontology/deathDate> ?date . } 
91,Aus welchem Land kommt der Erfinder von Nijntje?,"PREFIX dbo: <http://dbpedia.org/ontology/>
PREFIX res: <http://dbpedia.org/resource/>
SELECT DISTINCT ?uri 
WHERE {
	res:Miffy dbo:creator ?x .
	?x dbo:nationality ?uri .
}"
92,Was ist Batmans richtiger Name?,SELECT DISTINCT ?s WHERE { <http://dbpedia.org/resource/Batman> <http://dbpedia.org/property/alterEgo> ?s . }
93,Welche Regierungsform hat Russland?,SELECT DISTINCT ?uri WHERE { <http://dbpedia.org/resource/Russia> <http://dbpedia.org/ontology/governmentType> ?uri . } 
94,Wieviele Firmen hat der Gr├╝nder von Facebook gegr├╝ndet?,SELECT (COUNT(DISTINCT ?uri) as ?c) WHERE {  <http://dbpedia.org/resource/Facebook> <http://dbpedia.org/ontology/foundedBy> ?uri .  ?uri <http://dbpedia.org/ontology/foundedBy> ?uri . } 
96,Wieviele Kinder hatte Benjamin Franklin?,SELECT (COUNT(DISTINCT ?uri) as ?c) WHERE {  <http://dbpedia.org/resource/Benjamin_Franklin> <http://dbpedia.org/ontology/child> ?uri . } 
98,Aus welcher Region ist der Melon de Bourgogne?,"PREFIX res: <http://dbpedia.org/resource/>
PREFIX dbo: <http://dbpedia.org/ontology/> 
SELECT DISTINCT ?uri
WHERE {
        res:Melon_de_Bourgogne dbo:wineRegion ?uri .
}"
99,Wer ist das ├ñlteste Kind von Meryl Streep?,"PREFIX dbo: <http://dbpedia.org/ontology/>
PREFIX res: <http://dbpedia.org/resource/>
SELECT DISTINCT ?uri
WHERE { 
        res:Meryl_Streep dbo:child ?uri . 
        ?uri dbo:birthDate ?d .
}
ORDER BY ASC(?d)
OFFSET 0 LIMIT 1"
100,Sind Laubfr├Âsche Amphibien?,"PREFIX dbo: <http://dbpedia.org/ontology/> 
PREFIX res: <http://dbpedia.org/resource/> 
ASK 
WHERE { 
        res:Hylidae dbo:class res:Amphibian . 
}"
101,Spielt Christian Bale in Velvet Goldmine mit?,"PREFIX dbo: <http://dbpedia.org/ontology/>
PREFIX res: <http://dbpedia.org/resource/>
ASK
WHERE {
        res:Velvet_Goldmine dbo:starring res:Christian_Bale .
}"
103,Flie├ƒt die Isar in einen See?,"PREFIX dbo: <http://dbpedia.org/ontology/>
PREFIX res: <http://dbpedia.org/resource/>
PREFIX rdf: <http://www.w3.org/1999/02/22-rdf-syntax-ns#>
ASK
WHERE {
        ?x dbo:inflow res:Isar .
        ?x rdf:type dbo:Lake . 
}"
104,Welche Flugh├ñfen fliegt Yeti Airlines an?,SELECT DISTINCT ?uri WHERE {  <http://dbpedia.org/resource/Yeti_Airlines> <http://dbpedia.org/ontology/targetAirport> ?uri . }
105,Welches indische Unternehmen hat die meisten Angestellten?,SELECT DISTINCT ?uri WHERE { ?uri a <http://dbpedia.org/ontology/Company> . ?uri <http://dbpedia.org/ontology/location> <http://dbpedia.org/resource/India> . ?uri <http://dbpedia.org/ontology/numberOfEmployees> ?n . } ORDER BY DESC(?n) OFFSET 0 LIMIT 1
106,Welche Farbe steht f├╝r den Reichtum?,SELECT DISTINCT ?uri WHERE { ?uri <http://dbpedia.org/ontology/connotation> <http://dbpedia.org/resource/Loyalty> . }
107,Welche Stadt hat die meisten Einwohner?,"PREFIX dbo: <http://dbpedia.org/ontology/> 
PREFIX res: <http://dbpedia.org/resource/> 
PREFIX rdf: <http://www.w3.org/1999/02/22-rdf-syntax-ns#> 
SELECT DISTINCT ?uri
WHERE { 
         ?uri rdf:type dbo:City . 
         ?uri dbo:populationTotal ?pop . 
}
ORDER BY DESC(?pop)
OFFSET 0 LIMIT 1"
108,Wer hat Gmail gegr├╝ndet?,"PREFIX dbo: <http://dbpedia.org/ontology/>
PREFIX res: <http://dbpedia.org/resource/>
SELECT DISTINCT ?uri
WHERE {
	res:Wikipedia dbo:author ?uri .
}"
109,Ist Rita Wilson die Frau von Tom Hanks?,"PREFIX dbo: <http://dbpedia.org/ontology/> 
PREFIX res: <http://dbpedia.org/resource/> 
ASK 
WHERE { 
        res:Tom_Hanks dbo:spouse res:Rita_Wilson . 
}"
110,Hei├ƒt die Frau von Pr├ñsident Obama Michelle?,"PREFIX dbo: <http://dbpedia.org/ontology/>
PREFIX res: <http://dbpedia.org/resource/>
PREFIX rdfs: <http://www.w3.org/2000/01/rdf-schema#>
ASK 
WHERE {
        res:Barack_Obama dbo:spouse ?spouse .
        ?spouse rdfs:label ?name .
        FILTER(regex(?name,'Michelle')) 
}"
111,Wieviele ethnische Gruppen leben in Slovenien?,SELECT (COUNT(DISTINCT ?uri) as ?c) WHERE {  <http://dbpedia.org/resource/Slovenia> <http://dbpedia.org/ontology/ethnicGroup> ?uri . } 
112,Wer ist der Pr├ñsident von Hamburgische B├╝rgerschaft?,SELECT DISTINCT ?uri WHERE { <http://dbpedia.org/resource/Eritrea> <http://dbpedia.org/ontology/leader> ?uri . <http://dbpedia.org/resource/Eritrea> <http://dbpedia.org/ontology/leaderTitle> 'President'@en . }  
113,Bei wievielen Filmen hat Stanley Kubrick Regie gef├╝hrt?,SELECT DISTINCT ?uri WHERE { ?uri <http://dbpedia.org/ontology/director> <http://dbpedia.org/resource/Stanley_Kubrick> . }
114,Wann wurde die Titanic fertiggestellt?,"PREFIX dbo: <http://dbpedia.org/ontology/>
PREFIX res: <http://dbpedia.org/resource/>
SELECT DISTINCT ?date
WHERE { 
        res:RMS_Titanic dbo:completionDate ?date . 
}"
115,Wieviele Seiten hat Krieg und Frieden?,"PREFIX dbo: <http://dbpedia.org/ontology/>
PREFIX res: <http://dbpedia.org/resource/>
SELECT DISTINCT ?n
WHERE {
        res:War_and_Peace dbo:numberOfPages ?n .
}"
116,Wer ist der j├╝ngste Spieler in der Premier League?,"PREFIX dbo: <http://dbpedia.org/ontology/> 
PREFIX res: <http://dbpedia.org/resource/> 
SELECT DISTINCT ?uri 
WHERE { 
        ?uri dbo:team ?x . 
        ?x dbo:league res:Premier_League . 
        ?uri dbo:birthDate ?y . 
} 
ORDER BY DESC(?y) 
OFFSET 0 LIMIT 1"
117,Was ist der h├Âchste Berg in Italien?,"PREFIX dbo: <http://dbpedia.org/ontology/>
PREFIX res: <http://dbpedia.org/resource/>
PREFIX rdf: <http://www.w3.org/1999/02/22-rdf-syntax-ns#>
SELECT DISTINCT ?uri
WHERE {
        ?uri rdf:type dbo:Mountain .
        ?uri dbo:locatedInArea res:Italy .
        ?uri dbo:elevation ?num .
}
ORDER BY DESC(?num)
OFFSET 0 LIMIT 1"
118,Wie gro├ƒ ist Claudia Schiffer?,"PREFIX res: <http://dbpedia.org/resource/>
PREFIX dbo: <http://dbpedia.org/ontology/>
SELECT DISTINCT ?height 
WHERE {       
        res:Claudia_Schiffer dbo:height ?height .      
}"
119,Wer war der Vizepr├ñsident unter Samuel Schmid?,"PREFIX dbo: <http://dbpedia.org/ontology/> 
PREFIX res: <http://dbpedia.org/resource/> 
SELECT DISTINCT ?uri 
WHERE { res:John_F._Kennedy dbo:vicePresident ?uri . 
}"
121,Wer war der Nachfolger von Patrick F. Kennedy?,"PREFIX dbo: <http://dbpedia.org/ontology/>
PREFIX res: <http://dbpedia.org/resource/>
SELECT DISTINCT ?uri 
WHERE {
	res:John_F._Kennedy dbo:successor ?uri .
}"
122,Wer hat den Soundtrack f├╝r Camerons Titanic geschrieben?,SELECT DISTINCT ?uri WHERE { <http://dbpedia.org/resource/Titanic_(1997_film)> <http://dbpedia.org/ontology/musicComposer> ?uri . } 
123,Welche Filme hat Kurosawa gedreht?,"PREFIX dbo: <http://dbpedia.org/ontology/>
PREFIX res: <http://dbpedia.org/resource/>
PREFIX rdf: <http://www.w3.org/1999/02/22-rdf-syntax-ns#>
SELECT DISTINCT ?uri
WHERE {
        ?uri rdf:type dbo:Film .
        ?uri dbo:director res:Akira_Kurosawa .
}"
124,Welche Plattenfirma hat Elvis' erstes Album aufgenommen?,"PREFIX dbo: <http://dbpedia.org/ontology/>
PREFIX res: <http://dbpedia.org/resource/>
PREFIX rdf: <http://www.w3.org/1999/02/22-rdf-syntax-ns#>
SELECT DISTINCT ?uri 
WHERE {
        ?x rdf:type dbo:Album .
        ?x dbo:artist res:Elvis_Presley .
        ?x dbo:releaseDate ?y .
        ?x dbo:recordLabel ?uri .
}
ORDER BY ASC(?y) 
OFFSET 0 LIMIT 1"
125,In welcher Zeitzone liegt Rom?,SELECT DISTINCT ?uri WHERE { <http://dbpedia.org/resource/Rome> <http://dbpedia.org/ontology/timeZone> ?uri . } 
126,Welche W├ñhrung benutzt China?,"PREFIX res: <http://dbpedia.org/resource/>
PREFIX dbo: <http://dbpedia.org/ontology/> 
SELECT DISTINCT ?uri
WHERE {  
   res:China dbo:currency ?uri . 
}"
127,Wer sind die Entwickler von DBpedia?,SELECT DISTINCT ?uri WHERE { <http://dbpedia.org/resource/DBpedia> <http://dbpedia.org/ontology/developer> ?uri . }
128,Hat Abraham Lincolns Sterbeort eine Webseite?,"PREFIX dbo: <http://dbpedia.org/ontology/>
PREFIX res: <http://dbpedia.org/resource/>
ASK 
WHERE {
        res:Abraham_Lincoln dbo:deathPlace ?p .
        ?p dbo:website ?w . 
}"
129,Wer ist der K├Ânig der Australisches Parlament?,SELECT DISTINCT ?uri WHERE { <http://dbpedia.org/resource/Netherlands> <http://dbpedia.org/ontology/leader> ?uri . ?uri a <http://dbpedia.org/ontology/Royalty> . } 
130,In welcher Stadt ist Nikos Kazantzakis gestorben?,SELECT DISTINCT ?uri WHERE { <http://dbpedia.org/resource/Nikos_Kazantzakis> <http://dbpedia.org/ontology/deathPlace> ?uri . ?uri a <http://dbpedia.org/ontology/Town> . }
131,Wer war der Vater von K├Ânigin Elizabeth II?,"PREFIX res: <http://dbpedia.org/resource/>
PREFIX dbp: <http://dbpedia.org/property/>
SELECT DISTINCT ?uri
WHERE { 
        res:Elizabeth_II dbp:father ?uri .
}"
133,Wieviele Einwohner hat die gr├Â├ƒte Stadt in Kanada?,"PREFIX dbo: <http://dbpedia.org/ontology/>
PREFIX res: <http://dbpedia.org/resource/>
SELECT DISTINCT ?num
WHERE {
        res:Canada dbo:largestCity ?city . 
        ?city dbo:populationTotal ?num .
}"
134,An welchen milit├ñrischen Auseinandersetzungen war Lawrence von Arabien beteiligt?,"PREFIX dbo: <http://dbpedia.org/ontology/> 
PREFIX res: <http://dbpedia.org/resource/> 
SELECT DISTINCT ?uri 
WHERE { 
        res:T._E._Lawrence dbo:battle ?uri . 
}"
135,Welches Buch hat die meisten Seiten?,"PREFIX dbo: <http://dbpedia.org/ontology/>
PREFIX rdf: <http://www.w3.org/1999/02/22-rdf-syntax-ns#> 
SELECT DISTINCT ?uri
WHERE { 
        ?uri rdf:type dbo:Book . 
        ?uri dbo:numberOfPages ?n .
}
ORDER BY DESC(?n)
OFFSET 0 LIMIT 1"
136,In welchem Land entspringt der Nil?,"PREFIX dbo: <http://dbpedia.org/ontology/>
PREFIX res: <http://dbpedia.org/resource/>
SELECT DISTINCT ?uri
WHERE {       
        res:Nile dbo:sourceCountry ?uri .
}"
137,Wer ist der Formel-1-Fahrer mit den meisten Rennen?,SELECT DISTINCT ?uri WHERE {  ?uri <http://www.w3.org/1999/02/22-rdf-syntax-ns#type> <http://dbpedia.org/ontology/FormulaOneRacer> .  ?uri <http://dbpedia.org/ontology/races> ?x . } ORDER BY DESC(?x) OFFSET 0 LIMIT 1 
138,Welche Firmen stellen Hovercrafts her?,SELECT DISTINCT ?uri WHERE { ?uri a <http://dbpedia.org/ontology/Company> . ?uri <http://dbpedia.org/ontology/product> <http://dbpedia.org/resource/Hovercraft> . }
139,Hatte Elvis Presley Kinder?,ASK WHERE { <http://dbpedia.org/resource/Elvis_Presley> <http://dbpedia.org/ontology/child> ?uri . } 
140,In welcher Stadt ist der Pr├ñsident von Montenegro geboren?,SELECT DISTINCT ?uri WHERE { ?x <http://dbpedia.org/property/office> <http://dbpedia.org/resource/President_of_Montenegro> . ?x <http://dbpedia.org/ontology/birthPlace> ?uri . ?uri a <http://dbpedia.org/ontology/City> . } 
141,In welcher Stadt ist Bill Gates geboren?,SELECT DISTINCT ?uri WHERE { <http://dbpedia.org/resource/Bill_Gates> <http://dbpedia.org/ontology/birthPlace> ?x . ?x <http://dbpedia.org/ontology/country> ?uri . }
142,In welcher L├ñndern wird Japanisch gesprochen?,SELECT DISTINCT ?uri WHERE { ?uri a <http://dbpedia.org/ontology/Country> . ?uri <http://dbpedia.org/ontology/language> <http://dbpedia.org/resource/Japanese_language> . } 
144,Ist Michelle Obama die Frau von Barack Obama?,"PREFIX dbo: <http://dbpedia.org/ontology/>
PREFIX res: <http://dbpedia.org/resource/>
ASK 
WHERE {
	res:Barack_Obama dbo:spouse res:Michelle_Obama .
}"
145,Was ist die Vorwahl von Berlin?,"PREFIX dbo: <http://dbpedia.org/ontology/>
PREFIX res: <http://dbpedia.org/resource/>
SELECT DISTINCT ?string 
WHERE {
	res:Berlin dbo:areaCode ?string .
}"
147,Was sind die Spitznamen von San Francisco?,SELECT DISTINCT ?string WHERE {  <http://dbpedia.org/resource/San_Francisco> <http://dbpedia.org/property/nickname> ?string . } 
148,Was war das erste Queen-Album?,SELECT DISTINCT ?uri WHERE { ?uri a <http://dbpedia.org/ontology/Album> . ?uri <http://dbpedia.org/ontology/artist> <http://dbpedia.org/resource/Queen_(band)> . ?uri <http://dbpedia.org/ontology/releaseDate> ?d . } ORDER BY ASC(?d) OFFSET 0 LIMIT 1
149,Durch welche L├ñnder flie├ƒt der Talsperre El Burguillo?,"PREFIX res: <http://dbpedia.org/resource/>
PREFIX dbp: <http://dbpedia.org/property/>
SELECT DISTINCT ?uri 
WHERE {
        res:Yenisei_River dbp:country ?uri .
}"
150,Welche Fernsehserien hat Walt Disney entworfen?,"PREFIX dbo: <http://dbpedia.org/ontology/>
PREFIX res: <http://dbpedia.org/resource/>
PREFIX rdf: <http://www.w3.org/1999/02/22-rdf-syntax-ns#>
SELECT DISTINCT ?uri
WHERE {
	?uri rdf:type dbo:TelevisionShow .
        ?uri dbo:creator res:Walt_Disney .
}"
151,Welche Br├╝cke hat die l├ñngste Spannweite?,"PREFIX dbo: <http://dbpedia.org/ontology/>
PREFIX res: <http://dbpedia.org/resource/>
PREFIX rdf: <http://www.w3.org/1999/02/22-rdf-syntax-ns#>
SELECT DISTINCT ?uri 
WHERE {
        ?uri rdf:type dbo:Bridge .
        ?uri dbo:mainspan ?s . 
} 
ORDER BY DESC(?s) 
OFFSET 0 LIMIT 1"
152,Aus welchem Land kommt Sitecore?,SELECT DISTINCT ?uri WHERE { <http://dbpedia.org/resource/Sitecore> <http://dbpedia.org/ontology/foundationPlace> ?uri . }
153,Wen hat Donald Trump geheiratet?,SELECT DISTINCT ?uri WHERE { ?uri <http://dbpedia.org/ontology/spouse> <http://dbpedia.org/resource/Lance_Bass> . } 
154,Was ist die Hauptstadt von Kanada?,"PREFIX dbo:  <http://dbpedia.org/ontology/>
PREFIX res:  <http://dbpedia.org/resource/>
SELECT DISTINCT ?uri 
WHERE {
        res:Canada dbo:capital ?uri .
}"
155,Wer hat Friedrich Wilhelm Joseph Schelling inspiriert?,SELECT DISTINCT ?uri WHERE { ?uri <http://dbpedia.org/ontology/influenced> <http://dbpedia.org/resource/Vincent_van_Gogh> . }
156,In welcher Stadt ist John F. Kennedy gestorben?,"PREFIX dbo: <http://dbpedia.org/ontology/>
PREFIX res: <http://dbpedia.org/resource/>
PREFIX rdf: <http://www.w3.org/1999/02/22-rdf-syntax-ns#>
SELECT DISTINCT ?uri
WHERE { 
        res:John_F._Kennedy dbo:deathPlace ?uri .
        ?uri rdf:type dbo:City .
}"
157,War US-Pr├ñsident Jackson in einen Krieg verwickelt?,"PREFIX dbo: <http://dbpedia.org/ontology/>
PREFIX res: <http://dbpedia.org/resource/>
ASK 
WHERE {
	res:Andrew_Jackson dbo:battle ?battle .    
}"
158,Wer hat das Titellied f├╝r Games of Thrones geschrieben?,SELECT DISTINCT ?uri WHERE { <http://dbpedia.org/resource/Game_of_Thrones> <http://dbpedia.org/ontology/composer> ?uri. }
159,Wer hat die Brooklyn Bridge entworfen?,"PREFIX res: <http://dbpedia.org/resource/>
PREFIX dbo: <http://dbpedia.org/ontology/>
SELECT DISTINCT ?uri 
WHERE {
        res:Brooklyn_Bridge dbo:architect ?uri .
}"
