QALD id,QALD question,sparql
160,Wann hat Boris Becker seine aktive Karriere beendet?,SELECT DISTINCT ?d WHERE { <http://dbpedia.org/resource/Boris_Becker> <http://dbpedia.org/ontology/activeYearsEndDate> ?d . } 
161,Welche Traubenarten wachsen in Oregon?,SELECT DISTINCT ?uri WHERE { <http://dbpedia.org/resource/Oregon_wine> <http://dbpedia.org/ontology/growingGrape> ?uri . } 
162,Wie gro├ƒ ist Michael Jordan?,"PREFIX dbo: <http://dbpedia.org/ontology/>
PREFIX res: <http://dbpedia.org/resource/>
SELECT DISTINCT ?num 
WHERE {
        res:Michael_Jordan dbo:height ?num .
}"
163,Welcher Partei geh├Ârt die B├╝rgermeisterin von Paris an?,SELECT DISTINCT ?uri WHERE { <http://dbpedia.org/resource/Paris> <http://dbpedia.org/ontology/mayor> ?x . ?x <http://dbpedia.org/ontology/party> ?uri . }
164,Wer schrieb das Buch Die S├ñulen der Erde?,"PREFIX dbo: <http://dbpedia.org/ontology/>
PREFIX res: <http://dbpedia.org/resource/>
SELECT DISTINCT ?uri 
WHERE {
        res:The_Pillars_of_the_Earth dbo:author ?uri .
}"
165,Wer war der 16. Pr├ñsident der Vereinigten Staaten?,"PREFIX dbo: <http://dbpedia.org/ontology/>
PREFIX rdf: <http://www.w3.org/1999/02/22-rdf-syntax-ns#>
SELECT DISTINCT ?uri
WHERE {
         ?uri dbo:office 'President of the United States' .
         ?uri dbo:orderInOffice '16th' .
}"
166,Wie hoch ist der Mount Everest?,"PREFIX dbo: <http://dbpedia.org/ontology/>
PREFIX res: <http://dbpedia.org/resource/>
SELECT DISTINCT ?num 
WHERE {
	res:Mount_Everest dbo:elevation ?num.
}"
167,Wer war der Doktorvater von Albert Einstein?,SELECT DISTINCT ?uri WHERE { <http://dbpedia.org/resource/Albert_Einstein> <http://dbpedia.org/ontology/doctoralAdvisor> ?uri . }
168,In welcher Stadt wohnt Sylvester Stallone?,SELECT DISTINCT ?uri WHERE { ?uri a <http://dbpedia.org/ontology/City> . <http://dbpedia.org/resource/Sylvester_Stallone> <http://dbpedia.org/ontology/residence> ?uri . }
169,Was ist die W├ñhrung der Tschechischen Republik?,"PREFIX dbo: <http://dbpedia.org/ontology/>
PREFIX res: <http://dbpedia.org/resource/>
SELECT DISTINCT ?uri
WHERE {
	res:Czech_Republic dbo:currency ?uri .
}"
170,Hat Sokrates Aristoteles beeinflusst?,"PREFIX dbo: <http://dbpedia.org/ontology/>
PREFIX res: <http://dbpedia.org/resource/>
ASK 
WHERE {
	res:Aristotle dbo:influencedBy res:Socrates .
}"
171,In welcher Zeitzone liegt Salt Lake City?,"PREFIX res: <http://dbpedia.org/resource/>
PREFIX dbp: <http://dbpedia.org/property/>
SELECT DISTINCT ?uri 
WHERE {
	res:Salt_Lake_City dbp:timezone ?uri . 
}"
172,Wer ist der Sohn von Sonny und Cher?,SELECT DISTINCT ?uri WHERE { ?uri <http://dbpedia.org/ontology/parent> <http://dbpedia.org/resource/Cher> . ?uri <http://dbpedia.org/ontology/parent> <http://dbpedia.org/resource/Sonny_Bono> . }
173,In welcher Stadt ist das Hauptquartier der Vereinten Nationen?,SELECT DISTINCT ?uri WHERE { <http://dbpedia.org/resource/Headquarters_of_the_United_Nations> <http://dbpedia.org/ontology/location> ?uri . ?uri a <http://dbpedia.org/ontology/City> . } 
174,Wer hat Penguin Books gegr├╝ndet?,"PREFIX dbo: <http://dbpedia.org/ontology/>
PREFIX res: <http://dbpedia.org/resource/>
PREFIX rdf: <http://www.w3.org/1999/02/22-rdf-syntax-ns#> 
SELECT DISTINCT ?uri
WHERE { 
        res:Penguin_Books dbo:founder ?uri .
}"
175,Wann wurde Jack Wolfskin gegr├╝ndet?,SELECT DISTINCT ?year WHERE {  <http://dbpedia.org/resource/Jack_Wolfskin> <http://dbpedia.org/ontology/foundingYear> ?year . } 
176,Wer ist der B├╝rgermeister von Moskau?,"PREFIX dbo: <http://dbpedia.org/ontology/>
PREFIX res: <http://dbpedia.org/resource/>
SELECT DISTINCT ?uri
WHERE {
        res:Rotterdam dbo:leaderName ?uri .
}"
179,Wer sind die Eltern der Frau von Juan Carlos I?,"PREFIX dbo: <http://dbpedia.org/ontology/> 
PREFIX res: <http://dbpedia.org/resource/> 
SELECT DISTINCT ?uri 
WHERE { 
        res:Juan_Carlos_I_of_Spain dbo:spouse ?x . 
        ?x dbo:parent ?uri . 
}"
180,Hat Tesla den Nobelpreis f├╝r Physik gewonnen?,"PREFIX dbo: <http://dbpedia.org/ontology/>
PREFIX res: <http://dbpedia.org/resource/>
ASK 
WHERE {
        res:Nikola_Tesla dbo:award res:Nobel_Prize_in_Physics .
}"
181,Wer ist der h├Âchste Basketballspieler?,SELECT DISTINCT ?uri WHERE {  ?uri <http://www.w3.org/1999/02/22-rdf-syntax-ns#type> <http://dbpedia.org/ontology/BasketballPlayer> .  ?uri <http://dbpedia.org/ontology/height> ?num . } ORDER BY DESC(?num) OFFSET 0 LIMIT 1 
182,Welche Stadt hat die wenigsten Einwohner?,SELECT DISTINCT ?uri WHERE {  ?uri <http://www.w3.org/1999/02/22-rdf-syntax-ns#type> <http://dbpedia.org/ontology/City> .  ?uri <http://dbpedia.org/ontology/populationTotal> ?pop . } ORDER BY ASC(?pop) OFFSET 0 LIMIT 1 
183,Ist Proinsulin ein Protein?,"PREFIX dbo: <http://dbpedia.org/ontology/>
PREFIX res: <http://dbpedia.org/resource/>
PREFIX rdf: <http://www.w3.org/1999/02/22-rdf-syntax-ns#>
ASK 
WHERE {
	res:Proinsulin rdf:type dbo:Protein .
}"
184,Wer waren die Eltern von K├Ânigin Viktoria?,"PREFIX dbo: <http://dbpedia.org/ontology/>
PREFIX res: <http://dbpedia.org/resource/>
SELECT DISTINCT ?uri
WHERE {
         res:Queen_Victoria dbo:parent ?uri .
}"
185,Hatte Che Guevara Kinder?,"PREFIX dbo: <http://dbpedia.org/ontology/>
PREFIX res: <http://dbpedia.org/resource/>
ASK
WHERE { 
        res:Che_Guevara dbo:child ?uri . 
}"
186,Ist der Baikalsee gr├Â├ƒer als der Gro├ƒe B├ñrensee?,"PREFIX res: <http://dbpedia.org/resource/>
PREFIX dbo: <http://dbpedia.org/ontology/> 
ASK
WHERE {  
        res:Lake_Baikal dbo:areaTotal ?a1 . 
        res:Great_Bear_Lake dbo:areaTotal ?a2 .
        FILTER (?a1 > ?a2)
}"
187,Hat Kaurism├ñki jemals den Gro├ƒen Preis der Jury in Cannes gewonnen?,ASK WHERE { <http://dbpedia.org/resource/Aki_Kaurismäki> <http://dbpedia.org/ontology/award> <http://dbpedia.org/resource/Grand_Prix_(Cannes_Film_Festival)> . }
189,Wo liegt Fort Knox?,SELECT DISTINCT ?uri WHERE {  <http://dbpedia.org/resource/Fort_Knox> <http://dbpedia.org/property/location> ?uri . }
190,In welchem US-Bundesstaat liegt Fort Knox?,"PREFIX dbo: <http://dbpedia.org/ontology/>
PREFIX dbp: <http://dbpedia.org/property/>
PREFIX res: <http://dbpedia.org/resource/>
SELECT DISTINCT ?uri
WHERE {
	res:Fort_Knox dbp:location ?uri .
        ?uri dbo:country res:United_States .
}"
191,Wo liegt Syngman Rhee begraben?,SELECT DISTINCT ?uri WHERE { <http://dbpedia.org/resource/Syngman_Rhee> <http://dbpedia.org/ontology/restingPlace> ?uri . } 
192,In welcher Zeitzone liegt San Pedro de Atacama?,SELECT DISTINCT ?uri WHERE {  <http://dbpedia.org/resource/San_Pedro_de_Atacama> <http://dbpedia.org/ontology/timeZone> ?uri . } 
193,Welcher Stilrichtung geh├Ârte der Maler der Drei T├ñnzer an?,SELECT DISTINCT ?uri WHERE {  <http://dbpedia.org/resource/The_Three_Dancers> <http://dbpedia.org/ontology/author> ?person .  ?person <http://dbpedia.org/ontology/movement> ?uri . } 
194,Welcher Wissenschaftler ist bekannt f├╝r das Manhattan-Projekt und den Friedensnobelpreis?,"PREFIX res: <http://dbpedia.org/resource/>
PREFIX dbo: <http://dbpedia.org/ontology/> 
PREFIX rdf: <http://www.w3.org/1999/02/22-rdf-syntax-ns#>
SELECT DISTINCT ?uri
WHERE {
        ?uri dbo:knownFor res:Manhattan_Project .
        ?uri rdf:type dbo:Scientist .
        ?uri dbo:knownFor res:Nobel_Peace_Prize .
}"
197,Welches Museum in New York hat die meisten Besucher?,"PREFIX dbo: <http://dbpedia.org/ontology/>
PREFIX res: <http://dbpedia.org/resource/>
SELECT DISTINCT ?num
WHERE {
        res:Yokohama_Marine_Tower dbo:height ?num .
}"
198,Wie hoch ist der Yokohama Marine Tower?,"PREFIX dbo: <http://dbpedia.org/ontology/>
PREFIX res: <http://dbpedia.org/resource/>
ASK 
WHERE {
	<http://dbpedia.org/resource/Battlestar_Galactica_%281978_TV_series%29> dbo:numberOfEpisodes ?x .
	<http://dbpedia.org/resource/Battlestar_Galactica_%282004_TV_series%29> dbo:numberOfEpisodes ?y .
	FILTER (?y > ?x)
}"
199,Hat die neue Battlestar-Galactica-Serie mehr Episoden als die alte?,"PREFIX dbo: <http://dbpedia.org/ontology/>
PREFIX rdf: <http://www.w3.org/1999/02/22-rdf-syntax-ns#>
SELECT DISTINCT ?uri
WHERE {
        ?uri rdf:type dbo:DartsPlayer .
        ?uri dbo:birthDate ?date .
}
ORDER BY DESC(?date)
OFFSET 0 LIMIT 1"
200,Wer ist der j├╝ngste Dartspieler?,"PREFIX dbo: <http://dbpedia.org/ontology/>
PREFIX res: <http://dbpedia.org/resource/>
SELECT DISTINCT ?uri 
WHERE {
	res:World_of_Warcraft dbo:developer ?uri . 
}"
201,Wer hat das Videospiel World of Warcraft entwickelt?,"PREFIX dbo: <http://dbpedia.org/ontology/> 
PREFIX res: <http://dbpedia.org/resource/> 
PREFIX rdf: <http://www.w3.org/1999/02/22-rdf-syntax-ns#> 
SELECT ?uri 
WHERE { 
         ?uri rdf:type dbo:Pope . 
         res:Vatican_Television_Center dbo:foundedBy ?uri .
}"
202,Welcher Papst hat das Vatikanische Fernsehen gegr├╝ndet?,"PREFIX res: <http://dbpedia.org/resource/>
PREFIX dbo: <http://dbpedia.org/ontology/>
SELECT DISTINCT ?uri 
WHERE {
	res:Harold_and_Maude dbo:musicComposer ?uri .
}"
203,Wer hat die Musik f├╝r Harold und Maude komponiert?,SELECT DISTINCT ?uri WHERE {  <http://dbpedia.org/resource/The_Prodigy> <http://dbpedia.org/ontology/bandMember> ?uri . } 
207,In welchem Land liegt Mekka?,SELECT (COUNT(DISTINCT ?uri) as ?c) WHERE {  ?uri <http://www.w3.org/1999/02/22-rdf-syntax-ns#type> <http://dbpedia.org/ontology/Language> .  <http://dbpedia.org/resource/Colombia> <http://dbpedia.org/ontology/language> ?uri . } 
208,Wieviele Sprachen werden in Kolumbien gesprochen?,SELECT DISTINCT ?uri WHERE { ?uri a <http://dbpedia.org/ontology/Stadium> . ?uri <http://dbpedia.org/ontology/location> <http://dbpedia.org/resource/Spain> . ?uri <http://dbpedia.org/ontology/seatingCapacity> ?n . } ORDER BY DESC(?n) OFFSET 0 LIMIT 1
209,Was ist das gr├Â├ƒte Stadion in Spanien?,"PREFIX dbo: <http://dbpedia.org/ontology/>
PREFIX res: <http://dbpedia.org/resource/>
SELECT DISTINCT ?uri
WHERE {
	?uri dbo:occupation res:Surfing .
	?uri dbo:birthPlace res:Philippines .
}"
210,Welche Schauspieler wurden auf den Philippinen geboren?,SELECT DISTINCT ?uri WHERE { ?uri <http://dbpedia.org/ontology/governmentType> <http://dbpedia.org/resource/Borough_(New_York_City)> . }
211,Was sind die Stadtteile von Konstitutionelle Monarchie?,"PREFIX dbo: <http://dbpedia.org/ontology/>
PREFIX res: <http://dbpedia.org/resource/>
PREFIX rdf: <http://www.w3.org/1999/02/22-rdf-syntax-ns#>
ASK 
WHERE {
        res:Cola rdf:type dbo:Beverage .
}"
212,Ist Cola ein Getr├ñnk?,"SELECT DISTINCT ?d WHERE { <http://dbpedia.org/resource/Diana,_Princess_of_Wales> <http://dbpedia.org/ontology/deathDate> ?d . }"
213,Wann ist Elisabeth von Sachsen gestorben?,"PREFIX res: <http://dbpedia.org/resource/>
PREFIX dbo: <http://dbpedia.org/ontology/> 
SELECT DISTINCT ?uri
WHERE {
        ?uri dbo:wineProduced res:Sparkling_wine .
        ?uri dbo:location res:France .
}"
214,Wo in Frankreich wird Schaumwein hergestellt?,
