ID,status,sentence,TP,FP,FN,sparqlQueGG,sparqlQald,TP,FP,FN,Precision,Recall,Fscore,Status
1,WORK,List all boardgames by GMT.,8,0,0,PREFIX dbo: <http://dbpedia.org/ontology/> PREFIX res: <http://dbpedia.org/resource/> PREFIX rdfs: <http://www.w3.org/2000/01/rdf-schema#> SELECT ?uri WHERE { ?uri dbo:publisher res:GMT_Games },SELECT ?Answer WHERE { ?Answer <http://dbpedia.org/ontology/publisher> <http://dbpedia.org/resource/GMT_Games> .},8,0,0,1,1,1,WORK
11,N,Give me all Danish films.,0,0,122,PREFIX dbo: <http://dbpedia.org/ontology/> PREFIX res: <http://dbpedia.org/resource/> PREFIX rdf: <http://www.w3.org/1999/02/22-rdf-syntax-ns#> SELECT DISTINCT ?uri WHERE { ?uri rdf:type dbo:Film ; dbo:country res:Denmark },N,0,0,122,0,0,0,N
12,WORK,Which movies starring Brad Pitt were directed by Guy Ritchie?,1,10,0,PREFIX dbo: <http://dbpedia.org/ontology/> PREFIX res: <http://dbpedia.org/resource/> PREFIX rdf: <http://www.w3.org/1999/02/22-rdf-syntax-ns#> SELECT DISTINCT ?uri WHERE { ?uri rdf:type dbo:Film ; dbo:starring res:Brad_Pitt ; dbo:director res:Guy_Ritchie },SELECT ?Answer WHERE { ?Answer <http://dbpedia.org/ontology/director> <http://dbpedia.org/resource/Guy_Ritchie> .},1,10,0,0.09090909,1,0.16666667,WORK
20,WORK,Give me the Apollo 14 astronauts.,3,0,0,PREFIX dbo: <http://dbpedia.org/ontology/> PREFIX res: <http://dbpedia.org/resource/> SELECT DISTINCT ?uri WHERE { ?uri dbo:mission res:Apollo_14 },SELECT ?Answer WHERE { ?Answer <http://dbpedia.org/ontology/mission> <http://dbpedia.org/resource/Apollo_14> .},3,0,0,1,1,1,WORK
29,WORK,Show me all museums in London.,81,2357,0,SELECT DISTINCT ?uri WHERE { ?uri a <http://dbpedia.org/ontology/Museum> ; <http://dbpedia.org/ontology/location> <http://dbpedia.org/resource/London> },SELECT ?Answer WHERE { ?Answer <http://dbpedia.org/ontology/location> <http://dbpedia.org/resource/London> .},81,2357,0,0.033223953,1,0.06431123,WORK
33,WORK,Give me all writers that won the Nobel Prize in literature.,0,0,21,SELECT DISTINCT ?uri WHERE { ?uri a <http://dbpedia.org/ontology/Writer> ; <http://dbpedia.org/ontology/award> <http://dbpedia.org/resource/Nobel_Prize_in_Literature> },SELECT ?Answer WHERE { ?Answer <http://www.w3.org/1999/02/22-rdf-syntax-ns#type>   <http://dbpedia.org/ontology/Writer>. <http://dbpedia.org/resource/In_the_Heights> <http://dbpedia.org/ontology/award> ?Answer .},0,0,21,0,0,0,WORK
34,WORK,Show me all basketball players that are higher than 2 meters.,4269,0,0,SELECT DISTINCT ?uri WHERE { ?uri a <http://dbpedia.org/ontology/BasketballPlayer> ; <http://dbpedia.org/ontology/height> ?n FILTER ( ?n > 2.0 ) },SELECT DISTINCT ?Answer WHERE { ?Answer <http://www.w3.org/1999/02/22-rdf-syntax-ns#type>   <http://dbpedia.org/ontology/BasketballPlayer>. ?Answer <http://dbpedia.org/ontology/height> ?n FILTER ( ?n > 2 ) },4269,0,0,1,1,1,WORK
40,WORK,Give all swimmers that were born in Moscow.,55,0,0,SELECT DISTINCT ?uri WHERE { ?uri a <http://dbpedia.org/ontology/Swimmer> ; <http://dbpedia.org/ontology/birthPlace> <http://dbpedia.org/resource/Moscow> },SELECT ?Answer WHERE { ?Answer <http://www.w3.org/1999/02/22-rdf-syntax-ns#type>   <http://dbpedia.org/ontology/Swimmer>. ?Answer <http://dbpedia.org/ontology/birthPlace> <http://dbpedia.org/resource/Moscow> .},55,0,0,1,1,1,WORK
46,N,Show a list of soccer clubs that play in the Bundesliga.,0,0,52,SELECT DISTINCT ?uri WHERE { ?uri a <http://dbpedia.org/ontology/SoccerClub> ; <http://dbpedia.org/ontology/league> <http://dbpedia.org/resource/Bundesliga> },N,0,0,52,0,0,0,N
49,N,What is the official color of the University of Oxford?,0,0,1,SELECT DISTINCT ?string WHERE { <http://dbpedia.org/resource/University_of_Oxford> <http://dbpedia.org/ontology/officialSchoolColour> ?string },N,0,0,1,0,0,0,N
51,WORK,Give me all Danish movies.,0,0,122,SELECT DISTINCT ?uri WHERE { ?uri a <http://dbpedia.org/ontology/Film> ; <http://dbpedia.org/ontology/country> <http://dbpedia.org/resource/Denmark> },SELECT ?Answer WHERE { ?Answer <http://dbpedia.org/ontology/alias> <Nora Danish> .},0,0,122,0,0,0,WORK
55,WORK,Give me the capitals of all countries that the Himalayas run through.,0,1,1,SELECT DISTINCT ?uri WHERE { <http://dbpedia.org/resource/Himalayas> <http://dbpedia.org/ontology/country> ?country . ?country <http://dbpedia.org/ontology/capital> ?uri },SELECT ?Answer WHERE { ?Answer <http://dbpedia.org/ontology/foundationPlace> <http://dbpedia.org/resource/University_of_Nottingham> .},0,1,1,0,0,0,WORK
59,WORK,Give me all islands that belong to Japan.,0,0,88,SELECT DISTINCT ?uri WHERE { ?uri a <http://dbpedia.org/ontology/Island> ; <http://dbpedia.org/ontology/country> <http://dbpedia.org/resource/Japan> },SELECT ?Answer WHERE { ?Answer <http://www.w3.org/1999/02/22-rdf-syntax-ns#type>   <http://dbpedia.org/ontology/Island>. <http://dbpedia.org/resource/Yakitate!!_Japan> <http://dbpedia.org/property/genre> ?Answer .},0,0,88,0,0,0,WORK
64,N,Give me all soccer clubs in the Premier League.,0,0,264,SELECT DISTINCT ?uri WHERE { ?uri a <http://dbpedia.org/ontology/SoccerClub> ; <http://dbpedia.org/ontology/league> <http://dbpedia.org/resource/Premier_League> },N,0,0,264,0,0,0,N
65,N,What is the highest place of the Urals?,0,0,1,SELECT DISTINCT ?uri WHERE { <http://dbpedia.org/resource/Ural_Mountains> <http://dbpedia.org/property/highest> ?uri },N,0,0,1,0,0,0,N
78,WORK,Give me all federal chancellors of Germany.,0,2,13,"SELECT DISTINCT ?uri WHERE { ?uri a <http://dbpedia.org/ontology/Person> { ?uri <http://dbpedia.org/ontology/office> ""Chancellor of Germany"" } UNION { ?uri <http://dbpedia.org/property/office> <http://dbpedia.org/resource/Chancellor_of_Germany> } }",SELECT ?Answer WHERE { ?Answer <http://dbpedia.org/property/office> <http://dbpedia.org/resource/Germany> .},0,2,13,0,0,0,WORK
86,WORK,Give me all actors who were born in Berlin.,1,0,0,SELECT DISTINCT ?uri WHERE { ?uri a <http://dbpedia.org/ontology/Actor> ; <http://dbpedia.org/ontology/birthPlace> <http://dbpedia.org/resource/Berlin> },SELECT ?Answer WHERE { ?Answer <http://www.w3.org/1999/02/22-rdf-syntax-ns#type>   <http://dbpedia.org/ontology/Actor>. ?Answer <http://dbpedia.org/ontology/birthPlace> <http://dbpedia.org/resource/Berlin> .},1,0,0,1,1,1,WORK
91,WORK,Give me all the TV shows with Neil Patrick Harris.,0,2,12,SELECT DISTINCT ?uri WHERE { ?uri a <http://dbpedia.org/ontology/TelevisionShow> ; <http://dbpedia.org/ontology/starring> <http://dbpedia.org/resource/Neil_Patrick_Harris> },SELECT ?Answer WHERE { ?Answer <http://dbpedia.org/ontology/starring> <http://dbpedia.org/resource/The_Wiggles> .},0,2,12,0,0,0,WORK
93,N,What is the net income of Apple?,0,0,1,SELECT DISTINCT ?ni WHERE { <http://dbpedia.org/resource/Apple_Inc.> <http://dbpedia.org/ontology/netIncome> ?ni },N,0,0,1,0,0,0,N
96,WORK,List all the musicals with music by Leonard Bernstein.,8,0,0,SELECT DISTINCT ?uri WHERE { ?uri a <http://dbpedia.org/ontology/Musical> ; <http://dbpedia.org/ontology/musicBy> <http://dbpedia.org/resource/Leonard_Bernstein> },SELECT ?Answer WHERE { ?Answer <http://dbpedia.org/ontology/musicBy> <http://dbpedia.org/resource/Leonard_Bernstein> .},8,0,0,1,1,1,WORK
98,N,What is the largest metropolitan area in Washington state?,0,0,1,SELECT DISTINCT ?uri WHERE { <http://dbpedia.org/resource/Washington_(state)> <http://dbpedia.org/property/largestmetro> ?uri },N,0,0,1,0,0,0,N
205,WORK,In which country does the Nile start? (match with star),0,0,2,PREFIX dbo: <http://dbpedia.org/ontology/> PREFIX res: <http://dbpedia.org/resource/> SELECT DISTINCT ?uri WHERE { res:Nile dbo:sourceCountry ?uri },SELECT ?Answer WHERE { ?Answer <http://www.w3.org/1999/02/22-rdf-syntax-ns#type>   <http://dbpedia.org/ontology/Country>. <http://dbpedia.org/resource/The_Jewel_of_the_Nile> <http://dbpedia.org/ontology/starring> ?Answer .},0,0,2,0,0,0,WORK
244,WORK,How often did Jane Fonda marry? (argument),0,1,1,PREFIX dbo: <http://dbpedia.org/ontology/> PREFIX res: <http://dbpedia.org/resource/> SELECT (COUNT(DISTINCT ?uri) AS ?c) WHERE { res:Jane_Fonda dbo:spouse ?uri },SELECT (COUNT(DISTINCT ?Answer) AS ?c) WHERE { ?Answer <http://dbpedia.org/ontology/spouse> <http://dbpedia.org/resource/Jane_Fonda> .},0,1,1,0,0,0,WORK
253,WORK,Which companies produce hovercrafts? (does not work),0,0,3,PREFIX dbo: <http://dbpedia.org/ontology/> PREFIX res: <http://dbpedia.org/resource/> PREFIX rdf: <http://www.w3.org/1999/02/22-rdf-syntax-ns#> SELECT DISTINCT ?uri WHERE { ?uri rdf:type dbo:Company ; dbo:product res:Hovercraft },N,0,0,3,0,0,0,WORK
258,WORK,How many theories did Albert Einstein come up with? (regex error),0,1,1,PREFIX dbo: <http://dbpedia.org/ontology/> PREFIX dbr: <http://dbpedia.org/resource/> SELECT (COUNT(?uri) AS ?count) WHERE { dbr:Albert_Einstein dbo:knownFor ?uri },SELECT (COUNT(DISTINCT ?Answer) AS ?c) WHERE { <http://dbpedia.org/resource/Albert_Einstein> <http://dbpedia.org/ontology/award> ?Answer .},0,1,1,0,0,0,WORK
369,WORK,In which military conflicts did Lawrence of Arabia participate? (regex error),0,0,6,PREFIX dbo: <http://dbpedia.org/ontology/> PREFIX res: <http://dbpedia.org/resource/> SELECT DISTINCT ?uri WHERE { res:T._E._Lawrence dbo:battle ?uri },SELECT ?Answer WHERE { ?Answer <http://www.w3.org/1999/02/22-rdf-syntax-ns#type>   <http://dbpedia.org/ontology/MilitaryConflict>. <http://dbpedia.org/resource/Protectorate_of_South_Arabia> <http://dbpedia.org/ontology/currency> ?Answer .},0,0,6,0,0,0,WORK
377,WORK,In which city does Sylvester Stallone live? (regex error),0,0,1,PREFIX dbo: <http://dbpedia.org/ontology/> PREFIX res: <http://dbpedia.org/resource/> PREFIX rdf: <http://www.w3.org/1999/02/22-rdf-syntax-ns#> SELECT DISTINCT ?uri WHERE { ?uri rdf:type dbo:City . res:Sylvester_Stallone dbo:residence ?uri },SELECT ?Answer WHERE { ?Answer <http://www.w3.org/1999/02/22-rdf-syntax-ns#type>   <http://dbpedia.org/ontology/City>. <http://dbpedia.org/resource/Sylvester_(film)> <http://dbpedia.org/ontology/starring> ?Answer .},0,0,1,0,0,0,WORK
395,WORK,In which country does the Ganges start? (regex error),0,0,1,PREFIX dbo: <http://dbpedia.org/ontology/> PREFIX res: <http://dbpedia.org/resource/> SELECT DISTINCT ?uri WHERE { res:Ganges dbo:sourceCountry ?uri },SELECT ?Answer WHERE { ?Answer <http://www.w3.org/1999/02/22-rdf-syntax-ns#type>   <http://dbpedia.org/ontology/Country>. <http://dbpedia.org/resource/Walk_the_Walk> <http://dbpedia.org/ontology/starring> ?Answer .},0,0,1,0,0,0,WORK
401,WORK,Who writes the Farmers' Almanac? (triple not exist),0,1,0,PREFIX dbp: <http://dbpedia.org/property/> SELECT ?uri WHERE { <http://dbpedia.org/resource/Farmers'_Almanac> dbp:editor ?uri },"SELECT ?Answer WHERE { <http://dbpedia.org/resource/Neanderthals,_Bandits_and_Farmers> <http://dbpedia.org/ontology/author> ?Answer .}",0,1,0,0,0,0,WORK
