"ID","status","sentence","sparqlQueGG","sparqlQald","TP","FP","FN","Precision","Recall","Fscore","Status"
"1","WORK","List all boardgames by GMT","PREFIX dbo: <http://dbpedia.org/ontology/> PREFIX res: <http://dbpedia.org/resource/> PREFIX rdfs: <http://www.w3.org/2000/01/rdf-schema#> SELECT ?uri WHERE { ?uri dbo:publisher res:GMT_Games }","SELECT ?Answer WHERE { ?Answer <http://dbpedia.org/ontology/publisher> <http://dbpedia.org/resource/GMT_Games> .}","8.0","0.0","0.0","1.0","1.0","1.0","WORK"
"9","WORK","Give me all actors starring in movies directed by and starring William Shatner","PREFIX dbo: <http://dbpedia.org/ontology/> PREFIX res: <http://dbpedia.org/resource/> PREFIX dbp: <http://dbpedia.org/property/> SELECT DISTINCT ?uri WHERE { ?x dbo:director res:William_Shatner ; dbo:starring res:William_Shatner { ?x dbo:starring ?uri } UNION { ?x dbp:starring ?uri } }","SELECT ?Answer WHERE { ?Answer <http://www.w3.org/1999/02/22-rdf-syntax-ns#type>   <http://dbpedia.org/ontology/Actor>. <http://dbpedia.org/resource/Roast_Beef_and_Movies> <http://dbpedia.org/ontology/starring> ?Answer .}","0.0","0.0","12.0","0.0","0.0","0.0","WORK"
"11","WORK","Give me all Danish films","PREFIX dbo: <http://dbpedia.org/ontology/> PREFIX res: <http://dbpedia.org/resource/> PREFIX rdf: <http://www.w3.org/1999/02/22-rdf-syntax-ns#> SELECT DISTINCT ?uri WHERE { ?uri rdf:type dbo:Film ; dbo:country res:Denmark }","SELECT DISTINCT ?Answer WHERE { ?Answer <http://www.w3.org/1999/02/22-rdf-syntax-ns#type>   <http://dbpedia.org/ontology/Film>. ?Answer <http://dbpedia.org/ontology/country> <http://dbpedia.org/resource/Denmark> }","122.0","0.0","0.0","1.0","1.0","1.0","WORK"
"13","N","Give me the grandchildren of Bruce Lee","PREFIX dbo: <http://dbpedia.org/ontology/> PREFIX res: <http://dbpedia.org/resource/> SELECT DISTINCT ?uri WHERE { res:Bruce_Lee dbo:child ?child . ?child <http://dbpedia.org/property/children> ?uri }","N","0.0","0.0","1.0","0.0","0.0","0.0","N"
"20","WORK","Give me the Apollo 14 astronauts","PREFIX dbo: <http://dbpedia.org/ontology/> PREFIX res: <http://dbpedia.org/resource/> SELECT DISTINCT ?uri WHERE { ?uri dbo:mission res:Apollo_14 }","SELECT ?Answer WHERE { ?Answer <http://dbpedia.org/ontology/mission> <http://dbpedia.org/resource/Apollo_14> .}","3.0","0.0","0.0","1.0","1.0","1.0","WORK"
"24","N","Give me a list of all trumpet players that were bandleaders","PREFIX dbo: <http://dbpedia.org/ontology/> PREFIX res: <http://dbpedia.org/resource/> SELECT DISTINCT ?uri WHERE { ?uri dbo:occupation res:Bandleader ; dbo:instrument res:Trumpet }","SELECT ?Answer WHERE { ?Answer <http://dbpedia.org/ontology/occupation> <http://dbpedia.org/resource/Bandleader> . ?Answer <http://dbpedia.org/ontology/instrument> <http://dbpedia.org/resource/Trumpet> }","46.0","0.0","0.0","1.0","1.0","1.0","N"
"29","WORK","Show me all museums in London","SELECT DISTINCT ?uri WHERE { ?uri a <http://dbpedia.org/ontology/Museum> ; <http://dbpedia.org/ontology/location> <http://dbpedia.org/resource/London> }","N","0.0","0.0","81.0","0.0","0.0","0.0","WORK"
"33","WORK","Give me all writers that won the Nobel Prize in literature","SELECT DISTINCT ?uri WHERE { ?uri a <http://dbpedia.org/ontology/Writer> ; <http://dbpedia.org/ontology/award> <http://dbpedia.org/resource/Nobel_Prize_in_Literature> }","SELECT ?Answer WHERE { ?Answer <http://www.w3.org/1999/02/22-rdf-syntax-ns#type>   <http://dbpedia.org/ontology/Writer>. ?Answer <http://dbpedia.org/ontology/award> <http://dbpedia.org/resource/Nobel_Prize_in_Literature> .}","21.0","0.0","0.0","1.0","1.0","1.0","WORK"
"34","WORK","Show me all basketball players that are higher than 2 meters","SELECT DISTINCT ?uri WHERE { ?uri a <http://dbpedia.org/ontology/BasketballPlayer> ; <http://dbpedia.org/ontology/height> ?n FILTER ( ?n > 2.0 ) }","SELECT DISTINCT ?Answer WHERE { ?Answer <http://www.w3.org/1999/02/22-rdf-syntax-ns#type>   <http://dbpedia.org/ontology/BasketballPlayer>. ?Answer <http://dbpedia.org/ontology/height> ?n FILTER ( ?n > 2 ) }","4269.0","0.0","0.0","1.0","1.0","1.0","WORK"
"40","WORK","Give all swimmers that were born in Moscow","SELECT DISTINCT ?uri WHERE { ?uri a <http://dbpedia.org/ontology/Swimmer> ; <http://dbpedia.org/ontology/birthPlace> <http://dbpedia.org/resource/Moscow> }","SELECT ?Answer WHERE { ?Answer <http://www.w3.org/1999/02/22-rdf-syntax-ns#type>   <http://dbpedia.org/ontology/Swimmer>. ?Answer <http://dbpedia.org/ontology/birthPlace> <http://dbpedia.org/resource/Moscow> .}","55.0","0.0","0.0","1.0","1.0","1.0","WORK"
"42","WORK","Give me all Swiss non-profit organizations","SELECT DISTINCT ?uri WHERE { ?uri <http://dbpedia.org/ontology/type> <http://dbpedia.org/resource/Nonprofit_organization> { ?uri <http://dbpedia.org/ontology/location> <http://dbpedia.org/resource/Switzerland> } UNION { ?uri <http://dbpedia.org/ontology/location> ?x . ?x <http://dbpedia.org/ontology/country> <http://dbpedia.org/resource/Switzerland> } }","SELECT DISTINCT ?Answer WHERE { ?Answer <http://dbpedia.org/ontology/type>   <http://dbpedia.org/resource/Nonprofit_organization>. ?Answer <http://dbpedia.org/ontology/country> <http://dbpedia.org/resource/Switzerland> }","0.0","0.0","1.0","0.0","0.0","0.0","WORK"
"46","WORK","Show a list of soccer clubs that play in the Bundesliga","SELECT DISTINCT ?uri WHERE { ?uri a <http://dbpedia.org/ontology/SoccerClub> ; <http://dbpedia.org/ontology/league> <http://dbpedia.org/resource/Bundesliga> }","SELECT  ?Answer WHERE { ?Answer <http://www.w3.org/1999/02/22-rdf-syntax-ns#type> <http://dbpedia.org/ontology/SoccerClub> . ?Answer <http://dbpedia.org/ontology/league> <http://dbpedia.org/resource/Bundesliga> }","52.0","0.0","0.0","1.0","1.0","1.0","WORK"
"54","WORK","Give me all companies in Munich","SELECT DISTINCT ?uri WHERE { ?uri a <http://dbpedia.org/ontology/Company> { ?uri <http://dbpedia.org/ontology/location> <http://dbpedia.org/resource/Munich> } UNION { ?uri <http://dbpedia.org/ontology/headquarter> <http://dbpedia.org/resource/Munich> } UNION { ?uri <http://dbpedia.org/ontology/locationCity> <http://dbpedia.org/resource/Munich> } }","SELECT  ?Answer WHERE { ?Answer <http://www.w3.org/1999/02/22-rdf-syntax-ns#type> <http://dbpedia.org/ontology/Company> . ?Answer <http://dbpedia.org/ontology/headquarter> <http://dbpedia.org/resource/Munich>","0.0","0.0","140.0","0.0","0.0","0.0","WORK"
"55","WORK","Give me the capitals of all countries that the Himalayas run through","SELECT DISTINCT ?uri WHERE { <http://dbpedia.org/resource/Himalayas> <http://dbpedia.org/ontology/country> ?country . ?country <http://dbpedia.org/ontology/capital> ?uri }","SELECT ?Answer WHERE { ?Answer <http://dbpedia.org/ontology/foundationPlace> <http://dbpedia.org/resource/University_of_Nottingham> .}","0.0","1.0","1.0","0.0","0.0","0.0","WORK"
"59","WORK","Give me all islands that belong to Japan","SELECT DISTINCT ?uri WHERE { ?uri a <http://dbpedia.org/ontology/Island> ; <http://dbpedia.org/ontology/country> <http://dbpedia.org/resource/Japan> }","SELECT ?Answer WHERE { ?Answer <http://www.w3.org/1999/02/22-rdf-syntax-ns#type>   <http://dbpedia.org/ontology/Island>. ?Answer <http://dbpedia.org/ontology/country> <http://dbpedia.org/resource/Japan> .}","88.0","0.0","0.0","1.0","1.0","1.0","WORK"
"64","WORK","Give me all soccer clubs in the Premier League","SELECT DISTINCT ?uri WHERE { ?uri a <http://dbpedia.org/ontology/SoccerClub> ; <http://dbpedia.org/ontology/league> <http://dbpedia.org/resource/Premier_League> }","SELECT ?Answer WHERE { ?Answer <http://dbpedia.org/ontology/league> <http://dbpedia.org/resource/Premier_League> }","264.0","47.0","0.0","0.84887457","1.0","0.9182609","WORK"
"69","WORK","Give me all actors who were born in Paris after 1950","SELECT DISTINCT ?uri WHERE { ?uri <http://www.w3.org/1999/02/22-rdf-syntax-ns#type> <http://dbpedia.org/ontology/Actor> . ?uri <http://dbpedia.org/ontology/birthPlace> <http://dbpedia.org/resource/Paris> . ?uri <http://dbpedia.org/ontology/birthDate> ?date . FILTER ( ?date >= xsd:dateTime('1950-12-31T00:00:00Z')) }","SELECT ?Answer WHERE { ?Answer <http://www.w3.org/1999/02/22-rdf-syntax-ns#type>   <http://dbpedia.org/ontology/Actor>. ?Answer <http://dbpedia.org/ontology/birthPlace> <http://dbpedia.org/resource/Paris> .}","0.0","107.0","0.0","0.0","0.0","0.0","WORK"
"71","WORK","Give me all Australian nonprofit organizations","SELECT DISTINCT ?uri WHERE { ?uri <http://dbpedia.org/ontology/type> <http://dbpedia.org/resource/Nonprofit_organization> { ?uri <http://dbpedia.org/ontology/locationCountry> <http://dbpedia.org/resource/Australia> } UNION { ?uri <http://dbpedia.org/ontology/location> ?x . ?x <http://dbpedia.org/ontology/country> <http://dbpedia.org/resource/Australia> } }","SELECT DISTINCT ?Answer WHERE { ?Answer <http://dbpedia.org/ontology/type>   <http://dbpedia.org/resource/Nonprofit_organization>. ?Answer <http://dbpedia.org/ontology/country> <http://dbpedia.org/resource/Australia> }","0.0","0.0","1.0","0.0","0.0","0.0","WORK"
"73","N","Give me all ESA astronauts","SELECT DISTINCT ?uri WHERE { ?uri a <http://dbpedia.org/ontology/Astronaut> ; <http://dbpedia.org/property/type> <http://dbpedia.org/resource/European_Space_Agency> }","N","0.0","0.0","1.0","0.0","0.0","0.0","N"
"78","WORK","Give me all federal chancellors of Germany","SELECT DISTINCT ?uri WHERE { ?uri a <http://dbpedia.org/ontology/Person> { ?uri <http://dbpedia.org/ontology/office> ""Chancellor of Germany"" } UNION { ?uri <http://dbpedia.org/property/office> <http://dbpedia.org/resource/Chancellor_of_Germany> } }","SELECT ?Answer WHERE { ?Answer <http://dbpedia.org/property/office> <http://dbpedia.org/resource/Member_of_the_German_Bundestag> .}","0.0","1.0","13.0","0.0","0.0","0.0","WORK"
"86","WORK","Give me all actors who were born in Berlin","SELECT DISTINCT ?uri WHERE { ?uri a <http://dbpedia.org/ontology/Actor> ; <http://dbpedia.org/ontology/birthPlace> <http://dbpedia.org/resource/Berlin> }","SELECT ?Answer WHERE { ?Answer <http://www.w3.org/1999/02/22-rdf-syntax-ns#type>   <http://dbpedia.org/ontology/Actor>. ?Answer <http://dbpedia.org/ontology/birthPlace> <http://dbpedia.org/resource/Berlin> .}","1.0","0.0","0.0","1.0","1.0","1.0","WORK"
"87","WORK","Who created Goofy?","SELECT DISTINCT ?uri WHERE { <http://dbpedia.org/resource/Goofy> <http://dbpedia.org/ontology/creator> ?uri }","SELECT ?Answer WHERE { <http://dbpedia.org/resource/Goofy> <http://dbpedia.org/ontology/creator> ?Answer .}","3.0","0.0","0.0","1.0","1.0","1.0","WORK"
"91","WORK","Give me all the TV shows with Neil Patrick Harris","SELECT DISTINCT ?uri WHERE { ?uri a <http://dbpedia.org/ontology/TelevisionShow> ; <http://dbpedia.org/ontology/starring> <http://dbpedia.org/resource/Neil_Patrick_Harris> }","SELECT ?Answer WHERE { ?Answer <http://www.w3.org/1999/02/22-rdf-syntax-ns#type> <http://dbpedia.org/ontology/TelevisionShow>. ?Answer <http://dbpedia.org/ontology/starring> <http://dbpedia.org/resource/Neil_Patrick_Harris> .}","12.0","0.0","0.0","1.0","1.0","1.0","WORK"
"94","WORK","Give me all Swedish holidays","SELECT DISTINCT ?uri WHERE { ?uri a <http://dbpedia.org/ontology/Holiday> ; <http://dbpedia.org/ontology/country> <http://dbpedia.org/resource/Sweden> }","SELECT DISTINCT ?uri WHERE { ?uri a <http://dbpedia.org/ontology/Holiday> ; <http://dbpedia.org/ontology/country> <http://dbpedia.org/resource/Sweden> }","4.0","0.0","0.0","1.0","1.0","1.0","WORK"
"96","WORK","List all the musicals with music by Leonard Bernstein","SELECT DISTINCT ?uri WHERE { ?uri a <http://dbpedia.org/ontology/Musical> ; <http://dbpedia.org/ontology/musicBy> <http://dbpedia.org/resource/Leonard_Bernstein> }","SELECT ?Answer WHERE { ?Answer <http://dbpedia.org/ontology/musicBy> <http://dbpedia.org/resource/Patrick_Leonard> .}","0.0","1.0","8.0","0.0","0.0","0.0","WORK"
"103","N","Give me all types of eating disorders","SELECT DISTINCT ?uri WHERE { ?uri a <http://dbpedia.org/class/yago/WikicatEatingDisorders> }","N","0.0","0.0","0.0","0.0","0.0","0.0","N"
"109","WORK","Give me all books written by Danielle Steel","SELECT DISTINCT ?uri WHERE { ?uri a <http://dbpedia.org/ontology/Book> ; <http://dbpedia.org/ontology/author> <http://dbpedia.org/resource/Danielle_Steel> }","SELECT ?Answer WHERE { ?Answer <http://www.w3.org/1999/02/22-rdf-syntax-ns#type>   <http://dbpedia.org/ontology/Book>. ?Answer <http://dbpedia.org/ontology/author> <http://dbpedia.org/resource/Danielle_Steel> .}","47.0","0.0","0.0","1.0","1.0","1.0","WORK"
"113","N","Give me all libraries established earlier than 1400","SELECT DISTINCT ?uri WHERE { ?uri a <http://dbpedia.org/ontology/Library> ; <http://dbpedia.org/property/established> ?year FILTER ( ?year < 1400 ) }","SELECT ?Answer WHERE { ?Answer <http://www.w3.org/1999/02/22-rdf-syntax-ns#type> <http://dbpedia.org/ontology/Library> . ?Answer <http://dbpedia.org/property/established> ""1400""^^<http://www.w3.org/2001/XMLSchema#gYear>}","0.0","0.0","12.0","0.0","0.0","0.0","N"
"118","WORK","Give me all Methodist politicians","SELECT DISTINCT ?uri WHERE { ?uri a <http://dbpedia.org/ontology/Politician> ; <http://dbpedia.org/ontology/religion> <http://dbpedia.org/resource/Methodism> }","SELECT DISTINCT ?Answer WHERE { ?Answer <http://www.w3.org/1999/02/22-rdf-syntax-ns#type>   <http://dbpedia.org/ontology/Politician>. ?Answer <http://dbpedia.org/ontology/religion> <http://dbpedia.org/resource/Methodism> }","86.0","0.0","0.0","1.0","1.0","1.0","WORK"
"141","N","Give me the birthdays of all actors of the television show Charmed","SELECT DISTINCT ?date WHERE { <http://dbpedia.org/resource/Charmed> <http://dbpedia.org/ontology/starring> ?actor . ?actor <http://dbpedia.org/ontology/birthDate> ?date }","N","0.0","0.0","10.0","0.0","0.0","0.0","N"
"143","WORK","Give me a list of all lakes in Denmark","SELECT DISTINCT ?uri WHERE { { ?uri a <http://dbpedia.org/ontology/Lake> ; <http://dbpedia.org/ontology/country> <http://dbpedia.org/resource/Denmark> } UNION { ?uri a <http://dbpedia.org/class/yago/LakesOfDenmark> } }","SELECT ?Answer WHERE { ?Answer <http://www.w3.org/1999/02/22-rdf-syntax-ns#type> <http://dbpedia.org/ontology/Lake> . ?Answer <http://dbpedia.org/ontology/country> <http://dbpedia.org/resource/Denmark> }","8.0","0.0","0.0","1.0","1.0","1.0","WORK"
"158","N","List all episodes of the first season of the HBO television series The Sopranos!","PREFIX dbo: <http://dbpedia.org/ontology/> PREFIX res: <http://dbpedia.org/resource/> SELECT DISTINCT ?uri WHERE { ?uri dbo:series res:The_Sopranos ; dbo:seasonNumber 1 }","N","0.0","0.0","0.0","0.0","0.0","0.0","N"
"161","WORK","Give me all films produced by Hal Roach","SELECT DISTINCT ?uri WHERE { ?uri a <http://dbpedia.org/ontology/Film> ; <http://dbpedia.org/ontology/producer> <http://dbpedia.org/resource/Hal_Roach> }","SELECT ?Answer WHERE { ?Answer <http://www.w3.org/1999/02/22-rdf-syntax-ns#type>   <http://dbpedia.org/ontology/Film>. ?Answer <http://dbpedia.org/ontology/producer> <http://dbpedia.org/resource/Hal_Roach> .}","528.0","0.0","0.0","1.0","1.0","1.0","WORK"
"164","N","Give me a list of all bandleaders that play trumpet","SELECT DISTINCT ?uri WHERE { ?uri <http://dbpedia.org/ontology/occupation> <http://dbpedia.org/resource/Bandleader> ; <http://dbpedia.org/ontology/instrument> <http://dbpedia.org/resource/Trumpet> }","SELECT DISTINCT ?Answer WHERE { ?Answer <http://dbpedia.org/ontology/occupation> <http://dbpedia.org/resource/Bandleader> . ?Answer <http://dbpedia.org/ontology/instrument> <http://dbpedia.org/resource/Trumpet> }","46.0","0.0","0.0","1.0","1.0","1.0","N"
"171","WORK","Give me all movies with Tom Cruise","SELECT DISTINCT ?uri WHERE { ?uri a <http://dbpedia.org/ontology/Film> ; <http://dbpedia.org/ontology/starring> <http://dbpedia.org/resource/Tom_Cruise> }","SELECT ?Answer WHERE {?Answer <http://www.w3.org/1999/02/22-rdf-syntax-ns#type> <http://dbpedia.org/ontology/Film>  . ?Answer <http://dbpedia.org/ontology/starring> <http://dbpedia.org/resource/Tom_Cruise> .}","26.0","0.0","0.0","1.0","1.0","1.0","WORK"
"173","WORK","Give me all cities in New Jersey with more than 100000 inhabitants","PREFIX dbo: <http://dbpedia.org/ontology/> PREFIX res: <http://dbpedia.org/resource/> PREFIX dbp: <http://dbpedia.org/property/> PREFIX rdf: <http://www.w3.org/1999/02/22-rdf-syntax-ns#> SELECT DISTINCT ?uri WHERE { ?uri rdf:type dbo:City ; dbo:isPartOf res:New_Jersey ; dbo:populationTotal ?inhabitants FILTER ( ?inhabitants > 100000 ) }","N","0.0","0.0","4.0","0.0","0.0","0.0","WORK"
"175","N","Give me all B-sides of the Ramones","SELECT DISTINCT ?string WHERE { ?x <http://dbpedia.org/ontology/musicalArtist> <http://dbpedia.org/resource/Ramones> ; <http://dbpedia.org/ontology/bSide> ?string }","N","0.0","0.0","11.0","0.0","0.0","0.0","N"
"178","N","List the seven kings of Rome","SELECT DISTINCT ?uri WHERE { ?uri <http://dbpedia.org/property/title> <http://dbpedia.org/resource/King_of_Rome> }","N","0.0","0.0","7.0","0.0","0.0","0.0","N"
"179","N","Give me all people that were born in Vienna and died in Berlin","SELECT DISTINCT ?uri WHERE { ?uri <http://dbpedia.org/ontology/birthPlace> <http://dbpedia.org/resource/Vienna> ; <http://dbpedia.org/ontology/deathPlace> <http://dbpedia.org/resource/Berlin> }","N","0.0","0.0","13.0","0.0","0.0","0.0","N"
"182","WORK","Give me all films produced by Steven Spielberg with a budget of at least $80 million","SELECT DISTINCT ?uri WHERE { ?uri <http://www.w3.org/1999/02/22-rdf-syntax-ns#type> <http://dbpedia.org/ontology/Film> . ?uri <http://dbpedia.org/ontology/director> <http://dbpedia.org/resource/Steven_Spielberg> . ?uri <http://dbpedia.org/ontology/budget> ?b . FILTER( xsd:double(?b) >= 8.0E7 ) }","SELECT ?Answer WHERE { ?Answer <http://www.w3.org/1999/02/22-rdf-syntax-ns#type>   <http://dbpedia.org/ontology/Film>. <http://dbpedia.org/resource/Budget_Direct> <http://dbpedia.org/ontology/product> ?Answer .}","0.0","0.0","0.0","0.0","0.0","0.0","WORK"
"183","N","Give me all soccer clubs in Spain","SELECT DISTINCT ?uri WHERE { ?uri a <http://dbpedia.org/ontology/SoccerClub> { ?uri <http://dbpedia.org/ontology/ground> <http://dbpedia.org/resource/Spain> } UNION { ?uri <http://dbpedia.org/property/ground> ?ground FILTER regex(?ground, ""Spain"") } }","SELECT ?Answer WHERE {?Answer <http://www.w3.org/1999/02/22-rdf-syntax-ns#type> <http://dbpedia.org/ontology/SoccerClub> . ?Answer <http://dbpedia.org/ontology/ground> <http://dbpedia.org/resource/Spain> .}","700.0","0.0","0.0","1.0","1.0","1.0","N"
"185","N","Give me all breeds of the German Shepherd dog","SELECT DISTINCT ?uri WHERE { ?uri <http://dbpedia.org/property/breed> <http://dbpedia.org/resource/German_Shepherd> }","SELECT ?Answer WHERE {?Answer  <http://dbpedia.org/ontology/breed> <http://dbpedia.org/resource/German_Shepherd> .}","0.0","0.0","8.0","0.0","0.0","0.0","N"
"193","N","Is Cola a beverage?","PREFIX dbo: <http://dbpedia.org/ontology/> PREFIX res: <http://dbpedia.org/resource/> PREFIX rdf: <http://www.w3.org/1999/02/22-rdf-syntax-ns#> ASK WHERE { res:Cola rdf:type dbo:Beverage }","N","0.0","0.0","0.0","0.0","0.0","0.0","N"
"210","WORK","Who created Batman?","PREFIX dbo: <http://dbpedia.org/ontology/> PREFIX res: <http://dbpedia.org/resource/> SELECT DISTINCT ?uri WHERE { res:Batman dbo:creator ?uri }","SELECT ?Answer WHERE { <http://dbpedia.org/resource/Batman> <http://dbpedia.org/ontology/creator> ?Answer .}","2.0","0.0","0.0","1.0","1.0","1.0","WORK"
"213","WORK","Give me all movies directed by Francis Ford Coppola","PREFIX dbo: <http://dbpedia.org/ontology/> PREFIX res: <http://dbpedia.org/resource/> PREFIX rdf: <http://www.w3.org/1999/02/22-rdf-syntax-ns#> SELECT DISTINCT ?uri WHERE { ?uri rdf:type dbo:Film ; dbo:director res:Francis_Ford_Coppola }","SELECT ?Answer WHERE { ?Answer <http://www.w3.org/1999/02/22-rdf-syntax-ns#type>   <http://dbpedia.org/ontology/Film>. ?Answer <http://dbpedia.org/ontology/director> <http://dbpedia.org/resource/Francis_Ford_Coppola> .}","29.0","0.0","0.0","1.0","1.0","1.0","WORK"
"231","WORK","Give me all launch pads operated by NASA","PREFIX dbo: <http://dbpedia.org/ontology/> PREFIX res: <http://dbpedia.org/resource/> PREFIX rdf: <http://www.w3.org/1999/02/22-rdf-syntax-ns#> SELECT DISTINCT ?uri WHERE { ?uri rdf:type dbo:LaunchPad ; dbo:operator res:NASA }","SELECT ?Answer WHERE { ?Answer <http://www.w3.org/1999/02/22-rdf-syntax-ns#type>   <http://dbpedia.org/ontology/LaunchPad>. ?Answer <http://dbpedia.org/ontology/operator> <http://dbpedia.org/resource/NASA> .}","7.0","0.0","0.0","1.0","1.0","1.0","WORK"
"249","WORK","List all the musicals with music by Elton John","PREFIX dbo: <http://dbpedia.org/ontology/> PREFIX res: <http://dbpedia.org/resource/> PREFIX rdf: <http://www.w3.org/1999/02/22-rdf-syntax-ns#> SELECT DISTINCT ?uri WHERE { ?uri rdf:type dbo:Musical ; dbo:musicBy res:Elton_John }","SELECT ?Answer WHERE { ?Answer <http://dbpedia.org/ontology/musicBy> <http://dbpedia.org/resource/Elton_John> .}","5.0","0.0","0.0","1.0","1.0","1.0","WORK"
"260","N","Give me the runtime of Toy Story","PREFIX dbo: <http://dbpedia.org/ontology/> PREFIX res: <http://dbpedia.org/resource/> SELECT DISTINCT ?runtime WHERE { res:Toy_Story dbo:runtime ?runtime }","SELECT ?Answer WHERE { <http://dbpedia.org/resource/Toy_Story> <http://dbpedia.org/ontology/runtime> ?Answer ","0.0","0.0","1.0","0.0","0.0","0.0","N"
"275","WORK","List the children of Margaret Thatcher","PREFIX dbo: <http://dbpedia.org/ontology/> PREFIX res: <http://dbpedia.org/resource/> SELECT DISTINCT ?uri WHERE { res:Margaret_Thatcher dbo:child ?uri }","SELECT ?Answer WHERE { <http://dbpedia.org/resource/Margaret_Thatcher> <http://dbpedia.org/ontology/child> ?Answer .}","2.0","0.0","0.0","1.0","1.0","1.0","WORK"
"286","WORK","Give me all actors starring in movies directed by William Shatner","PREFIX dbo: <http://dbpedia.org/ontology/> PREFIX res: <http://dbpedia.org/resource/> SELECT DISTINCT ?uri WHERE { ?x dbo:director res:William_Shatner ; dbo:starring ?uri }","SELECT ?Answer WHERE { ?Answer <http://www.w3.org/1999/02/22-rdf-syntax-ns#type>   <http://dbpedia.org/ontology/Actor>. <http://dbpedia.org/resource/Directed_by_John_Ford> <http://dbpedia.org/ontology/starring> ?Answer .}","0.0","0.0","18.0","0.0","0.0","0.0","WORK"
"290","N","List all games by GMT","PREFIX dbo: <http://dbpedia.org/ontology/> PREFIX res: <http://dbpedia.org/resource/> SELECT DISTINCT ?uri WHERE { ?uri dbo:publisher res:GMT_Games }","SELECT ?Answer WHERE { ?Answer <http://dbpedia.org/ontology/publisher> <http://dbpedia.org/resource/GMT_Games> .}","8.0","0.0","0.0","1.0","1.0","1.0","N"
"295","WORK","Give me all video games published by Mean Hamster Software","PREFIX dbo: <http://dbpedia.org/ontology/> PREFIX res: <http://dbpedia.org/resource/> PREFIX rdf: <http://www.w3.org/1999/02/22-rdf-syntax-ns#> SELECT DISTINCT ?uri WHERE { ?uri rdf:type dbo:VideoGame ; dbo:publisher res:Mean_Hamster_Software }","SELECT ?Answer WHERE { ?Answer <http://www.w3.org/1999/02/22-rdf-syntax-ns#type>   <http://dbpedia.org/ontology/VideoGame>. ?Answer <http://dbpedia.org/ontology/publisher> <http://dbpedia.org/resource/Mean_Hamster_Software> .}","2.0","0.0","0.0","1.0","1.0","1.0","WORK"
"296","WORK","Give me all members of Prodigy","PREFIX dbo: <http://dbpedia.org/ontology/> PREFIX res: <http://dbpedia.org/resource/> SELECT DISTINCT ?uri WHERE { res:The_Prodigy dbo:bandMember ?uri }","SELECT ?Answer WHERE { <http://dbpedia.org/resource/The_Prodigy> <http://dbpedia.org/ontology/bandMember> ?Answer .}","3.0","0.0","0.0","1.0","1.0","1.0","WORK"
"305","N","Which holidays are celebrated around the world? ","PREFIX dbo: <http://dbpedia.org/ontology/> PREFIX rdf: <http://www.w3.org/1999/02/22-rdf-syntax-ns#> SELECT DISTINCT ?uri WHERE { ?uri rdf:type dbo:Holiday }","N","0.0","0.0","2184.0","0.0","0.0","0.0","N"
"313","N","Give me the birth place of Frank Sinatra","PREFIX dbo: <http://dbpedia.org/ontology/> PREFIX res: <http://dbpedia.org/resource/> SELECT DISTINCT ?place WHERE { res:Frank_Sinatra dbo:birthPlace ?place }","SELECT ?Answer WHERE { <http://dbpedia.org/resource/Frank_Sinatra> <http://dbpedia.org/ontology/birthPlace> ?Answer }","1.0","0.0","0.0","1.0","1.0","1.0","N"
"347","WORK","Show me all books in Asimov's Foundation series","PREFIX dbo: <http://dbpedia.org/ontology/> PREFIX res: <http://dbpedia.org/resource/> SELECT DISTINCT ?uri WHERE { ?uri dbo:series res:Foundation_series }","SELECT ?Answer WHERE { ?Answer <http://dbpedia.org/ontology/series> <http://dbpedia.org/resource/Foundation_series> }","3.0","0.0","0.0","1.0","1.0","1.0","WORK"
"367","N","Give me the grandchildren of Elvis Presley","PREFIX dbo: <http://dbpedia.org/ontology/> PREFIX res: <http://dbpedia.org/resource/> SELECT DISTINCT ?uri WHERE { res:Elvis_Presley dbo:child ?child . ?child dbo:child ?uri }","N","0.0","0.0","1.0","0.0","0.0","0.0","N"
"371","WORK","Give me all books by William Goldman with more than 300 pages","PREFIX dbo: <http://dbpedia.org/ontology/> PREFIX res: <http://dbpedia.org/resource/> PREFIX rdf: <http://www.w3.org/1999/02/22-rdf-syntax-ns#> SELECT DISTINCT ?uri WHERE { ?uri rdf:type dbo:Book ; dbo:author res:William_Goldman ; dbo:numberOfPages ?x FILTER ( ?x > 300 ) }","SELECT ?Answer WHERE { ?Answer <http://dbpedia.org/ontology/author> <http://dbpedia.org/resource/William_Goldman> .}","10.0","16.0","0.0","0.3846154","1.0","0.5555555","WORK"
"383","WORK","Show me the book that Muhammad Ali wrote","PREFIX dbo: <http://dbpedia.org/ontology/> PREFIX res: <http://dbpedia.org/resource/> PREFIX rdf: <http://www.w3.org/1999/02/22-rdf-syntax-ns#> SELECT DISTINCT ?uri WHERE { ?uri rdf:type dbo:Book ; dbo:author res:Muhammad_Ali }","SELECT ?Answer WHERE { ?Answer <http://www.w3.org/1999/02/22-rdf-syntax-ns#type>   <http://dbpedia.org/ontology/Book>. ?Answer <http://dbpedia.org/ontology/author> <http://dbpedia.org/resource/Muhammad_Ali> .}","2.0","0.0","0.0","1.0","1.0","1.0","WORK"
"391","N","Show me Hemingway's autobiography","PREFIX dbo: <http://dbpedia.org/ontology/> PREFIX res: <http://dbpedia.org/resource/> SELECT DISTINCT ?uri WHERE { ?uri dbo:author res:Ernest_Hemingway ; dbo:literaryGenre res:Autobiography }","SELECT ?Answer WHERE {  ?Answer <http://dbpedia.org/ontology/author> <http://dbpedia.org/resource/Ernest_Hemingway> .}","1.0","24.0","0.0","0.04","1.0","0.07692308","N"
"394","N","Give me all Canadian Grunge record labels","PREFIX dbo: <http://dbpedia.org/ontology/> PREFIX res: <http://dbpedia.org/resource/> PREFIX rdf: <http://www.w3.org/1999/02/22-rdf-syntax-ns#> SELECT DISTINCT ?uri WHERE { ?uri rdf:type dbo:RecordLabel ; dbo:genre res:Grunge ; dbo:country res:Canada }","N","0.0","0.0","1.0","0.0","0.0","0.0","N"
"402","WORK","Give me the currency of China","PREFIX dbo: <http://dbpedia.org/ontology/> PREFIX res: <http://dbpedia.org/resource/> SELECT DISTINCT ?uri WHERE { res:China dbo:currency ?uri }","SELECT ?Answer WHERE { <http://dbpedia.org/resource/China> <http://dbpedia.org/ontology/currency> ?Answer .}","1.0","0.0","0.0","1.0","1.0","1.0","WORK"
"403","WORK","Give me all Swedish oceanographers","PREFIX dbo: <http://dbpedia.org/ontology/> PREFIX res: <http://dbpedia.org/resource/> SELECT DISTINCT ?uri WHERE { ?uri dbo:field res:Oceanography ; dbo:birthPlace res:Sweden }","SELECT ?Answer WHERE { ?Answer <http://dbpedia.org/ontology/field> <http://dbpedia.org/resource/Oceanography> . ?Answer <http://dbpedia.org/ontology/birthPlace> <http://dbpedia.org/resource/Sweden> }","1.0","0.0","0.0","1.0","1.0","1.0","WORK"
"412","WORK","Give me all actors starring in Last Action Hero","PREFIX dbo: <http://dbpedia.org/ontology/> PREFIX res: <http://dbpedia.org/resource/> SELECT DISTINCT ?uri WHERE { res:Last_Action_Hero dbo:starring ?uri }","SELECT ?Answer WHERE { ?Answer <http://www.w3.org/1999/02/22-rdf-syntax-ns#type>   <http://dbpedia.org/ontology/Actor>. <http://dbpedia.org/resource/Last_Action_Hero> <http://dbpedia.org/ontology/starring> ?Answer .}","0.0","0.0","10.0","0.0","0.0","0.0","WORK"
